pyocd/FlashAlgo/source/freescale/devices/MKM33ZA5/MKM33ZA5_extension.h
/*
 * Constants & macros for individual ADC_CLP2 bitfields
 */

/*!
 * @name Register ADC_CLP2, field CLP2[7:0] (RW)
 *
 * Calibration Value
 */
/*@{*/
/*! @brief Read current value of the ADC_CLP2_CLP2 field. */
#define ADC_RD_CLP2_CLP2(base) ((ADC_CLP2_REG(base) & ADC_CLP2_CLP2_MASK) >> ADC_CLP2_CLP2_SHIFT)
#define ADC_BRD_CLP2_CLP2(base) (BME_UBFX32(&ADC_CLP2_REG(base), ADC_CLP2_CLP2_SHIFT, ADC_CLP2_CLP2_WIDTH))

/*! @brief Set the CLP2 field to a new value. */
#define ADC_WR_CLP2_CLP2(base, value) (ADC_RMW_CLP2(base, ADC_CLP2_CLP2_MASK, ADC_CLP2_CLP2(value)))
#define ADC_BWR_CLP2_CLP2(base, value) (BME_BFI32(&ADC_CLP2_REG(base), ((uint32_t)(value) << ADC_CLP2_CLP2_SHIFT), ADC_CLP2_CLP2_SHIFT, ADC_CLP2_CLP2_WIDTH))
/*@}*/

/*******************************************************************************
 * ADC_CLP1 - ADC Plus-Side General Calibration Value Register
 ******************************************************************************/

/*!
 * @brief ADC_CLP1 - ADC Plus-Side General Calibration Value Register (RW)
 *
 * Reset value: 0x00000040U
 *
 * For more information, see CLPD register description.
 */
/*!
 * @name Constants and macros for entire ADC_CLP1 register
 */
/*@{*/
#define ADC_RD_CLP1(base)        (ADC_CLP1_REG(base))
#define ADC_WR_CLP1(base, value) (ADC_CLP1_REG(base) = (value))
#define ADC_RMW_CLP1(base, mask, value) (ADC_WR_CLP1(base, (ADC_RD_CLP1(base) & ~(mask)) | (value)))
#define ADC_SET_CLP1(base, value) (BME_OR32(&ADC_CLP1_REG(base), (uint32_t)(value)))
#define ADC_CLR_CLP1(base, value) (BME_AND32(&ADC_CLP1_REG(base), (uint32_t)(~(value))))
#define ADC_TOG_CLP1(base, value) (BME_XOR32(&ADC_CLP1_REG(base), (uint32_t)(value)))
/*@}*/

/*
 * Constants & macros for individual ADC_CLP1 bitfields
 */

/*!
 * @name Register ADC_CLP1, field CLP1[6:0] (RW)
 *
 * Calibration Value
 */
/*@{*/
/*! @brief Read current value of the ADC_CLP1_CLP1 field. */
#define ADC_RD_CLP1_CLP1(base) ((ADC_CLP1_REG(base) & ADC_CLP1_CLP1_MASK) >> ADC_CLP1_CLP1_SHIFT)
#define ADC_BRD_CLP1_CLP1(base) (BME_UBFX32(&ADC_CLP1_REG(base), ADC_CLP1_CLP1_SHIFT, ADC_CLP1_CLP1_WIDTH))

/*! @brief Set the CLP1 field to a new value. */
#define ADC_WR_CLP1_CLP1(base, value) (ADC_RMW_CLP1(base, ADC_CLP1_CLP1_MASK, ADC_CLP1_CLP1(value)))
#define ADC_BWR_CLP1_CLP1(base, value) (BME_BFI32(&ADC_CLP1_REG(base), ((uint32_t)(value) << ADC_CLP1_CLP1_SHIFT), ADC_CLP1_CLP1_SHIFT, ADC_CLP1_CLP1_WIDTH))
/*@}*/

/*******************************************************************************
 * ADC_CLP0 - ADC Plus-Side General Calibration Value Register
 ******************************************************************************/

/*!
 * @brief ADC_CLP0 - ADC Plus-Side General Calibration Value Register (RW)
 *
 * Reset value: 0x00000020U
 *
 * For more information, see CLPD register description.
 */
/*!
 * @name Constants and macros for entire ADC_CLP0 register
 */
/*@{*/
#define ADC_RD_CLP0(base)        (ADC_CLP0_REG(base))
#define ADC_WR_CLP0(base, value) (ADC_CLP0_REG(base) = (value))
#define ADC_RMW_CLP0(base, mask, value) (ADC_WR_CLP0(base, (ADC_RD_CLP0(base) & ~(mask)) | (value)))
#define ADC_SET_CLP0(base, value) (BME_OR32(&ADC_CLP0_REG(base), (uint32_t)(value)))
#define ADC_CLR_CLP0(base, value) (BME_AND32(&ADC_CLP0_REG(base), (uint32_t)(~(value))))
#define ADC_TOG_CLP0(base, value) (BME_XOR32(&ADC_CLP0_REG(base), (uint32_t)(value)))
/*@}*/

/*
 * Constants & macros for individual ADC_CLP0 bitfields
 */

/*!
 * @name Register ADC_CLP0, field CLP0[5:0] (RW)
 *
 * Calibration Value
 */
/*@{*/
/*! @brief Read current value of the ADC_CLP0_CLP0 field. */
#define ADC_RD_CLP0_CLP0(base) ((ADC_CLP0_REG(base) & ADC_CLP0_CLP0_MASK) >> ADC_CLP0_CLP0_SHIFT)
#define ADC_BRD_CLP0_CLP0(base) (BME_UBFX32(&ADC_CLP0_REG(base), ADC_CLP0_CLP0_SHIFT, ADC_CLP0_CLP0_WIDTH))

/*! @brief Set the CLP0 field to a new value. */
#define ADC_WR_CLP0_CLP0(base, value) (ADC_RMW_CLP0(base, ADC_CLP0_CLP0_MASK, ADC_CLP0_CLP0(value)))
#define ADC_BWR_CLP0_CLP0(base, value) (BME_BFI32(&ADC_CLP0_REG(base), ((uint32_t)(value) << ADC_CLP0_CLP0_SHIFT), ADC_CLP0_CLP0_SHIFT, ADC_CLP0_CLP0_WIDTH))
/*@}*/

/*
 * MKM33ZA5 AFE
 *
 * Analog Front End
 *
 * Registers defined in this header file:
 * - AFE_CFR - Channel0 Configuration Register
 * - AFE_CR - Control Register
 * - AFE_CKR - Clock Configuration Register
 * - AFE_DI - DMA and Interrupt Register
 * - AFE_DR - Channel0 Delay Register
 * - AFE_RR - Channel0 Result Register
 * - AFE_SR - Status Register
 */

#define AFE_INSTANCE_COUNT (1U) /*!< Number of instances of the AFE module. */
#define AFE_IDX (0U) /*!< Instance number for AFE. */

/*******************************************************************************
 * AFE_CFR - Channel0 Configuration Register
 ******************************************************************************/

/*!
 * @brief AFE_CFR - Channel0 Configuration Register (RW)
 *
 * Reset value: 0x00080000U
 *
 * Channel0 Configuration Register has various fields to configure channel0 of
 * AFE. Any changes done in this register while the conversion is in progress will
 * come into effect from next conversion only.
 */
/*!
 * @name Constants and macros for entire AFE_CFR register
 */
/*@{*/
#define AFE_RD_CFR(base, index)  (AFE_CFR_REG(base, index))
#define AFE_WR_CFR(base, index, value) (AFE_CFR_REG(base, index) = (value))
#define AFE_RMW_CFR(base, index, mask, value) (AFE_WR_CFR(base, index, (AFE_RD_CFR(base, index) & ~(mask)) | (value)))
#define AFE_SET_CFR(base, index, value) (BME_OR32(&AFE_CFR_REG(base, index), (uint32_t)(value)))
#define AFE_CLR_CFR(base, index, value) (BME_AND32(&AFE_CFR_REG(base, index), (uint32_t)(~(value))))
#define AFE_TOG_CFR(base, index, value) (BME_XOR32(&AFE_CFR_REG(base, index), (uint32_t)(value)))
/*@}*/

/*
 * Constants & macros for individual AFE_CFR bitfields
 */

/*!
 * @name Register AFE_CFR, field HW_TRG[9] (RW)
 *
 * This field is used to select trigger source for conversion.
 *
 * Values:
 * - 0 - Software trigger select
 * - 1 - Hardware trigger select
 */
/*@{*/
/*! @brief Read current value of the AFE_CFR_HW_TRG field. */
#define AFE_RD_CFR_HW_TRG(base, index) ((AFE_CFR_REG(base, index) & AFE_CFR_HW_TRG_MASK) >> AFE_CFR_HW_TRG_SHIFT)
#define AFE_BRD_CFR_HW_TRG(base, index) (BME_UBFX32(&AFE_CFR_REG(base, index), AFE_CFR_HW_TRG_SHIFT, AFE_CFR_HW_TRG_WIDTH))

/*! @brief Set the HW_TRG field to a new value. */
#define AFE_WR_CFR_HW_TRG(base, index, value) (AFE_RMW_CFR(base, index, AFE_CFR_HW_TRG_MASK, AFE_CFR_HW_TRG(value)))
#define AFE_BWR_CFR_HW_TRG(base, index, value) (BME_BFI32(&AFE_CFR_REG(base, index), ((uint32_t)(value) << AFE_CFR_HW_TRG_SHIFT), AFE_CFR_HW_TRG_SHIFT, AFE_CFR_HW_TRG_WIDTH))
/*@}*/

/*!
 * @name Register AFE_CFR, field DEC_CLK_INP_SEL[10] (RW)
 *
 * This field is used to select on the chip modulator clock or an external clock
 * for the decimator in case of bypass mode.
 *
 * Values:
 * - 0 - On the chip modulator clock will be used
 * - 1 - External clock will be used.
 */
/*@{*/
/*! @brief Read current value of the AFE_CFR_DEC_CLK_INP_SEL field. */
#define AFE_RD_CFR_DEC_CLK_INP_SEL(base, index) ((AFE_CFR_REG(base, index) & AFE_CFR_DEC_CLK_INP_SEL_MASK) >> AFE_CFR_DEC_CLK_INP_SEL_SHIFT)
#define AFE_BRD_CFR_DEC_CLK_INP_SEL(base, index) (BME_UBFX32(&AFE_CFR_REG(base, index), AFE_CFR_DEC_CLK_INP_SEL_SHIFT, AFE_CFR_DEC_CLK_INP_SEL_WIDTH))

/*! @brief Set the DEC_CLK_INP_SEL field to a new value. */
#define AFE_WR_CFR_DEC_CLK_INP_SEL(base, index, value) (AFE_RMW_CFR(base, index, AFE_CFR_DEC_CLK_INP_SEL_MASK, AFE_CFR_DEC_CLK_INP_SEL(value)))
#define AFE_BWR_CFR_DEC_CLK_INP_SEL(base, index, value) (BME_BFI32(&AFE_CFR_REG(base, index), ((uint32_t)(value) << AFE_CFR_DEC_CLK_INP_SEL_SHIFT), AFE_CFR_DEC_CLK_INP_SEL_SHIFT, AFE_CFR_DEC_CLK_INP_SEL_WIDTH))
/*@}*/

/*!
 * @name Register AFE_CFR, field DEC_CLK_EDGE_SEL[11] (RW)
 *
 * This field is used to select rising edge or falling edge for registering
 * input data by the decimation filter in case of by-pass mode.
 *
 * Values:
 * - 0 - Posedge will be used.
 * - 1 - Negedge will be used.
 */
/*@{*/
/*! @brief Read current value of the AFE_CFR_DEC_CLK_EDGE_SEL field. */
#define AFE_RD_CFR_DEC_CLK_EDGE_SEL(base, index) ((AFE_CFR_REG(base, index) & AFE_CFR_DEC_CLK_EDGE_SEL_MASK) >> AFE_CFR_DEC_CLK_EDGE_SEL_SHIFT)
#define AFE_BRD_CFR_DEC_CLK_EDGE_SEL(base, index) (BME_UBFX32(&AFE_CFR_REG(base, index), AFE_CFR_DEC_CLK_EDGE_SEL_SHIFT, AFE_CFR_DEC_CLK_EDGE_SEL_WIDTH))

/*! @brief Set the DEC_CLK_EDGE_SEL field to a new value. */
#define AFE_WR_CFR_DEC_CLK_EDGE_SEL(base, index, value) (AFE_RMW_CFR(base, index, AFE_CFR_DEC_CLK_EDGE_SEL_MASK, AFE_CFR_DEC_CLK_EDGE_SEL(value)))
#define AFE_BWR_CFR_DEC_CLK_EDGE_SEL(base, index, value) (BME_BFI32(&AFE_CFR_REG(base, index), ((uint32_t)(value) << AFE_CFR_DEC_CLK_EDGE_SEL_SHIFT), AFE_CFR_DEC_CLK_EDGE_SEL_SHIFT, AFE_CFR_DEC_CLK_EDGE_SEL_WIDTH))
/*@}*/

/*!
 * @name Register AFE_CFR, field CC[12] (RW)
 *
 * Values:
 * - 0 - One conversion following a triggering event
 * - 1 - Continuous conversions following a triggering event.
 */
/*@{*/
/*! @brief Read current value of the AFE_CFR_CC field. */
#define AFE_RD_CFR_CC(base, index) ((AFE_CFR_REG(base, index) & AFE_CFR_CC_MASK) >> AFE_CFR_CC_SHIFT)
#define AFE_BRD_CFR_CC(base, index) (BME_UBFX32(&AFE_CFR_REG(base, index), AFE_CFR_CC_SHIFT, AFE_CFR_CC_WIDTH))

