pyocd/FlashAlgo/source/freescale/devices/MKM33ZA5/MKM33ZA5_extension.h
/*! @brief Set the DMAEN2 field to a new value. */
#define AFE_WR_DI_DMAEN2(base, value) (AFE_RMW_DI(base, AFE_DI_DMAEN2_MASK, AFE_DI_DMAEN2(value)))
#define AFE_BWR_DI_DMAEN2(base, value) (BME_BFI32(&AFE_DI_REG(base), ((uint32_t)(value) << AFE_DI_DMAEN2_SHIFT), AFE_DI_DMAEN2_SHIFT, AFE_DI_DMAEN2_WIDTH))
/*@}*/

/*!
 * @name Register AFE_DI, field DMAEN1[30] (RW)
 *
 * The DMA request is asserted for channel1 when the DMAEN1 and COC1 bits are
 * set.
 */
/*@{*/
/*! @brief Read current value of the AFE_DI_DMAEN1 field. */
#define AFE_RD_DI_DMAEN1(base) ((AFE_DI_REG(base) & AFE_DI_DMAEN1_MASK) >> AFE_DI_DMAEN1_SHIFT)
#define AFE_BRD_DI_DMAEN1(base) (BME_UBFX32(&AFE_DI_REG(base), AFE_DI_DMAEN1_SHIFT, AFE_DI_DMAEN1_WIDTH))

/*! @brief Set the DMAEN1 field to a new value. */
#define AFE_WR_DI_DMAEN1(base, value) (AFE_RMW_DI(base, AFE_DI_DMAEN1_MASK, AFE_DI_DMAEN1(value)))
#define AFE_BWR_DI_DMAEN1(base, value) (BME_BFI32(&AFE_DI_REG(base), ((uint32_t)(value) << AFE_DI_DMAEN1_SHIFT), AFE_DI_DMAEN1_SHIFT, AFE_DI_DMAEN1_WIDTH))
/*@}*/

/*!
 * @name Register AFE_DI, field DMAEN0[31] (RW)
 *
 * The DMA request is asserted for channel0 when the DMAEN0 and COC0 bits are
 * set.
 */
/*@{*/
/*! @brief Read current value of the AFE_DI_DMAEN0 field. */
#define AFE_RD_DI_DMAEN0(base) ((AFE_DI_REG(base) & AFE_DI_DMAEN0_MASK) >> AFE_DI_DMAEN0_SHIFT)
#define AFE_BRD_DI_DMAEN0(base) (BME_UBFX32(&AFE_DI_REG(base), AFE_DI_DMAEN0_SHIFT, AFE_DI_DMAEN0_WIDTH))

/*! @brief Set the DMAEN0 field to a new value. */
#define AFE_WR_DI_DMAEN0(base, value) (AFE_RMW_DI(base, AFE_DI_DMAEN0_MASK, AFE_DI_DMAEN0(value)))
#define AFE_BWR_DI_DMAEN0(base, value) (BME_BFI32(&AFE_DI_REG(base), ((uint32_t)(value) << AFE_DI_DMAEN0_SHIFT), AFE_DI_DMAEN0_SHIFT, AFE_DI_DMAEN0_WIDTH))
/*@}*/

/*******************************************************************************
 * AFE_DR - Channel0 Delay Register
 ******************************************************************************/

/*!
 * @brief AFE_DR - Channel0 Delay Register (RW)
 *
 * Reset value: 0x00000000U
 *
 * Channel0 Delay Register contains a 11-bit field used to insert a delay into
 * the trigger response of the decimation filters in order to provide phase
 * compensation between four channels.
 */
/*!
 * @name Constants and macros for entire AFE_DR register
 */
/*@{*/
#define AFE_RD_DR(base, index)   (AFE_DR_REG(base, index))
#define AFE_WR_DR(base, index, value) (AFE_DR_REG(base, index) = (value))
#define AFE_RMW_DR(base, index, mask, value) (AFE_WR_DR(base, index, (AFE_RD_DR(base, index) & ~(mask)) | (value)))
#define AFE_SET_DR(base, index, value) (BME_OR32(&AFE_DR_REG(base, index), (uint32_t)(value)))
#define AFE_CLR_DR(base, index, value) (BME_AND32(&AFE_DR_REG(base, index), (uint32_t)(~(value))))
#define AFE_TOG_DR(base, index, value) (BME_XOR32(&AFE_DR_REG(base, index), (uint32_t)(value)))
/*@}*/

/*
 * Constants & macros for individual AFE_DR bitfields
 */

/*!
 * @name Register AFE_DR, field DLY[10:0] (RW)
 *
 * This field can be used to provide phase compensation between four AFE
 * Channels in step of prescaled modulator clock periods. This delay will be seen in
 * every subsequent change to sampling phase after initial sampling.
 */
/*@{*/
/*! @brief Read current value of the AFE_DR_DLY field. */
#define AFE_RD_DR_DLY(base, index) ((AFE_DR_REG(base, index) & AFE_DR_DLY_MASK) >> AFE_DR_DLY_SHIFT)
#define AFE_BRD_DR_DLY(base, index) (BME_UBFX32(&AFE_DR_REG(base, index), AFE_DR_DLY_SHIFT, AFE_DR_DLY_WIDTH))

/*! @brief Set the DLY field to a new value. */
#define AFE_WR_DR_DLY(base, index, value) (AFE_RMW_DR(base, index, AFE_DR_DLY_MASK, AFE_DR_DLY(value)))
#define AFE_BWR_DR_DLY(base, index, value) (BME_BFI32(&AFE_DR_REG(base, index), ((uint32_t)(value) << AFE_DR_DLY_SHIFT), AFE_DR_DLY_SHIFT, AFE_DR_DLY_WIDTH))
/*@}*/

/*******************************************************************************
 * AFE_RR - Channel0 Result Register
 ******************************************************************************/

/*!
 * @brief AFE_RR - Channel0 Result Register (RO)
 *
 * Reset value: 0x00000000U
 *
 * Depending upon AFE_CR[RESULT_FORMAT] field result can be represented in
 * following ways: where (S= sign bit , V=valid result value, 0=zero) Left justified
 * 2's complement 32-bit : SVVVVVVVVVVVVVVVVVVVVVVV00000000 Right justified 2's
 * complement 32-bit : SSSSSSSSSVVVVVVVVVVVVVVVVVVVVVVV
 */
/*!
 * @name Constants and macros for entire AFE_RR register
 */
/*@{*/
#define AFE_RD_RR(base, index)   (AFE_RR_REG(base, index))
/*@}*/

/*
 * Constants & macros for individual AFE_RR bitfields
 */

/*!
 * @name Register AFE_RR, field SDR[22:0] (RO)
 *
 * This field represents valid sample value in 2's complement form.
 */
/*@{*/
/*! @brief Read current value of the AFE_RR_SDR field. */
#define AFE_RD_RR_SDR(base, index) ((AFE_RR_REG(base, index) & AFE_RR_SDR_MASK) >> AFE_RR_SDR_SHIFT)
#define AFE_BRD_RR_SDR(base, index) (AFE_RD_RR_SDR(base, index))
/*@}*/

/*!
 * @name Register AFE_RR, field SIGN_BITS[31:23] (RO)
 *
 * This field represents sign bits (bits 31 to 23 are filled with sign bits) if
 * result is right justified or else 31-bit will be signbit and the lowest 8LSBs
 * will be zeroes in case result is left justified. The formatting option can be
 * selected from AFE_CR[RESULT_FORMAT].
 */
/*@{*/
/*! @brief Read current value of the AFE_RR_SIGN_BITS field. */
#define AFE_RD_RR_SIGN_BITS(base, index) ((AFE_RR_REG(base, index) & AFE_RR_SIGN_BITS_MASK) >> AFE_RR_SIGN_BITS_SHIFT)
#define AFE_BRD_RR_SIGN_BITS(base, index) (BME_UBFX32(&AFE_RR_REG(base, index), AFE_RR_SIGN_BITS_SHIFT, AFE_RR_SIGN_BITS_WIDTH))
/*@}*/

/*******************************************************************************
 * AFE_SR - Status Register
 ******************************************************************************/

/*!
 * @brief AFE_SR - Status Register (RO)
 *
 * Reset value: 0x00000000U
 *
 * AFE Status Register has three types of flags COC, OVR, RDY that indicate the
 * status of each channel of AFE.
 */
/*!
 * @name Constants and macros for entire AFE_SR register
 */
/*@{*/
#define AFE_RD_SR(base)          (AFE_SR_REG(base))
/*@}*/

