pyocd/FlashAlgo/source/freescale/devices/MKM33ZA5/MKM33ZA5_extension.h
/*! @brief Set the FDSWW field to a new value. */
#define LCD_WR_FDCR_FDSWW(base, value) (LCD_RMW_FDCR(base, LCD_FDCR_FDSWW_MASK, LCD_FDCR_FDSWW(value)))
#define LCD_BWR_FDCR_FDSWW(base, value) (BME_BFI32(&LCD_FDCR_REG(base), ((uint32_t)(value) << LCD_FDCR_FDSWW_SHIFT), LCD_FDCR_FDSWW_SHIFT, LCD_FDCR_FDSWW_WIDTH))
/*@}*/

/*!
 * @name Register LCD_FDCR, field FDPRS[14:12] (RW)
 *
 * Fault detect sample clock frequency is:
 *
 * Values:
 * - 0 - 1/1 bus clock.
 * - 1 - 1/2 bus clock.
 */
/*@{*/
/*! @brief Read current value of the LCD_FDCR_FDPRS field. */
#define LCD_RD_FDCR_FDPRS(base) ((LCD_FDCR_REG(base) & LCD_FDCR_FDPRS_MASK) >> LCD_FDCR_FDPRS_SHIFT)
#define LCD_BRD_FDCR_FDPRS(base) (BME_UBFX32(&LCD_FDCR_REG(base), LCD_FDCR_FDPRS_SHIFT, LCD_FDCR_FDPRS_WIDTH))

/*! @brief Set the FDPRS field to a new value. */
#define LCD_WR_FDCR_FDPRS(base, value) (LCD_RMW_FDCR(base, LCD_FDCR_FDPRS_MASK, LCD_FDCR_FDPRS(value)))
#define LCD_BWR_FDCR_FDPRS(base, value) (BME_BFI32(&LCD_FDCR_REG(base), ((uint32_t)(value) << LCD_FDCR_FDPRS_SHIFT), LCD_FDCR_FDPRS_SHIFT, LCD_FDCR_FDPRS_WIDTH))
/*@}*/

/*******************************************************************************
 * LCD_FDSR - LCD Fault Detect Status Register
 ******************************************************************************/

/*!
 * @brief LCD_FDSR - LCD Fault Detect Status Register (RW)
 *
 * Reset value: 0x00000000U
 *
 * The reset value of this register depends on the reset type: POR - 0x0000_0000
 */
/*!
 * @name Constants and macros for entire LCD_FDSR register
 */
/*@{*/
#define LCD_RD_FDSR(base)        (LCD_FDSR_REG(base))
#define LCD_WR_FDSR(base, value) (LCD_FDSR_REG(base) = (value))
#define LCD_RMW_FDSR(base, mask, value) (LCD_WR_FDSR(base, (LCD_RD_FDSR(base) & ~(mask)) | (value)))
#define LCD_SET_FDSR(base, value) (BME_OR32(&LCD_FDSR_REG(base), (uint32_t)(value)))
#define LCD_CLR_FDSR(base, value) (BME_AND32(&LCD_FDSR_REG(base), (uint32_t)(~(value))))
#define LCD_TOG_FDSR(base, value) (BME_XOR32(&LCD_FDSR_REG(base), (uint32_t)(value)))
/*@}*/

/*
 * Constants & macros for individual LCD_FDSR bitfields
 */

/*!
 * @name Register LCD_FDSR, field FDCNT[7:0] (RO)
 *
 * Contains how many "one/high" are sampled inside the fault detect sample
 * window.
 *
 * Values:
 * - 0 - No "one" samples.
 * - 1 - 1 "one" samples.
 */
/*@{*/
/*! @brief Read current value of the LCD_FDSR_FDCNT field. */
#define LCD_RD_FDSR_FDCNT(base) ((LCD_FDSR_REG(base) & LCD_FDSR_FDCNT_MASK) >> LCD_FDSR_FDCNT_SHIFT)
#define LCD_BRD_FDSR_FDCNT(base) (BME_UBFX32(&LCD_FDSR_REG(base), LCD_FDSR_FDCNT_SHIFT, LCD_FDSR_FDCNT_WIDTH))
/*@}*/

/*!
 * @name Register LCD_FDSR, field FDCF[15] (W1C)
 *
 * FDCF indicates that the fault detection is completed. Writing 1 to this bit
 * clears it to zero. This bit also acts as an interrupt flag when FDCIEN is set.
 * Software can use either interrupt or polling to check whether one pin fault
 * detection is completed.
 *
 * Values:
 * - 0 - Fault detection is not completed.
 * - 1 - Fault detection is completed.
 */
/*@{*/
/*! @brief Read current value of the LCD_FDSR_FDCF field. */
#define LCD_RD_FDSR_FDCF(base) ((LCD_FDSR_REG(base) & LCD_FDSR_FDCF_MASK) >> LCD_FDSR_FDCF_SHIFT)
#define LCD_BRD_FDSR_FDCF(base) (BME_UBFX32(&LCD_FDSR_REG(base), LCD_FDSR_FDCF_SHIFT, LCD_FDSR_FDCF_WIDTH))

/*! @brief Set the FDCF field to a new value. */
#define LCD_WR_FDSR_FDCF(base, value) (LCD_RMW_FDSR(base, LCD_FDSR_FDCF_MASK, LCD_FDSR_FDCF(value)))
#define LCD_BWR_FDSR_FDCF(base, value) (BME_BFI32(&LCD_FDSR_REG(base), ((uint32_t)(value) << LCD_FDSR_FDCF_SHIFT), LCD_FDSR_FDCF_SHIFT, LCD_FDSR_FDCF_WIDTH))
/*@}*/

/*******************************************************************************
 * LCD_PEN - LCD Pin Enable register
 ******************************************************************************/

/*!
 * @brief LCD_PEN - LCD Pin Enable register (RW)
 *
 * Reset value: 0x00000000U
 *
 * When LCDEN = 1, each PEN bit enables the corresponding LCD pin (LCD_Pn) for
 * LCD waveform generation. Initialize these registers before enabling the LCD
 * controller. The reset value of this register depends on the reset type: POR -
 * 0x0000_0000
 */
/*!
 * @name Constants and macros for entire LCD_PEN register
 */
/*@{*/
#define LCD_RD_PEN(base, index)  (LCD_PEN_REG(base, index))
#define LCD_WR_PEN(base, index, value) (LCD_PEN_REG(base, index) = (value))
#define LCD_RMW_PEN(base, index, mask, value) (LCD_WR_PEN(base, index, (LCD_RD_PEN(base, index) & ~(mask)) | (value)))
#define LCD_SET_PEN(base, index, value) (BME_OR32(&LCD_PEN_REG(base, index), (uint32_t)(value)))
#define LCD_CLR_PEN(base, index, value) (BME_AND32(&LCD_PEN_REG(base, index), (uint32_t)(~(value))))
#define LCD_TOG_PEN(base, index, value) (BME_XOR32(&LCD_PEN_REG(base, index), (uint32_t)(value)))
/*@}*/

/*******************************************************************************
 * LCD_BPEN - LCD Back Plane Enable register
 ******************************************************************************/

/*!
 * @brief LCD_BPEN - LCD Back Plane Enable register (RW)
 *
 * Reset value: 0x00000000U
 *
 * When PEN[n] = 1, the BPEN[63:0] bits configure the corresponding LCD pin to
 * operate as an LCD back plane or an LCD front plane. Most applications set a
 * maximum of eight of these bits. Initialize these registers before enabling the
 * LCD controller. The reset value of this register depends on the reset type: POR
 * - 0x0000_0000
 */
/*!
 * @name Constants and macros for entire LCD_BPEN register
 */
/*@{*/
#define LCD_RD_BPEN(base, index) (LCD_BPEN_REG(base, index))
#define LCD_WR_BPEN(base, index, value) (LCD_BPEN_REG(base, index) = (value))
#define LCD_RMW_BPEN(base, index, mask, value) (LCD_WR_BPEN(base, index, (LCD_RD_BPEN(base, index) & ~(mask)) | (value)))
#define LCD_SET_BPEN(base, index, value) (BME_OR32(&LCD_BPEN_REG(base, index), (uint32_t)(value)))
#define LCD_CLR_BPEN(base, index, value) (BME_AND32(&LCD_BPEN_REG(base, index), (uint32_t)(~(value))))
#define LCD_TOG_BPEN(base, index, value) (BME_XOR32(&LCD_BPEN_REG(base, index), (uint32_t)(value)))
/*@}*/

