pyocd/FlashAlgo/source/freescale/devices/MKM33ZA5/MKM33ZA5_extension.h
/*******************************************************************************
 * LCD_WF - LCD Waveform register
 ******************************************************************************/

/*!
 * @brief LCD_WF - LCD Waveform register (RW)
 *
 * Reset value: 0x00000000U
 *
 * Each of the WFyTOx registers contains four waveform control (WFn) fields,
 * where x is the n index value of the WFn field in the least significant byte (bits
 * 7-0) and y is the n index value of the WFn field in the most significant byte
 * (bits 31-24). The bits in each WFn field control the front plane segments or
 * back plane phases connected to the LCD_Pn signal. In an LCD controller, each
 * element consists of a front plane segment and a back plane phase. These
 * segments and phases are labeled A through H (x8 multiplexing, 1/8 duty cycle). Each
 * LCD_Pn signal can be connected to one or more segments (in front plane
 * operation) or one or more phases (in back plane operation). An LCD element is turned
 * on when the associated back plane phase is activated and the front plane
 * segment is on. If LCD_Pn is configured for front plane operation, the bits in WFn
 * turn on or off each of the front plane segments connected to LCD_Pn: bit 0
 * controls segment A, bit 1 controls segment B, and so on. If LCD_Pn is configured
 * for back plane operation, the bits in WFn activate or deactivate each of the
 * back plane phases connected to LCD_Pn: bit 0 controls phase A, bit 1 controls
 * phase B, and so on. Software can write to this register with 8-bit, 16-bit, or
 * 32-bit writes. After reset, the WFyTOx register is cleared to 0. The reset value
 * of this register depends on the reset type: POR - 0x0000_0000
 */
/*!
 * @name Constants and macros for entire LCD_WF register
 */
/*@{*/
#define LCD_RD_WF(base, index)   (LCD_WF_REG(base, index))
#define LCD_WR_WF(base, index, value) (LCD_WF_REG(base, index) = (value))
#define LCD_RMW_WF(base, index, mask, value) (LCD_WR_WF(base, index, (LCD_RD_WF(base, index) & ~(mask)) | (value)))
#define LCD_SET_WF(base, index, value) (BME_OR32(&LCD_WF_REG(base, index), (uint32_t)(value)))
#define LCD_CLR_WF(base, index, value) (BME_AND32(&LCD_WF_REG(base, index), (uint32_t)(~(value))))
#define LCD_TOG_WF(base, index, value) (BME_XOR32(&LCD_WF_REG(base, index), (uint32_t)(value)))
/*@}*/

/*
 * Constants & macros for individual LCD_WF bitfields
 */

/*!
 * @name Register LCD_WF, field WF0[7:0] (RW)
 *
 * Controls segments or phases connected to LCD_P0 as described above for WF3.
 */
/*@{*/
/*! @brief Read current value of the LCD_WF_WF0 field. */
#define LCD_RD_WF_WF0(base, index) ((LCD_WF_REG(base, index) & LCD_WF_WF0_MASK) >> LCD_WF_WF0_SHIFT)
#define LCD_BRD_WF_WF0(base, index) (BME_UBFX32(&LCD_WF_REG(base, index), LCD_WF_WF0_SHIFT, LCD_WF_WF0_WIDTH))

/*! @brief Set the WF0 field to a new value. */
#define LCD_WR_WF_WF0(base, index, value) (LCD_RMW_WF(base, index, LCD_WF_WF0_MASK, LCD_WF_WF0(value)))
#define LCD_BWR_WF_WF0(base, index, value) (BME_BFI32(&LCD_WF_REG(base, index), ((uint32_t)(value) << LCD_WF_WF0_SHIFT), LCD_WF_WF0_SHIFT, LCD_WF_WF0_WIDTH))
/*@}*/

/*!
 * @name Register LCD_WF, field WF60[7:0] (RW)
 *
 * Controls segments or phases connected to LCD_P60 as described above for
 * WF3TO0[WF3].
 */
/*@{*/
/*! @brief Read current value of the LCD_WF_WF60 field. */
#define LCD_RD_WF_WF60(base, index) ((LCD_WF_REG(base, index) & LCD_WF_WF60_MASK) >> LCD_WF_WF60_SHIFT)
#define LCD_BRD_WF_WF60(base, index) (BME_UBFX32(&LCD_WF_REG(base, index), LCD_WF_WF60_SHIFT, LCD_WF_WF60_WIDTH))

/*! @brief Set the WF60 field to a new value. */
#define LCD_WR_WF_WF60(base, index, value) (LCD_RMW_WF(base, index, LCD_WF_WF60_MASK, LCD_WF_WF60(value)))
#define LCD_BWR_WF_WF60(base, index, value) (BME_BFI32(&LCD_WF_REG(base, index), ((uint32_t)(value) << LCD_WF_WF60_SHIFT), LCD_WF_WF60_SHIFT, LCD_WF_WF60_WIDTH))
/*@}*/

/*!
 * @name Register LCD_WF, field WF56[7:0] (RW)
 *
 * Controls segments or phases connected to LCD_P56 as described above for
 * WF3TO0[WF3].
 */
/*@{*/
/*! @brief Read current value of the LCD_WF_WF56 field. */
#define LCD_RD_WF_WF56(base, index) ((LCD_WF_REG(base, index) & LCD_WF_WF56_MASK) >> LCD_WF_WF56_SHIFT)
#define LCD_BRD_WF_WF56(base, index) (BME_UBFX32(&LCD_WF_REG(base, index), LCD_WF_WF56_SHIFT, LCD_WF_WF56_WIDTH))

/*! @brief Set the WF56 field to a new value. */
#define LCD_WR_WF_WF56(base, index, value) (LCD_RMW_WF(base, index, LCD_WF_WF56_MASK, LCD_WF_WF56(value)))
#define LCD_BWR_WF_WF56(base, index, value) (BME_BFI32(&LCD_WF_REG(base, index), ((uint32_t)(value) << LCD_WF_WF56_SHIFT), LCD_WF_WF56_SHIFT, LCD_WF_WF56_WIDTH))
/*@}*/

/*!
 * @name Register LCD_WF, field WF52[7:0] (RW)
 *
 * Controls segments or phases connected to LCD_P52 as described above for
 * WF3TO0[WF3].
 */
/*@{*/
/*! @brief Read current value of the LCD_WF_WF52 field. */
#define LCD_RD_WF_WF52(base, index) ((LCD_WF_REG(base, index) & LCD_WF_WF52_MASK) >> LCD_WF_WF52_SHIFT)
#define LCD_BRD_WF_WF52(base, index) (BME_UBFX32(&LCD_WF_REG(base, index), LCD_WF_WF52_SHIFT, LCD_WF_WF52_WIDTH))

/*! @brief Set the WF52 field to a new value. */
#define LCD_WR_WF_WF52(base, index, value) (LCD_RMW_WF(base, index, LCD_WF_WF52_MASK, LCD_WF_WF52(value)))
#define LCD_BWR_WF_WF52(base, index, value) (BME_BFI32(&LCD_WF_REG(base, index), ((uint32_t)(value) << LCD_WF_WF52_SHIFT), LCD_WF_WF52_SHIFT, LCD_WF_WF52_WIDTH))
/*@}*/

/*!
 * @name Register LCD_WF, field WF4[7:0] (RW)
 *
 * Controls segments or phases connected to LCD_P4 as described above for
 * WF3TO0[WF3].
 */
/*@{*/
/*! @brief Read current value of the LCD_WF_WF4 field. */
#define LCD_RD_WF_WF4(base, index) ((LCD_WF_REG(base, index) & LCD_WF_WF4_MASK) >> LCD_WF_WF4_SHIFT)
#define LCD_BRD_WF_WF4(base, index) (BME_UBFX32(&LCD_WF_REG(base, index), LCD_WF_WF4_SHIFT, LCD_WF_WF4_WIDTH))

/*! @brief Set the WF4 field to a new value. */
#define LCD_WR_WF_WF4(base, index, value) (LCD_RMW_WF(base, index, LCD_WF_WF4_MASK, LCD_WF_WF4(value)))
#define LCD_BWR_WF_WF4(base, index, value) (BME_BFI32(&LCD_WF_REG(base, index), ((uint32_t)(value) << LCD_WF_WF4_SHIFT), LCD_WF_WF4_SHIFT, LCD_WF_WF4_WIDTH))
/*@}*/

/*!
 * @name Register LCD_WF, field WF48[7:0] (RW)
 *
 * Controls segments or phases connected to LCD_P48 as described above for
 * WF3TO0[WF3].
 */
/*@{*/
/*! @brief Read current value of the LCD_WF_WF48 field. */
#define LCD_RD_WF_WF48(base, index) ((LCD_WF_REG(base, index) & LCD_WF_WF48_MASK) >> LCD_WF_WF48_SHIFT)
#define LCD_BRD_WF_WF48(base, index) (BME_UBFX32(&LCD_WF_REG(base, index), LCD_WF_WF48_SHIFT, LCD_WF_WF48_WIDTH))

