pyocd/FlashAlgo/source/freescale/devices/MKM33ZA5/MKM33ZA5_extension.h
/*! @brief Set the BPBLCD43 field to a new value. */
#define LCD_WR_WF8B_BPBLCD43(base, index, value) (LCD_RMW_WF8B(base, index, LCD_WF8B_BPBLCD43_MASK, LCD_WF8B_BPBLCD43(value)))
#define LCD_BWR_WF8B_BPBLCD43(base, index, value) (BME_BFI8(&LCD_WF8B_REG(base, index), ((uint8_t)(value) << LCD_WF8B_BPBLCD43_SHIFT), LCD_WF8B_BPBLCD43_SHIFT, LCD_WF8B_BPBLCD43_WIDTH))
/*@}*/

/*!
 * @name Register LCD_WF8B, field BPBLCD20[1] (RW)
 *
 * Values:
 * - 0 - LCD segment off or LCD backplane inactive for phase B
 * - 1 - LCD segment on or LCD backplane active for phase B
 */
/*@{*/
/*! @brief Read current value of the LCD_WF8B_BPBLCD20 field. */
#define LCD_RD_WF8B_BPBLCD20(base, index) ((LCD_WF8B_REG(base, index) & LCD_WF8B_BPBLCD20_MASK) >> LCD_WF8B_BPBLCD20_SHIFT)
#define LCD_BRD_WF8B_BPBLCD20(base, index) (BME_UBFX8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPBLCD20_SHIFT, LCD_WF8B_BPBLCD20_WIDTH))

/*! @brief Set the BPBLCD20 field to a new value. */
#define LCD_WR_WF8B_BPBLCD20(base, index, value) (LCD_RMW_WF8B(base, index, LCD_WF8B_BPBLCD20_MASK, LCD_WF8B_BPBLCD20(value)))
#define LCD_BWR_WF8B_BPBLCD20(base, index, value) (BME_BFI8(&LCD_WF8B_REG(base, index), ((uint8_t)(value) << LCD_WF8B_BPBLCD20_SHIFT), LCD_WF8B_BPBLCD20_SHIFT, LCD_WF8B_BPBLCD20_WIDTH))
/*@}*/

/*!
 * @name Register LCD_WF8B, field BPBLCD9[1] (RW)
 *
 * Values:
 * - 0 - LCD segment off or LCD backplane inactive for phase B
 * - 1 - LCD segment on or LCD backplane active for phase B
 */
/*@{*/
/*! @brief Read current value of the LCD_WF8B_BPBLCD9 field. */
#define LCD_RD_WF8B_BPBLCD9(base, index) ((LCD_WF8B_REG(base, index) & LCD_WF8B_BPBLCD9_MASK) >> LCD_WF8B_BPBLCD9_SHIFT)
#define LCD_BRD_WF8B_BPBLCD9(base, index) (BME_UBFX8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPBLCD9_SHIFT, LCD_WF8B_BPBLCD9_WIDTH))

/*! @brief Set the BPBLCD9 field to a new value. */
#define LCD_WR_WF8B_BPBLCD9(base, index, value) (LCD_RMW_WF8B(base, index, LCD_WF8B_BPBLCD9_MASK, LCD_WF8B_BPBLCD9(value)))
#define LCD_BWR_WF8B_BPBLCD9(base, index, value) (BME_BFI8(&LCD_WF8B_REG(base, index), ((uint8_t)(value) << LCD_WF8B_BPBLCD9_SHIFT), LCD_WF8B_BPBLCD9_SHIFT, LCD_WF8B_BPBLCD9_WIDTH))
/*@}*/

/*!
 * @name Register LCD_WF8B, field BPBLCD7[1] (RW)
 *
 * Values:
 * - 0 - LCD segment off or LCD backplane inactive for phase B
 * - 1 - LCD segment on or LCD backplane active for phase B
 */
/*@{*/
/*! @brief Read current value of the LCD_WF8B_BPBLCD7 field. */
#define LCD_RD_WF8B_BPBLCD7(base, index) ((LCD_WF8B_REG(base, index) & LCD_WF8B_BPBLCD7_MASK) >> LCD_WF8B_BPBLCD7_SHIFT)
#define LCD_BRD_WF8B_BPBLCD7(base, index) (BME_UBFX8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPBLCD7_SHIFT, LCD_WF8B_BPBLCD7_WIDTH))

/*! @brief Set the BPBLCD7 field to a new value. */
#define LCD_WR_WF8B_BPBLCD7(base, index, value) (LCD_RMW_WF8B(base, index, LCD_WF8B_BPBLCD7_MASK, LCD_WF8B_BPBLCD7(value)))
#define LCD_BWR_WF8B_BPBLCD7(base, index, value) (BME_BFI8(&LCD_WF8B_REG(base, index), ((uint8_t)(value) << LCD_WF8B_BPBLCD7_SHIFT), LCD_WF8B_BPBLCD7_SHIFT, LCD_WF8B_BPBLCD7_WIDTH))
/*@}*/

/*!
 * @name Register LCD_WF8B, field BPBLCD50[1] (RW)
 *
 * Values:
 * - 0 - LCD segment off or LCD backplane inactive for phase B
 * - 1 - LCD segment on or LCD backplane active for phase B
 */
/*@{*/
/*! @brief Read current value of the LCD_WF8B_BPBLCD50 field. */
#define LCD_RD_WF8B_BPBLCD50(base, index) ((LCD_WF8B_REG(base, index) & LCD_WF8B_BPBLCD50_MASK) >> LCD_WF8B_BPBLCD50_SHIFT)
#define LCD_BRD_WF8B_BPBLCD50(base, index) (BME_UBFX8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPBLCD50_SHIFT, LCD_WF8B_BPBLCD50_WIDTH))

/*! @brief Set the BPBLCD50 field to a new value. */
#define LCD_WR_WF8B_BPBLCD50(base, index, value) (LCD_RMW_WF8B(base, index, LCD_WF8B_BPBLCD50_MASK, LCD_WF8B_BPBLCD50(value)))
#define LCD_BWR_WF8B_BPBLCD50(base, index, value) (BME_BFI8(&LCD_WF8B_REG(base, index), ((uint8_t)(value) << LCD_WF8B_BPBLCD50_SHIFT), LCD_WF8B_BPBLCD50_SHIFT, LCD_WF8B_BPBLCD50_WIDTH))
/*@}*/

/*!
 * @name Register LCD_WF8B, field BPBLCD40[1] (RW)
 *
 * Values:
 * - 0 - LCD segment off or LCD backplane inactive for phase B
 * - 1 - LCD segment on or LCD backplane active for phase B
 */
/*@{*/
/*! @brief Read current value of the LCD_WF8B_BPBLCD40 field. */
#define LCD_RD_WF8B_BPBLCD40(base, index) ((LCD_WF8B_REG(base, index) & LCD_WF8B_BPBLCD40_MASK) >> LCD_WF8B_BPBLCD40_SHIFT)
#define LCD_BRD_WF8B_BPBLCD40(base, index) (BME_UBFX8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPBLCD40_SHIFT, LCD_WF8B_BPBLCD40_WIDTH))

/*! @brief Set the BPBLCD40 field to a new value. */
#define LCD_WR_WF8B_BPBLCD40(base, index, value) (LCD_RMW_WF8B(base, index, LCD_WF8B_BPBLCD40_MASK, LCD_WF8B_BPBLCD40(value)))
#define LCD_BWR_WF8B_BPBLCD40(base, index, value) (BME_BFI8(&LCD_WF8B_REG(base, index), ((uint8_t)(value) << LCD_WF8B_BPBLCD40_SHIFT), LCD_WF8B_BPBLCD40_SHIFT, LCD_WF8B_BPBLCD40_WIDTH))
/*@}*/

/*!
 * @name Register LCD_WF8B, field BPBLCD63[1] (RW)
 *
 * Values:
 * - 0 - LCD segment off or LCD backplane inactive for phase B
 * - 1 - LCD segment on or LCD backplane active for phase B
 */
/*@{*/
/*! @brief Read current value of the LCD_WF8B_BPBLCD63 field. */
#define LCD_RD_WF8B_BPBLCD63(base, index) ((LCD_WF8B_REG(base, index) & LCD_WF8B_BPBLCD63_MASK) >> LCD_WF8B_BPBLCD63_SHIFT)
#define LCD_BRD_WF8B_BPBLCD63(base, index) (BME_UBFX8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPBLCD63_SHIFT, LCD_WF8B_BPBLCD63_WIDTH))

/*! @brief Set the BPBLCD63 field to a new value. */
#define LCD_WR_WF8B_BPBLCD63(base, index, value) (LCD_RMW_WF8B(base, index, LCD_WF8B_BPBLCD63_MASK, LCD_WF8B_BPBLCD63(value)))
#define LCD_BWR_WF8B_BPBLCD63(base, index, value) (BME_BFI8(&LCD_WF8B_REG(base, index), ((uint8_t)(value) << LCD_WF8B_BPBLCD63_SHIFT), LCD_WF8B_BPBLCD63_SHIFT, LCD_WF8B_BPBLCD63_WIDTH))
/*@}*/

/*!
 * @name Register LCD_WF8B, field BPBLCD26[1] (RW)
 *
 * Values:
 * - 0 - LCD segment off or LCD backplane inactive for phase B
 * - 1 - LCD segment on or LCD backplane active for phase B
 */
/*@{*/
/*! @brief Read current value of the LCD_WF8B_BPBLCD26 field. */
#define LCD_RD_WF8B_BPBLCD26(base, index) ((LCD_WF8B_REG(base, index) & LCD_WF8B_BPBLCD26_MASK) >> LCD_WF8B_BPBLCD26_SHIFT)
#define LCD_BRD_WF8B_BPBLCD26(base, index) (BME_UBFX8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPBLCD26_SHIFT, LCD_WF8B_BPBLCD26_WIDTH))

/*! @brief Set the BPBLCD26 field to a new value. */
#define LCD_WR_WF8B_BPBLCD26(base, index, value) (LCD_RMW_WF8B(base, index, LCD_WF8B_BPBLCD26_MASK, LCD_WF8B_BPBLCD26(value)))
#define LCD_BWR_WF8B_BPBLCD26(base, index, value) (BME_BFI8(&LCD_WF8B_REG(base, index), ((uint8_t)(value) << LCD_WF8B_BPBLCD26_SHIFT), LCD_WF8B_BPBLCD26_SHIFT, LCD_WF8B_BPBLCD26_WIDTH))
/*@}*/

/*!
 * @name Register LCD_WF8B, field BPBLCD12[1] (RW)
 *
 * Values:
 * - 0 - LCD segment off or LCD backplane inactive for phase B
 * - 1 - LCD segment on or LCD backplane active for phase B
 */
/*@{*/
/*! @brief Read current value of the LCD_WF8B_BPBLCD12 field. */
#define LCD_RD_WF8B_BPBLCD12(base, index) ((LCD_WF8B_REG(base, index) & LCD_WF8B_BPBLCD12_MASK) >> LCD_WF8B_BPBLCD12_SHIFT)
#define LCD_BRD_WF8B_BPBLCD12(base, index) (BME_UBFX8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPBLCD12_SHIFT, LCD_WF8B_BPBLCD12_WIDTH))

/*! @brief Set the BPBLCD12 field to a new value. */
#define LCD_WR_WF8B_BPBLCD12(base, index, value) (LCD_RMW_WF8B(base, index, LCD_WF8B_BPBLCD12_MASK, LCD_WF8B_BPBLCD12(value)))
#define LCD_BWR_WF8B_BPBLCD12(base, index, value) (BME_BFI8(&LCD_WF8B_REG(base, index), ((uint8_t)(value) << LCD_WF8B_BPBLCD12_SHIFT), LCD_WF8B_BPBLCD12_SHIFT, LCD_WF8B_BPBLCD12_WIDTH))
/*@}*/

/*!
 * @name Register LCD_WF8B, field BPBLCD19[1] (RW)
 *
 * Values:
 * - 0 - LCD segment off or LCD backplane inactive for phase B
 * - 1 - LCD segment on or LCD backplane active for phase B
 */
/*@{*/
/*! @brief Read current value of the LCD_WF8B_BPBLCD19 field. */
#define LCD_RD_WF8B_BPBLCD19(base, index) ((LCD_WF8B_REG(base, index) & LCD_WF8B_BPBLCD19_MASK) >> LCD_WF8B_BPBLCD19_SHIFT)
#define LCD_BRD_WF8B_BPBLCD19(base, index) (BME_UBFX8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPBLCD19_SHIFT, LCD_WF8B_BPBLCD19_WIDTH))

/*! @brief Set the BPBLCD19 field to a new value. */
#define LCD_WR_WF8B_BPBLCD19(base, index, value) (LCD_RMW_WF8B(base, index, LCD_WF8B_BPBLCD19_MASK, LCD_WF8B_BPBLCD19(value)))
#define LCD_BWR_WF8B_BPBLCD19(base, index, value) (BME_BFI8(&LCD_WF8B_REG(base, index), ((uint8_t)(value) << LCD_WF8B_BPBLCD19_SHIFT), LCD_WF8B_BPBLCD19_SHIFT, LCD_WF8B_BPBLCD19_WIDTH))
/*@}*/

/*!
 * @name Register LCD_WF8B, field BPBLCD34[1] (RW)
 *
 * Values:
 * - 0 - LCD segment off or LCD backplane inactive for phase B
 * - 1 - LCD segment on or LCD backplane active for phase B
 */
/*@{*/
/*! @brief Read current value of the LCD_WF8B_BPBLCD34 field. */
#define LCD_RD_WF8B_BPBLCD34(base, index) ((LCD_WF8B_REG(base, index) & LCD_WF8B_BPBLCD34_MASK) >> LCD_WF8B_BPBLCD34_SHIFT)
#define LCD_BRD_WF8B_BPBLCD34(base, index) (BME_UBFX8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPBLCD34_SHIFT, LCD_WF8B_BPBLCD34_WIDTH))

