pyocd/FlashAlgo/source/freescale/devices/MKM33ZA5/MKM33ZA5_extension.h
/*! @brief Set the BPELCD23 field to a new value. */
#define LCD_WR_WF8B_BPELCD23(base, index, value) (LCD_RMW_WF8B(base, index, LCD_WF8B_BPELCD23_MASK, LCD_WF8B_BPELCD23(value)))
#define LCD_BWR_WF8B_BPELCD23(base, index, value) (BME_BFI8(&LCD_WF8B_REG(base, index), ((uint8_t)(value) << LCD_WF8B_BPELCD23_SHIFT), LCD_WF8B_BPELCD23_SHIFT, LCD_WF8B_BPELCD23_WIDTH))
/*@}*/

/*!
 * @name Register LCD_WF8B, field BPELCD22[4] (RW)
 *
 * Values:
 * - 0 - LCD segment off or LCD backplane inactive for phase E
 * - 1 - LCD segment on or LCD backplane active for phase E
 */
/*@{*/
/*! @brief Read current value of the LCD_WF8B_BPELCD22 field. */
#define LCD_RD_WF8B_BPELCD22(base, index) ((LCD_WF8B_REG(base, index) & LCD_WF8B_BPELCD22_MASK) >> LCD_WF8B_BPELCD22_SHIFT)
#define LCD_BRD_WF8B_BPELCD22(base, index) (BME_UBFX8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPELCD22_SHIFT, LCD_WF8B_BPELCD22_WIDTH))

/*! @brief Set the BPELCD22 field to a new value. */
#define LCD_WR_WF8B_BPELCD22(base, index, value) (LCD_RMW_WF8B(base, index, LCD_WF8B_BPELCD22_MASK, LCD_WF8B_BPELCD22(value)))
#define LCD_BWR_WF8B_BPELCD22(base, index, value) (BME_BFI8(&LCD_WF8B_REG(base, index), ((uint8_t)(value) << LCD_WF8B_BPELCD22_SHIFT), LCD_WF8B_BPELCD22_SHIFT, LCD_WF8B_BPELCD22_WIDTH))
/*@}*/

/*!
 * @name Register LCD_WF8B, field BPELCD48[4] (RW)
 *
 * Values:
 * - 0 - LCD segment off or LCD backplane inactive for phase E
 * - 1 - LCD segment on or LCD backplane active for phase E
 */
/*@{*/
/*! @brief Read current value of the LCD_WF8B_BPELCD48 field. */
#define LCD_RD_WF8B_BPELCD48(base, index) ((LCD_WF8B_REG(base, index) & LCD_WF8B_BPELCD48_MASK) >> LCD_WF8B_BPELCD48_SHIFT)
#define LCD_BRD_WF8B_BPELCD48(base, index) (BME_UBFX8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPELCD48_SHIFT, LCD_WF8B_BPELCD48_WIDTH))

/*! @brief Set the BPELCD48 field to a new value. */
#define LCD_WR_WF8B_BPELCD48(base, index, value) (LCD_RMW_WF8B(base, index, LCD_WF8B_BPELCD48_MASK, LCD_WF8B_BPELCD48(value)))
#define LCD_BWR_WF8B_BPELCD48(base, index, value) (BME_BFI8(&LCD_WF8B_REG(base, index), ((uint8_t)(value) << LCD_WF8B_BPELCD48_SHIFT), LCD_WF8B_BPELCD48_SHIFT, LCD_WF8B_BPELCD48_WIDTH))
/*@}*/

/*!
 * @name Register LCD_WF8B, field BPELCD21[4] (RW)
 *
 * Values:
 * - 0 - LCD segment off or LCD backplane inactive for phase E
 * - 1 - LCD segment on or LCD backplane active for phase E
 */
/*@{*/
/*! @brief Read current value of the LCD_WF8B_BPELCD21 field. */
#define LCD_RD_WF8B_BPELCD21(base, index) ((LCD_WF8B_REG(base, index) & LCD_WF8B_BPELCD21_MASK) >> LCD_WF8B_BPELCD21_SHIFT)
#define LCD_BRD_WF8B_BPELCD21(base, index) (BME_UBFX8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPELCD21_SHIFT, LCD_WF8B_BPELCD21_WIDTH))

/*! @brief Set the BPELCD21 field to a new value. */
#define LCD_WR_WF8B_BPELCD21(base, index, value) (LCD_RMW_WF8B(base, index, LCD_WF8B_BPELCD21_MASK, LCD_WF8B_BPELCD21(value)))
#define LCD_BWR_WF8B_BPELCD21(base, index, value) (BME_BFI8(&LCD_WF8B_REG(base, index), ((uint8_t)(value) << LCD_WF8B_BPELCD21_SHIFT), LCD_WF8B_BPELCD21_SHIFT, LCD_WF8B_BPELCD21_WIDTH))
/*@}*/

/*!
 * @name Register LCD_WF8B, field BPELCD49[4] (RW)
 *
 * Values:
 * - 0 - LCD segment off or LCD backplane inactive for phase E
 * - 1 - LCD segment on or LCD backplane active for phase E
 */
/*@{*/
/*! @brief Read current value of the LCD_WF8B_BPELCD49 field. */
#define LCD_RD_WF8B_BPELCD49(base, index) ((LCD_WF8B_REG(base, index) & LCD_WF8B_BPELCD49_MASK) >> LCD_WF8B_BPELCD49_SHIFT)
#define LCD_BRD_WF8B_BPELCD49(base, index) (BME_UBFX8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPELCD49_SHIFT, LCD_WF8B_BPELCD49_WIDTH))

/*! @brief Set the BPELCD49 field to a new value. */
#define LCD_WR_WF8B_BPELCD49(base, index, value) (LCD_RMW_WF8B(base, index, LCD_WF8B_BPELCD49_MASK, LCD_WF8B_BPELCD49(value)))
#define LCD_BWR_WF8B_BPELCD49(base, index, value) (BME_BFI8(&LCD_WF8B_REG(base, index), ((uint8_t)(value) << LCD_WF8B_BPELCD49_SHIFT), LCD_WF8B_BPELCD49_SHIFT, LCD_WF8B_BPELCD49_WIDTH))
/*@}*/

/*!
 * @name Register LCD_WF8B, field BPELCD20[4] (RW)
 *
 * Values:
 * - 0 - LCD segment off or LCD backplane inactive for phase E
 * - 1 - LCD segment on or LCD backplane active for phase E
 */
/*@{*/
/*! @brief Read current value of the LCD_WF8B_BPELCD20 field. */
#define LCD_RD_WF8B_BPELCD20(base, index) ((LCD_WF8B_REG(base, index) & LCD_WF8B_BPELCD20_MASK) >> LCD_WF8B_BPELCD20_SHIFT)
#define LCD_BRD_WF8B_BPELCD20(base, index) (BME_UBFX8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPELCD20_SHIFT, LCD_WF8B_BPELCD20_WIDTH))

/*! @brief Set the BPELCD20 field to a new value. */
#define LCD_WR_WF8B_BPELCD20(base, index, value) (LCD_RMW_WF8B(base, index, LCD_WF8B_BPELCD20_MASK, LCD_WF8B_BPELCD20(value)))
#define LCD_BWR_WF8B_BPELCD20(base, index, value) (BME_BFI8(&LCD_WF8B_REG(base, index), ((uint8_t)(value) << LCD_WF8B_BPELCD20_SHIFT), LCD_WF8B_BPELCD20_SHIFT, LCD_WF8B_BPELCD20_WIDTH))
/*@}*/

/*!
 * @name Register LCD_WF8B, field BPELCD19[4] (RW)
 *
 * Values:
 * - 0 - LCD segment off or LCD backplane inactive for phase E
 * - 1 - LCD segment on or LCD backplane active for phase E
 */
/*@{*/
/*! @brief Read current value of the LCD_WF8B_BPELCD19 field. */
#define LCD_RD_WF8B_BPELCD19(base, index) ((LCD_WF8B_REG(base, index) & LCD_WF8B_BPELCD19_MASK) >> LCD_WF8B_BPELCD19_SHIFT)
#define LCD_BRD_WF8B_BPELCD19(base, index) (BME_UBFX8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPELCD19_SHIFT, LCD_WF8B_BPELCD19_WIDTH))

/*! @brief Set the BPELCD19 field to a new value. */
#define LCD_WR_WF8B_BPELCD19(base, index, value) (LCD_RMW_WF8B(base, index, LCD_WF8B_BPELCD19_MASK, LCD_WF8B_BPELCD19(value)))
#define LCD_BWR_WF8B_BPELCD19(base, index, value) (BME_BFI8(&LCD_WF8B_REG(base, index), ((uint8_t)(value) << LCD_WF8B_BPELCD19_SHIFT), LCD_WF8B_BPELCD19_SHIFT, LCD_WF8B_BPELCD19_WIDTH))
/*@}*/

/*!
 * @name Register LCD_WF8B, field BPELCD9[4] (RW)
 *
 * Values:
 * - 0 - LCD segment off or LCD backplane inactive for phase E
 * - 1 - LCD segment on or LCD backplane active for phase E
 */
/*@{*/
/*! @brief Read current value of the LCD_WF8B_BPELCD9 field. */
#define LCD_RD_WF8B_BPELCD9(base, index) ((LCD_WF8B_REG(base, index) & LCD_WF8B_BPELCD9_MASK) >> LCD_WF8B_BPELCD9_SHIFT)
#define LCD_BRD_WF8B_BPELCD9(base, index) (BME_UBFX8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPELCD9_SHIFT, LCD_WF8B_BPELCD9_WIDTH))

/*! @brief Set the BPELCD9 field to a new value. */
#define LCD_WR_WF8B_BPELCD9(base, index, value) (LCD_RMW_WF8B(base, index, LCD_WF8B_BPELCD9_MASK, LCD_WF8B_BPELCD9(value)))
#define LCD_BWR_WF8B_BPELCD9(base, index, value) (BME_BFI8(&LCD_WF8B_REG(base, index), ((uint8_t)(value) << LCD_WF8B_BPELCD9_SHIFT), LCD_WF8B_BPELCD9_SHIFT, LCD_WF8B_BPELCD9_WIDTH))
/*@}*/

/*!
 * @name Register LCD_WF8B, field BPELCD50[4] (RW)
 *
 * Values:
 * - 0 - LCD segment off or LCD backplane inactive for phase E
 * - 1 - LCD segment on or LCD backplane active for phase E
 */
/*@{*/
/*! @brief Read current value of the LCD_WF8B_BPELCD50 field. */
#define LCD_RD_WF8B_BPELCD50(base, index) ((LCD_WF8B_REG(base, index) & LCD_WF8B_BPELCD50_MASK) >> LCD_WF8B_BPELCD50_SHIFT)
#define LCD_BRD_WF8B_BPELCD50(base, index) (BME_UBFX8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPELCD50_SHIFT, LCD_WF8B_BPELCD50_WIDTH))

/*! @brief Set the BPELCD50 field to a new value. */
#define LCD_WR_WF8B_BPELCD50(base, index, value) (LCD_RMW_WF8B(base, index, LCD_WF8B_BPELCD50_MASK, LCD_WF8B_BPELCD50(value)))
#define LCD_BWR_WF8B_BPELCD50(base, index, value) (BME_BFI8(&LCD_WF8B_REG(base, index), ((uint8_t)(value) << LCD_WF8B_BPELCD50_SHIFT), LCD_WF8B_BPELCD50_SHIFT, LCD_WF8B_BPELCD50_WIDTH))
/*@}*/

/*!
 * @name Register LCD_WF8B, field BPELCD18[4] (RW)
 *
 * Values:
 * - 0 - LCD segment off or LCD backplane inactive for phase E
 * - 1 - LCD segment on or LCD backplane active for phase E
 */
/*@{*/
/*! @brief Read current value of the LCD_WF8B_BPELCD18 field. */
#define LCD_RD_WF8B_BPELCD18(base, index) ((LCD_WF8B_REG(base, index) & LCD_WF8B_BPELCD18_MASK) >> LCD_WF8B_BPELCD18_SHIFT)
#define LCD_BRD_WF8B_BPELCD18(base, index) (BME_UBFX8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPELCD18_SHIFT, LCD_WF8B_BPELCD18_WIDTH))

/*! @brief Set the BPELCD18 field to a new value. */
#define LCD_WR_WF8B_BPELCD18(base, index, value) (LCD_RMW_WF8B(base, index, LCD_WF8B_BPELCD18_MASK, LCD_WF8B_BPELCD18(value)))
#define LCD_BWR_WF8B_BPELCD18(base, index, value) (BME_BFI8(&LCD_WF8B_REG(base, index), ((uint8_t)(value) << LCD_WF8B_BPELCD18_SHIFT), LCD_WF8B_BPELCD18_SHIFT, LCD_WF8B_BPELCD18_WIDTH))
/*@}*/

/*!
 * @name Register LCD_WF8B, field BPELCD6[4] (RW)
 *
 * Values:
 * - 0 - LCD segment off or LCD backplane inactive for phase E
 * - 1 - LCD segment on or LCD backplane active for phase E
 */
/*@{*/
/*! @brief Read current value of the LCD_WF8B_BPELCD6 field. */
#define LCD_RD_WF8B_BPELCD6(base, index) ((LCD_WF8B_REG(base, index) & LCD_WF8B_BPELCD6_MASK) >> LCD_WF8B_BPELCD6_SHIFT)
#define LCD_BRD_WF8B_BPELCD6(base, index) (BME_UBFX8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPELCD6_SHIFT, LCD_WF8B_BPELCD6_WIDTH))

/*! @brief Set the BPELCD6 field to a new value. */
#define LCD_WR_WF8B_BPELCD6(base, index, value) (LCD_RMW_WF8B(base, index, LCD_WF8B_BPELCD6_MASK, LCD_WF8B_BPELCD6(value)))
#define LCD_BWR_WF8B_BPELCD6(base, index, value) (BME_BFI8(&LCD_WF8B_REG(base, index), ((uint8_t)(value) << LCD_WF8B_BPELCD6_SHIFT), LCD_WF8B_BPELCD6_SHIFT, LCD_WF8B_BPELCD6_WIDTH))
/*@}*/

/*!
 * @name Register LCD_WF8B, field BPELCD17[4] (RW)
 *
 * Values:
 * - 0 - LCD segment off or LCD backplane inactive for phase E
 * - 1 - LCD segment on or LCD backplane active for phase E
 */
/*@{*/
/*! @brief Read current value of the LCD_WF8B_BPELCD17 field. */
#define LCD_RD_WF8B_BPELCD17(base, index) ((LCD_WF8B_REG(base, index) & LCD_WF8B_BPELCD17_MASK) >> LCD_WF8B_BPELCD17_SHIFT)
#define LCD_BRD_WF8B_BPELCD17(base, index) (BME_UBFX8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPELCD17_SHIFT, LCD_WF8B_BPELCD17_WIDTH))

/*! @brief Set the BPELCD17 field to a new value. */
#define LCD_WR_WF8B_BPELCD17(base, index, value) (LCD_RMW_WF8B(base, index, LCD_WF8B_BPELCD17_MASK, LCD_WF8B_BPELCD17(value)))
#define LCD_BWR_WF8B_BPELCD17(base, index, value) (BME_BFI8(&LCD_WF8B_REG(base, index), ((uint8_t)(value) << LCD_WF8B_BPELCD17_SHIFT), LCD_WF8B_BPELCD17_SHIFT, LCD_WF8B_BPELCD17_WIDTH))
/*@}*/

/*!
 * @name Register LCD_WF8B, field BPELCD51[4] (RW)
 *
 * Values:
 * - 0 - LCD segment off or LCD backplane inactive for phase E
 * - 1 - LCD segment on or LCD backplane active for phase E
 */
/*@{*/
/*! @brief Read current value of the LCD_WF8B_BPELCD51 field. */
#define LCD_RD_WF8B_BPELCD51(base, index) ((LCD_WF8B_REG(base, index) & LCD_WF8B_BPELCD51_MASK) >> LCD_WF8B_BPELCD51_SHIFT)
#define LCD_BRD_WF8B_BPELCD51(base, index) (BME_UBFX8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPELCD51_SHIFT, LCD_WF8B_BPELCD51_WIDTH))

/*! @brief Set the BPELCD51 field to a new value. */
#define LCD_WR_WF8B_BPELCD51(base, index, value) (LCD_RMW_WF8B(base, index, LCD_WF8B_BPELCD51_MASK, LCD_WF8B_BPELCD51(value)))
#define LCD_BWR_WF8B_BPELCD51(base, index, value) (BME_BFI8(&LCD_WF8B_REG(base, index), ((uint8_t)(value) << LCD_WF8B_BPELCD51_SHIFT), LCD_WF8B_BPELCD51_SHIFT, LCD_WF8B_BPELCD51_WIDTH))
/*@}*/

/*!
 * @name Register LCD_WF8B, field BPELCD16[4] (RW)
 *
 * Values:
 * - 0 - LCD segment off or LCD backplane inactive for phase E
 * - 1 - LCD segment on or LCD backplane active for phase E
 */
/*@{*/
/*! @brief Read current value of the LCD_WF8B_BPELCD16 field. */
#define LCD_RD_WF8B_BPELCD16(base, index) ((LCD_WF8B_REG(base, index) & LCD_WF8B_BPELCD16_MASK) >> LCD_WF8B_BPELCD16_SHIFT)
#define LCD_BRD_WF8B_BPELCD16(base, index) (BME_UBFX8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPELCD16_SHIFT, LCD_WF8B_BPELCD16_WIDTH))

/*! @brief Set the BPELCD16 field to a new value. */
#define LCD_WR_WF8B_BPELCD16(base, index, value) (LCD_RMW_WF8B(base, index, LCD_WF8B_BPELCD16_MASK, LCD_WF8B_BPELCD16(value)))
#define LCD_BWR_WF8B_BPELCD16(base, index, value) (BME_BFI8(&LCD_WF8B_REG(base, index), ((uint8_t)(value) << LCD_WF8B_BPELCD16_SHIFT), LCD_WF8B_BPELCD16_SHIFT, LCD_WF8B_BPELCD16_WIDTH))
/*@}*/

/*!
 * @name Register LCD_WF8B, field BPELCD56[4] (RW)
 *
 * Values:
 * - 0 - LCD segment off or LCD backplane inactive for phase E
 * - 1 - LCD segment on or LCD backplane active for phase E
 */
/*@{*/
/*! @brief Read current value of the LCD_WF8B_BPELCD56 field. */
#define LCD_RD_WF8B_BPELCD56(base, index) ((LCD_WF8B_REG(base, index) & LCD_WF8B_BPELCD56_MASK) >> LCD_WF8B_BPELCD56_SHIFT)
#define LCD_BRD_WF8B_BPELCD56(base, index) (BME_UBFX8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPELCD56_SHIFT, LCD_WF8B_BPELCD56_WIDTH))

/*! @brief Set the BPELCD56 field to a new value. */
#define LCD_WR_WF8B_BPELCD56(base, index, value) (LCD_RMW_WF8B(base, index, LCD_WF8B_BPELCD56_MASK, LCD_WF8B_BPELCD56(value)))
#define LCD_BWR_WF8B_BPELCD56(base, index, value) (BME_BFI8(&LCD_WF8B_REG(base, index), ((uint8_t)(value) << LCD_WF8B_BPELCD56_SHIFT), LCD_WF8B_BPELCD56_SHIFT, LCD_WF8B_BPELCD56_WIDTH))
/*@}*/

/*!
 * @name Register LCD_WF8B, field BPELCD57[4] (RW)
 *
 * Values:
 * - 0 - LCD segment off or LCD backplane inactive for phase E
 * - 1 - LCD segment on or LCD backplane active for phase E
 */
/*@{*/
/*! @brief Read current value of the LCD_WF8B_BPELCD57 field. */
#define LCD_RD_WF8B_BPELCD57(base, index) ((LCD_WF8B_REG(base, index) & LCD_WF8B_BPELCD57_MASK) >> LCD_WF8B_BPELCD57_SHIFT)
#define LCD_BRD_WF8B_BPELCD57(base, index) (BME_UBFX8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPELCD57_SHIFT, LCD_WF8B_BPELCD57_WIDTH))

