pyocd/FlashAlgo/source/freescale/devices/MKM33ZA5/MKM33ZA5_extension.h
/*! @brief Set the BPHLCD38 field to a new value. */
#define LCD_WR_WF8B_BPHLCD38(base, index, value) (LCD_RMW_WF8B(base, index, LCD_WF8B_BPHLCD38_MASK, LCD_WF8B_BPHLCD38(value)))
#define LCD_BWR_WF8B_BPHLCD38(base, index, value) (BME_BFI8(&LCD_WF8B_REG(base, index), ((uint8_t)(value) << LCD_WF8B_BPHLCD38_SHIFT), LCD_WF8B_BPHLCD38_SHIFT, LCD_WF8B_BPHLCD38_WIDTH))
/*@}*/

/*!
 * @name Register LCD_WF8B, field BPHLCD37[7] (RW)
 *
 * Values:
 * - 0 - LCD segment off or LCD backplane inactive for phase H
 * - 1 - LCD segment on or LCD backplane active for phase H
 */
/*@{*/
/*! @brief Read current value of the LCD_WF8B_BPHLCD37 field. */
#define LCD_RD_WF8B_BPHLCD37(base, index) ((LCD_WF8B_REG(base, index) & LCD_WF8B_BPHLCD37_MASK) >> LCD_WF8B_BPHLCD37_SHIFT)
#define LCD_BRD_WF8B_BPHLCD37(base, index) (BME_UBFX8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPHLCD37_SHIFT, LCD_WF8B_BPHLCD37_WIDTH))

/*! @brief Set the BPHLCD37 field to a new value. */
#define LCD_WR_WF8B_BPHLCD37(base, index, value) (LCD_RMW_WF8B(base, index, LCD_WF8B_BPHLCD37_MASK, LCD_WF8B_BPHLCD37(value)))
#define LCD_BWR_WF8B_BPHLCD37(base, index, value) (BME_BFI8(&LCD_WF8B_REG(base, index), ((uint8_t)(value) << LCD_WF8B_BPHLCD37_SHIFT), LCD_WF8B_BPHLCD37_SHIFT, LCD_WF8B_BPHLCD37_WIDTH))
/*@}*/

/*!
 * @name Register LCD_WF8B, field BPHLCD36[7] (RW)
 *
 * Values:
 * - 0 - LCD segment off or LCD backplane inactive for phase H
 * - 1 - LCD segment on or LCD backplane active for phase H
 */
/*@{*/
/*! @brief Read current value of the LCD_WF8B_BPHLCD36 field. */
#define LCD_RD_WF8B_BPHLCD36(base, index) ((LCD_WF8B_REG(base, index) & LCD_WF8B_BPHLCD36_MASK) >> LCD_WF8B_BPHLCD36_SHIFT)
#define LCD_BRD_WF8B_BPHLCD36(base, index) (BME_UBFX8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPHLCD36_SHIFT, LCD_WF8B_BPHLCD36_WIDTH))

/*! @brief Set the BPHLCD36 field to a new value. */
#define LCD_WR_WF8B_BPHLCD36(base, index, value) (LCD_RMW_WF8B(base, index, LCD_WF8B_BPHLCD36_MASK, LCD_WF8B_BPHLCD36(value)))
#define LCD_BWR_WF8B_BPHLCD36(base, index, value) (BME_BFI8(&LCD_WF8B_REG(base, index), ((uint8_t)(value) << LCD_WF8B_BPHLCD36_SHIFT), LCD_WF8B_BPHLCD36_SHIFT, LCD_WF8B_BPHLCD36_WIDTH))
/*@}*/

/*!
 * @name Register LCD_WF8B, field BPHLCD3[7] (RW)
 *
 * Values:
 * - 0 - LCD segment off or LCD backplane inactive for phase H
 * - 1 - LCD segment on or LCD backplane active for phase H
 */
/*@{*/
/*! @brief Read current value of the LCD_WF8B_BPHLCD3 field. */
#define LCD_RD_WF8B_BPHLCD3(base, index) ((LCD_WF8B_REG(base, index) & LCD_WF8B_BPHLCD3_MASK) >> LCD_WF8B_BPHLCD3_SHIFT)
#define LCD_BRD_WF8B_BPHLCD3(base, index) (BME_UBFX8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPHLCD3_SHIFT, LCD_WF8B_BPHLCD3_WIDTH))

/*! @brief Set the BPHLCD3 field to a new value. */
#define LCD_WR_WF8B_BPHLCD3(base, index, value) (LCD_RMW_WF8B(base, index, LCD_WF8B_BPHLCD3_MASK, LCD_WF8B_BPHLCD3(value)))
#define LCD_BWR_WF8B_BPHLCD3(base, index, value) (BME_BFI8(&LCD_WF8B_REG(base, index), ((uint8_t)(value) << LCD_WF8B_BPHLCD3_SHIFT), LCD_WF8B_BPHLCD3_SHIFT, LCD_WF8B_BPHLCD3_WIDTH))
/*@}*/

/*!
 * @name Register LCD_WF8B, field BPHLCD35[7] (RW)
 *
 * Values:
 * - 0 - LCD segment off or LCD backplane inactive for phase H
 * - 1 - LCD segment on or LCD backplane active for phase H
 */
/*@{*/
/*! @brief Read current value of the LCD_WF8B_BPHLCD35 field. */
#define LCD_RD_WF8B_BPHLCD35(base, index) ((LCD_WF8B_REG(base, index) & LCD_WF8B_BPHLCD35_MASK) >> LCD_WF8B_BPHLCD35_SHIFT)
#define LCD_BRD_WF8B_BPHLCD35(base, index) (BME_UBFX8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPHLCD35_SHIFT, LCD_WF8B_BPHLCD35_WIDTH))

/*! @brief Set the BPHLCD35 field to a new value. */
#define LCD_WR_WF8B_BPHLCD35(base, index, value) (LCD_RMW_WF8B(base, index, LCD_WF8B_BPHLCD35_MASK, LCD_WF8B_BPHLCD35(value)))
#define LCD_BWR_WF8B_BPHLCD35(base, index, value) (BME_BFI8(&LCD_WF8B_REG(base, index), ((uint8_t)(value) << LCD_WF8B_BPHLCD35_SHIFT), LCD_WF8B_BPHLCD35_SHIFT, LCD_WF8B_BPHLCD35_WIDTH))
/*@}*/

/*!
 * @name Register LCD_WF8B, field BPHLCD34[7] (RW)
 *
 * Values:
 * - 0 - LCD segment off or LCD backplane inactive for phase H
 * - 1 - LCD segment on or LCD backplane active for phase H
 */
/*@{*/
/*! @brief Read current value of the LCD_WF8B_BPHLCD34 field. */
#define LCD_RD_WF8B_BPHLCD34(base, index) ((LCD_WF8B_REG(base, index) & LCD_WF8B_BPHLCD34_MASK) >> LCD_WF8B_BPHLCD34_SHIFT)
#define LCD_BRD_WF8B_BPHLCD34(base, index) (BME_UBFX8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPHLCD34_SHIFT, LCD_WF8B_BPHLCD34_WIDTH))

/*! @brief Set the BPHLCD34 field to a new value. */
#define LCD_WR_WF8B_BPHLCD34(base, index, value) (LCD_RMW_WF8B(base, index, LCD_WF8B_BPHLCD34_MASK, LCD_WF8B_BPHLCD34(value)))
#define LCD_BWR_WF8B_BPHLCD34(base, index, value) (BME_BFI8(&LCD_WF8B_REG(base, index), ((uint8_t)(value) << LCD_WF8B_BPHLCD34_SHIFT), LCD_WF8B_BPHLCD34_SHIFT, LCD_WF8B_BPHLCD34_WIDTH))
/*@}*/

/*!
 * @name Register LCD_WF8B, field BPHLCD33[7] (RW)
 *
 * Values:
 * - 0 - LCD segment off or LCD backplane inactive for phase H
 * - 1 - LCD segment on or LCD backplane active for phase H
 */
/*@{*/
/*! @brief Read current value of the LCD_WF8B_BPHLCD33 field. */
#define LCD_RD_WF8B_BPHLCD33(base, index) ((LCD_WF8B_REG(base, index) & LCD_WF8B_BPHLCD33_MASK) >> LCD_WF8B_BPHLCD33_SHIFT)
#define LCD_BRD_WF8B_BPHLCD33(base, index) (BME_UBFX8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPHLCD33_SHIFT, LCD_WF8B_BPHLCD33_WIDTH))

/*! @brief Set the BPHLCD33 field to a new value. */
#define LCD_WR_WF8B_BPHLCD33(base, index, value) (LCD_RMW_WF8B(base, index, LCD_WF8B_BPHLCD33_MASK, LCD_WF8B_BPHLCD33(value)))
#define LCD_BWR_WF8B_BPHLCD33(base, index, value) (BME_BFI8(&LCD_WF8B_REG(base, index), ((uint8_t)(value) << LCD_WF8B_BPHLCD33_SHIFT), LCD_WF8B_BPHLCD33_SHIFT, LCD_WF8B_BPHLCD33_WIDTH))
/*@}*/

/*!
 * @name Register LCD_WF8B, field BPHLCD32[7] (RW)
 *
 * Values:
 * - 0 - LCD segment off or LCD backplane inactive for phase H
 * - 1 - LCD segment on or LCD backplane active for phase H
 */
/*@{*/
/*! @brief Read current value of the LCD_WF8B_BPHLCD32 field. */
#define LCD_RD_WF8B_BPHLCD32(base, index) ((LCD_WF8B_REG(base, index) & LCD_WF8B_BPHLCD32_MASK) >> LCD_WF8B_BPHLCD32_SHIFT)
#define LCD_BRD_WF8B_BPHLCD32(base, index) (BME_UBFX8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPHLCD32_SHIFT, LCD_WF8B_BPHLCD32_WIDTH))

/*! @brief Set the BPHLCD32 field to a new value. */
#define LCD_WR_WF8B_BPHLCD32(base, index, value) (LCD_RMW_WF8B(base, index, LCD_WF8B_BPHLCD32_MASK, LCD_WF8B_BPHLCD32(value)))
#define LCD_BWR_WF8B_BPHLCD32(base, index, value) (BME_BFI8(&LCD_WF8B_REG(base, index), ((uint8_t)(value) << LCD_WF8B_BPHLCD32_SHIFT), LCD_WF8B_BPHLCD32_SHIFT, LCD_WF8B_BPHLCD32_WIDTH))
/*@}*/

/*!
 * @name Register LCD_WF8B, field BPHLCD31[7] (RW)
 *
 * Values:
 * - 0 - LCD segment off or LCD backplane inactive for phase H
 * - 1 - LCD segment on or LCD backplane active for phase H
 */
/*@{*/
/*! @brief Read current value of the LCD_WF8B_BPHLCD31 field. */
#define LCD_RD_WF8B_BPHLCD31(base, index) ((LCD_WF8B_REG(base, index) & LCD_WF8B_BPHLCD31_MASK) >> LCD_WF8B_BPHLCD31_SHIFT)
#define LCD_BRD_WF8B_BPHLCD31(base, index) (BME_UBFX8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPHLCD31_SHIFT, LCD_WF8B_BPHLCD31_WIDTH))

/*! @brief Set the BPHLCD31 field to a new value. */
#define LCD_WR_WF8B_BPHLCD31(base, index, value) (LCD_RMW_WF8B(base, index, LCD_WF8B_BPHLCD31_MASK, LCD_WF8B_BPHLCD31(value)))
#define LCD_BWR_WF8B_BPHLCD31(base, index, value) (BME_BFI8(&LCD_WF8B_REG(base, index), ((uint8_t)(value) << LCD_WF8B_BPHLCD31_SHIFT), LCD_WF8B_BPHLCD31_SHIFT, LCD_WF8B_BPHLCD31_WIDTH))
/*@}*/

/*!
 * @name Register LCD_WF8B, field BPHLCD30[7] (RW)
 *
 * Values:
 * - 0 - LCD segment off or LCD backplane inactive for phase H
 * - 1 - LCD segment on or LCD backplane active for phase H
 */
/*@{*/
/*! @brief Read current value of the LCD_WF8B_BPHLCD30 field. */
#define LCD_RD_WF8B_BPHLCD30(base, index) ((LCD_WF8B_REG(base, index) & LCD_WF8B_BPHLCD30_MASK) >> LCD_WF8B_BPHLCD30_SHIFT)
#define LCD_BRD_WF8B_BPHLCD30(base, index) (BME_UBFX8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPHLCD30_SHIFT, LCD_WF8B_BPHLCD30_WIDTH))

