pyocd/FlashAlgo/source/freescale/devices/MKM33ZA5/MKM33ZA5_extension.h
/*
 * Constants & macros for individual MCM_PID bitfields
 */

/*!
 * @name Register MCM_PID, field PID[7:0] (RW)
 *
 * Drives the M0_PID value in the MPU.
 *
 * Values:
 * - 0 - Reserved for privileged secure tasks
 */
/*@{*/
/*! @brief Read current value of the MCM_PID_PID field. */
#define MCM_RD_PID_PID(base) ((MCM_PID_REG(base) & MCM_PID_PID_MASK) >> MCM_PID_PID_SHIFT)
#define MCM_BRD_PID_PID(base) (MCM_RD_PID_PID(base))

/*! @brief Set the PID field to a new value. */
#define MCM_WR_PID_PID(base, value) (MCM_RMW_PID(base, MCM_PID_PID_MASK, MCM_PID_PID(value)))
#define MCM_BWR_PID_PID(base, value) (MCM_WR_PID_PID(base, value))
/*@}*/

/*******************************************************************************
 * MCM_CPO - Compute Operation Control Register
 ******************************************************************************/

/*!
 * @brief MCM_CPO - Compute Operation Control Register (RW)
 *
 * Reset value: 0x00000000U
 *
 * This register controls the Compute Operation.
 */
/*!
 * @name Constants and macros for entire MCM_CPO register
 */
/*@{*/
#define MCM_RD_CPO(base)         (MCM_CPO_REG(base))
#define MCM_WR_CPO(base, value)  (MCM_CPO_REG(base) = (value))
#define MCM_RMW_CPO(base, mask, value) (MCM_WR_CPO(base, (MCM_RD_CPO(base) & ~(mask)) | (value)))
#define MCM_SET_CPO(base, value) (MCM_WR_CPO(base, MCM_RD_CPO(base) |  (value)))
#define MCM_CLR_CPO(base, value) (MCM_WR_CPO(base, MCM_RD_CPO(base) & ~(value)))
#define MCM_TOG_CPO(base, value) (MCM_WR_CPO(base, MCM_RD_CPO(base) ^  (value)))
/*@}*/

/*
 * Constants & macros for individual MCM_CPO bitfields
 */

/*!
 * @name Register MCM_CPO, field CPOREQ[0] (RW)
 *
 * This bit is auto-cleared by vector fetching if CPOWOI = 1.
 *
 * Values:
 * - 0 - Request is cleared.
 * - 1 - Request Compute Operation.
 */
/*@{*/
/*! @brief Read current value of the MCM_CPO_CPOREQ field. */
#define MCM_RD_CPO_CPOREQ(base) ((MCM_CPO_REG(base) & MCM_CPO_CPOREQ_MASK) >> MCM_CPO_CPOREQ_SHIFT)
#define MCM_BRD_CPO_CPOREQ(base) (MCM_RD_CPO_CPOREQ(base))

/*! @brief Set the CPOREQ field to a new value. */
#define MCM_WR_CPO_CPOREQ(base, value) (MCM_RMW_CPO(base, MCM_CPO_CPOREQ_MASK, MCM_CPO_CPOREQ(value)))
#define MCM_BWR_CPO_CPOREQ(base, value) (MCM_WR_CPO_CPOREQ(base, value))
/*@}*/

/*!
 * @name Register MCM_CPO, field CPOACK[1] (RO)
 *
 * Values:
 * - 0 - Compute operation entry has not completed or compute operation exit has
 *     completed.
 * - 1 - Compute operation entry has completed or compute operation exit has not
 *     completed.
 */
/*@{*/
/*! @brief Read current value of the MCM_CPO_CPOACK field. */
#define MCM_RD_CPO_CPOACK(base) ((MCM_CPO_REG(base) & MCM_CPO_CPOACK_MASK) >> MCM_CPO_CPOACK_SHIFT)
#define MCM_BRD_CPO_CPOACK(base) (MCM_RD_CPO_CPOACK(base))
/*@}*/

/*!
 * @name Register MCM_CPO, field CPOWOI[2] (RW)
 *
 * Values:
 * - 0 - No effect.
 * - 1 - When set, the CPOREQ is cleared on any interrupt or exception vector
 *     fetch.
 */
/*@{*/
/*! @brief Read current value of the MCM_CPO_CPOWOI field. */
#define MCM_RD_CPO_CPOWOI(base) ((MCM_CPO_REG(base) & MCM_CPO_CPOWOI_MASK) >> MCM_CPO_CPOWOI_SHIFT)
#define MCM_BRD_CPO_CPOWOI(base) (MCM_RD_CPO_CPOWOI(base))

/*! @brief Set the CPOWOI field to a new value. */
#define MCM_WR_CPO_CPOWOI(base, value) (MCM_RMW_CPO(base, MCM_CPO_CPOWOI_MASK, MCM_CPO_CPOWOI(value)))
#define MCM_BWR_CPO_CPOWOI(base, value) (MCM_WR_CPO_CPOWOI(base, value))
/*@}*/

/*******************************************************************************
 * MCM_MATCR - Master Attribute Configuration Register
 ******************************************************************************/

/*!
 * @brief MCM_MATCR - Master Attribute Configuration Register (RW)
 *
 * Reset value: 0x00000000U
 *
 * This 32-bit register consists of four 8-bit attribute configuration register
 * fields for each system bus master. Each MATCRn register field allows the
 * corresponding bus master's secure/nonsecure and privileged/user attributes to be
 * forced to a static state, or simply enable the attributes generated by the
 * master module. This information is then used on a per bus transaction basis to
 * control access. See the MPU chapter for more details. For all ATCn values, if the
 * state indicates privileged (either statically or via the master module's
 * attribute), then the other state indicator is forced to secure. Writes to ATC0
 * configure the processor's master attributes, and software must take special care
 * with this value. Typically, the processor would use an ATC0 value of {0b11- or
 * 0b00-} because the other values can create a configuration where access to
 * system level resources is not allowed. Each MATCRn register field also contains a
 * lock bit (RO) that may be set to disable writes to the register, preserving
 * the configured state until the next system reset.
 */
/*!
 * @name Constants and macros for entire MCM_MATCR register
 */
/*@{*/
#define MCM_RD_MATCR(base, index) (MCM_MATCR_REG(base, index))
#define MCM_WR_MATCR(base, index, value) (MCM_MATCR_REG(base, index) = (value))
#define MCM_RMW_MATCR(base, index, mask, value) (MCM_WR_MATCR(base, index, (MCM_RD_MATCR(base, index) & ~(mask)) | (value)))
#define MCM_SET_MATCR(base, index, value) (MCM_WR_MATCR(base, index, MCM_RD_MATCR(base, index) |  (value)))
#define MCM_CLR_MATCR(base, index, value) (MCM_WR_MATCR(base, index, MCM_RD_MATCR(base, index) & ~(value)))
#define MCM_TOG_MATCR(base, index, value) (MCM_WR_MATCR(base, index, MCM_RD_MATCR(base, index) ^  (value)))
/*@}*/

/*
 * Constants & macros for individual MCM_MATCR bitfields
 */

/*!
 * @name Register MCM_MATCR, field ATC0[2:0] (RW)
 *
 * This 3-bit field defines the privileged/user and secure/nonsecure attribute
 * configurations.
 *
 * Values:
 * - 00x - Master attributes are statically forced to {privileged, secure}.
 * - 010 - Master attributes are statically forced to {user, secure}.
 * - 011 - Master attributes are statically forced to {user, nonsecure}.
 * - 100 - Enable master attribute {privileged or user} and statically force
 *     {secure}.
 * - 101 - Enable master attribute {privileged or user} and statically force
 *     {nonsecure}.
 * - 11x - Enable master attribute {privileged or user, secure or nonsecure}
 */
/*@{*/
/*! @brief Read current value of the MCM_MATCR_ATC0 field. */
#define MCM_RD_MATCR_ATC0(base, index) ((MCM_MATCR_REG(base, index) & MCM_MATCR_ATC0_MASK) >> MCM_MATCR_ATC0_SHIFT)
#define MCM_BRD_MATCR_ATC0(base, index) (MCM_RD_MATCR_ATC0(base, index))

/*! @brief Set the ATC0 field to a new value. */
#define MCM_WR_MATCR_ATC0(base, index, value) (MCM_RMW_MATCR(base, index, MCM_MATCR_ATC0_MASK, MCM_MATCR_ATC0(value)))
#define MCM_BWR_MATCR_ATC0(base, index, value) (MCM_WR_MATCR_ATC0(base, index, value))
/*@}*/

/*!
 * @name Register MCM_MATCR, field RO0[7] (RW)
 *
 * This register bit provides a mechanism to lock the configuration state
 * defined by ATCn. Once asserted, this bit remains set and attempted writes to the
 * ATCn register are ignored until the next system reset clears the flag.
 *
 * Values:
 * - 0 - Writes to the ATCn are allowed.
 * - 1 - Writes to the ATCn are ignored.
 */
/*@{*/
/*! @brief Read current value of the MCM_MATCR_RO0 field. */
#define MCM_RD_MATCR_RO0(base, index) ((MCM_MATCR_REG(base, index) & MCM_MATCR_RO0_MASK) >> MCM_MATCR_RO0_SHIFT)
#define MCM_BRD_MATCR_RO0(base, index) (MCM_RD_MATCR_RO0(base, index))

/*! @brief Set the RO0 field to a new value. */
#define MCM_WR_MATCR_RO0(base, index, value) (MCM_RMW_MATCR(base, index, MCM_MATCR_RO0_MASK, MCM_MATCR_RO0(value)))
#define MCM_BWR_MATCR_RO0(base, index, value) (MCM_WR_MATCR_RO0(base, index, value))
/*@}*/

/*!
 * @name Register MCM_MATCR, field ATC2[18:16] (RW)
 *
 * This 3-bit field defines the privileged/user and secure/nonsecure attribute
 * configurations.
 *
 * Values:
 * - 00x - Master attributes are statically forced to {privileged, secure}.
 * - 010 - Master attributes are statically forced to {user, secure}.
 * - 011 - Master attributes are statically forced to {user, nonsecure}.
 * - 100 - Enable master attribute {privileged or user} and statically force
 *     {secure}.
 * - 101 - Enable master attribute {privileged or user} and statically force
 *     {nonsecure}.
 * - 11x - Enable master attribute {privileged or user, secure or nonsecure}
 */
/*@{*/
/*! @brief Read current value of the MCM_MATCR_ATC2 field. */
#define MCM_RD_MATCR_ATC2(base, index) ((MCM_MATCR_REG(base, index) & MCM_MATCR_ATC2_MASK) >> MCM_MATCR_ATC2_SHIFT)
#define MCM_BRD_MATCR_ATC2(base, index) (MCM_RD_MATCR_ATC2(base, index))

/*! @brief Set the ATC2 field to a new value. */
#define MCM_WR_MATCR_ATC2(base, index, value) (MCM_RMW_MATCR(base, index, MCM_MATCR_ATC2_MASK, MCM_MATCR_ATC2(value)))
#define MCM_BWR_MATCR_ATC2(base, index, value) (MCM_WR_MATCR_ATC2(base, index, value))
/*@}*/

/*!
 * @name Register MCM_MATCR, field RO2[23] (RW)
 *
 * This register bit provides a mechanism to lock the configuration state
 * defined by ATCn. Once asserted, this bit remains set and attempted writes to the
 * ATCn are ignored until the next system reset clears the flag.
 *
 * Values:
 * - 0 - Writes to the ATCn are allowed.
 * - 1 - Writes to the ATCn are ignored.
 */
/*@{*/
/*! @brief Read current value of the MCM_MATCR_RO2 field. */
#define MCM_RD_MATCR_RO2(base, index) ((MCM_MATCR_REG(base, index) & MCM_MATCR_RO2_MASK) >> MCM_MATCR_RO2_SHIFT)
#define MCM_BRD_MATCR_RO2(base, index) (MCM_RD_MATCR_RO2(base, index))

/*! @brief Set the RO2 field to a new value. */
#define MCM_WR_MATCR_RO2(base, index, value) (MCM_RMW_MATCR(base, index, MCM_MATCR_RO2_MASK, MCM_MATCR_RO2(value)))
#define MCM_BWR_MATCR_RO2(base, index, value) (MCM_WR_MATCR_RO2(base, index, value))
/*@}*/

