pyocd/FlashAlgo/source/freescale/devices/MKM33ZA5/MKM33ZA5_extension.h
/*******************************************************************************
 * RTC_GP_DATA_REG - RTC General Purpose Data Register
 ******************************************************************************/

/*!
 * @brief RTC_GP_DATA_REG - RTC General Purpose Data Register (RW)
 *
 * Reset value: 0x0000U
 *
 * The use of the bits in this register are specific to the MCU. See the Chip
 * Configuration chapter for description of this register. Software reset has no
 * effect on the contents of this register.
 */
/*!
 * @name Constants and macros for entire RTC_GP_DATA_REG register
 */
/*@{*/
#define RTC_RD_GP_DATA_REG(base) (RTC_GP_DATA_REG_REG(base))
#define RTC_WR_GP_DATA_REG(base, value) (RTC_GP_DATA_REG_REG(base) = (value))
#define RTC_RMW_GP_DATA_REG(base, mask, value) (RTC_WR_GP_DATA_REG(base, (RTC_RD_GP_DATA_REG(base) & ~(mask)) | (value)))
#define RTC_SET_GP_DATA_REG(base, value) (BME_OR16(&RTC_GP_DATA_REG_REG(base), (uint16_t)(value)))
#define RTC_CLR_GP_DATA_REG(base, value) (BME_AND16(&RTC_GP_DATA_REG_REG(base), (uint16_t)(~(value))))
#define RTC_TOG_GP_DATA_REG(base, value) (BME_XOR16(&RTC_GP_DATA_REG_REG(base), (uint16_t)(value)))
/*@}*/

/*******************************************************************************
 * RTC_DST_HOUR - RTC Daylight Saving Hour Register
 ******************************************************************************/

/*!
 * @brief RTC_DST_HOUR - RTC Daylight Saving Hour Register (RW)
 *
 * Reset value: 0x0000U
 *
 * This register stores the time in hours when the Daylight Saving has to be
 * applied or reversed. This register is programmable when the DST_EN bit in CTRL
 * register is 'Zero'. When DST_EN bit is set, the contents of this register cannot
 * be changed. The user software should program the correct hour value (0 - 23)
 * as per the regional settings. For example, if the Daylight Saving starts at
 * 2:00 AM on March 25 and ends at 2:00 AM on October 28 in 2007 then the time at
 * which the RTC advances or falls back is actually 1:59 AM. Hence the user
 * software should program 1 for the hour count value (and not 2!) i.e. write 0x0101 in
 * this register. 59 minute count is automatically checked inside RTC and hence
 * not required to be programmed. This register has no effect on software reset.
 */
/*!
 * @name Constants and macros for entire RTC_DST_HOUR register
 */
/*@{*/
#define RTC_RD_DST_HOUR(base)    (RTC_DST_HOUR_REG(base))
#define RTC_WR_DST_HOUR(base, value) (RTC_DST_HOUR_REG(base) = (value))
#define RTC_RMW_DST_HOUR(base, mask, value) (RTC_WR_DST_HOUR(base, (RTC_RD_DST_HOUR(base) & ~(mask)) | (value)))
#define RTC_SET_DST_HOUR(base, value) (BME_OR16(&RTC_DST_HOUR_REG(base), (uint16_t)(value)))
#define RTC_CLR_DST_HOUR(base, value) (BME_AND16(&RTC_DST_HOUR_REG(base), (uint16_t)(~(value))))
#define RTC_TOG_DST_HOUR(base, value) (BME_XOR16(&RTC_DST_HOUR_REG(base), (uint16_t)(value)))
/*@}*/

/*
 * Constants & macros for individual RTC_DST_HOUR bitfields
 */

/*!
 * @name Register RTC_DST_HOUR, field DST_END_HOUR[4:0] (RW)
 *
 * This is the hour value for the time when DST is reversed. Same as Hours
 * Counter Value in the HOURMINRTC Hours and Minutes Counters Register .
 */
/*@{*/
/*! @brief Read current value of the RTC_DST_HOUR_DST_END_HOUR field. */
#define RTC_RD_DST_HOUR_DST_END_HOUR(base) ((RTC_DST_HOUR_REG(base) & RTC_DST_HOUR_DST_END_HOUR_MASK) >> RTC_DST_HOUR_DST_END_HOUR_SHIFT)
#define RTC_BRD_DST_HOUR_DST_END_HOUR(base) (BME_UBFX16(&RTC_DST_HOUR_REG(base), RTC_DST_HOUR_DST_END_HOUR_SHIFT, RTC_DST_HOUR_DST_END_HOUR_WIDTH))

/*! @brief Set the DST_END_HOUR field to a new value. */
#define RTC_WR_DST_HOUR_DST_END_HOUR(base, value) (RTC_RMW_DST_HOUR(base, RTC_DST_HOUR_DST_END_HOUR_MASK, RTC_DST_HOUR_DST_END_HOUR(value)))
#define RTC_BWR_DST_HOUR_DST_END_HOUR(base, value) (BME_BFI16(&RTC_DST_HOUR_REG(base), ((uint16_t)(value) << RTC_DST_HOUR_DST_END_HOUR_SHIFT), RTC_DST_HOUR_DST_END_HOUR_SHIFT, RTC_DST_HOUR_DST_END_HOUR_WIDTH))
/*@}*/

/*!
 * @name Register RTC_DST_HOUR, field DST_START_HOUR[12:8] (RW)
 *
 * This is the hour value for the time when DST comes into effect. Same as Hours
 * Counter Value in the HOURMINRTC Hours and Minutes Counters Register .
 */
/*@{*/
/*! @brief Read current value of the RTC_DST_HOUR_DST_START_HOUR field. */
#define RTC_RD_DST_HOUR_DST_START_HOUR(base) ((RTC_DST_HOUR_REG(base) & RTC_DST_HOUR_DST_START_HOUR_MASK) >> RTC_DST_HOUR_DST_START_HOUR_SHIFT)
#define RTC_BRD_DST_HOUR_DST_START_HOUR(base) (BME_UBFX16(&RTC_DST_HOUR_REG(base), RTC_DST_HOUR_DST_START_HOUR_SHIFT, RTC_DST_HOUR_DST_START_HOUR_WIDTH))

/*! @brief Set the DST_START_HOUR field to a new value. */
#define RTC_WR_DST_HOUR_DST_START_HOUR(base, value) (RTC_RMW_DST_HOUR(base, RTC_DST_HOUR_DST_START_HOUR_MASK, RTC_DST_HOUR_DST_START_HOUR(value)))
#define RTC_BWR_DST_HOUR_DST_START_HOUR(base, value) (BME_BFI16(&RTC_DST_HOUR_REG(base), ((uint16_t)(value) << RTC_DST_HOUR_DST_START_HOUR_SHIFT), RTC_DST_HOUR_DST_START_HOUR_SHIFT, RTC_DST_HOUR_DST_START_HOUR_WIDTH))
/*@}*/

/*******************************************************************************
 * RTC_DST_MONTH - RTC Daylight Saving Month Register
 ******************************************************************************/

/*!
 * @brief RTC_DST_MONTH - RTC Daylight Saving Month Register (RW)
 *
 * Reset value: 0x0000U
 *
 * This register stores the month when the Daylight Saving has to be applied or
 * reversed. This register is programmable when the DST_EN bit in CTRL register
 * is Zero. When DST_EN bit is set, the contents of this register cannot be
 * changed. The CPU should program the correct month value (1 - 12) as per the regional
 * settings. For example, if the Daylight Saving starts at March 25 and ends at
 * October 28 in 2007. Hence the CPU should write 0x030A in this register. This
 * register has no effect on software reset.
 */
/*!
 * @name Constants and macros for entire RTC_DST_MONTH register
 */
/*@{*/
#define RTC_RD_DST_MONTH(base)   (RTC_DST_MONTH_REG(base))
#define RTC_WR_DST_MONTH(base, value) (RTC_DST_MONTH_REG(base) = (value))
#define RTC_RMW_DST_MONTH(base, mask, value) (RTC_WR_DST_MONTH(base, (RTC_RD_DST_MONTH(base) & ~(mask)) | (value)))
#define RTC_SET_DST_MONTH(base, value) (BME_OR16(&RTC_DST_MONTH_REG(base), (uint16_t)(value)))
#define RTC_CLR_DST_MONTH(base, value) (BME_AND16(&RTC_DST_MONTH_REG(base), (uint16_t)(~(value))))
#define RTC_TOG_DST_MONTH(base, value) (BME_XOR16(&RTC_DST_MONTH_REG(base), (uint16_t)(value)))
/*@}*/

