pyocd/FlashAlgo/source/freescale/devices/MKM33ZA5/MKM33ZA5_extension.h
/*******************************************************************************
 * RTC_TAMPER_SCR - RTC Tamper Status and Control Register
 ******************************************************************************/

/*!
 * @brief RTC_TAMPER_SCR - RTC Tamper Status and Control Register (RW)
 *
 * Reset value: 0x080FU
 *
 * For the implementation of this register in the MCU, refer to chip
 * configuration chapter. This register stores the tamper event and provides control to the
 * user to enable or disable each tamper individually. No tamper is disabled
 * automatically unless corresponding control bit is de-asserted by software. The
 * tamper statuses are stored as active high. The tamper status bits store the
 * tamper event irrespective of their corresponding control bit being asserted or not.
 * The control bits gate the assertion of tamper interrupt bit in ISR. These
 * status and controls bits combined assert the tamper interrupt in the ISR
 * register. The tamper interrupt will be cleared when all above Status bits are cleared.
 */
/*!
 * @name Constants and macros for entire RTC_TAMPER_SCR register
 */
/*@{*/
#define RTC_RD_TAMPER_SCR(base)  (RTC_TAMPER_SCR_REG(base))
#define RTC_WR_TAMPER_SCR(base, value) (RTC_TAMPER_SCR_REG(base) = (value))
#define RTC_RMW_TAMPER_SCR(base, mask, value) (RTC_WR_TAMPER_SCR(base, (RTC_RD_TAMPER_SCR(base) & ~(mask)) | (value)))
#define RTC_SET_TAMPER_SCR(base, value) (BME_OR16(&RTC_TAMPER_SCR_REG(base), (uint16_t)(value)))
#define RTC_CLR_TAMPER_SCR(base, value) (BME_AND16(&RTC_TAMPER_SCR_REG(base), (uint16_t)(~(value))))
#define RTC_TOG_TAMPER_SCR(base, value) (BME_XOR16(&RTC_TAMPER_SCR_REG(base), (uint16_t)(value)))
/*@}*/

/*
 * Constants & macros for individual RTC_TAMPER_SCR bitfields
 */

/*!
 * @name Register RTC_TAMPER_SCR, field TMPR_EN[3:0] (RW)
 *
 * Controls the generation of tamper interrupt from corresponding tamper status
 * bit. Enabled on reset.
 */
/*@{*/
/*! @brief Read current value of the RTC_TAMPER_SCR_TMPR_EN field. */
#define RTC_RD_TAMPER_SCR_TMPR_EN(base) ((RTC_TAMPER_SCR_REG(base) & RTC_TAMPER_SCR_TMPR_EN_MASK) >> RTC_TAMPER_SCR_TMPR_EN_SHIFT)
#define RTC_BRD_TAMPER_SCR_TMPR_EN(base) (BME_UBFX16(&RTC_TAMPER_SCR_REG(base), RTC_TAMPER_SCR_TMPR_EN_SHIFT, RTC_TAMPER_SCR_TMPR_EN_WIDTH))

/*! @brief Set the TMPR_EN field to a new value. */
#define RTC_WR_TAMPER_SCR_TMPR_EN(base, value) (RTC_RMW_TAMPER_SCR(base, RTC_TAMPER_SCR_TMPR_EN_MASK, RTC_TAMPER_SCR_TMPR_EN(value)))
#define RTC_BWR_TAMPER_SCR_TMPR_EN(base, value) (BME_BFI16(&RTC_TAMPER_SCR_REG(base), ((uint16_t)(value) << RTC_TAMPER_SCR_TMPR_EN_SHIFT), RTC_TAMPER_SCR_TMPR_EN_SHIFT, RTC_TAMPER_SCR_TMPR_EN_WIDTH))
/*@}*/

/*!
 * @name Register RTC_TAMPER_SCR, field TMPR_STS[11:8] (RW)
 *
 * Indicates if a tamper event was detected or not. Writing '1' to this field
 * clears the tamper status.
 */
/*@{*/
/*! @brief Read current value of the RTC_TAMPER_SCR_TMPR_STS field. */
#define RTC_RD_TAMPER_SCR_TMPR_STS(base) ((RTC_TAMPER_SCR_REG(base) & RTC_TAMPER_SCR_TMPR_STS_MASK) >> RTC_TAMPER_SCR_TMPR_STS_SHIFT)
#define RTC_BRD_TAMPER_SCR_TMPR_STS(base) (BME_UBFX16(&RTC_TAMPER_SCR_REG(base), RTC_TAMPER_SCR_TMPR_STS_SHIFT, RTC_TAMPER_SCR_TMPR_STS_WIDTH))

/*! @brief Set the TMPR_STS field to a new value. */
#define RTC_WR_TAMPER_SCR_TMPR_STS(base, value) (RTC_RMW_TAMPER_SCR(base, RTC_TAMPER_SCR_TMPR_STS_MASK, RTC_TAMPER_SCR_TMPR_STS(value)))
#define RTC_BWR_TAMPER_SCR_TMPR_STS(base, value) (BME_BFI16(&RTC_TAMPER_SCR_REG(base), ((uint16_t)(value) << RTC_TAMPER_SCR_TMPR_STS_SHIFT), RTC_TAMPER_SCR_TMPR_STS_SHIFT, RTC_TAMPER_SCR_TMPR_STS_WIDTH))
/*@}*/

/*******************************************************************************
 * RTC_FILTER01_CFG - RTC Tamper 0 1 Filter Configuration Register
 ******************************************************************************/

/*!
 * @brief RTC_FILTER01_CFG - RTC Tamper 0 1 Filter Configuration Register (RW)
 *
 * Reset value: 0x0000U
 *
 * This register must be configured once during the initial startup of
 * application and must not be changed on the fly to avoid any erratic behavior. Changing
 * the register on the fly might lead to missing of tamper events or assertion of
 * false tamper events.
 */
/*!
 * @name Constants and macros for entire RTC_FILTER01_CFG register
 */
/*@{*/
#define RTC_RD_FILTER01_CFG(base) (RTC_FILTER01_CFG_REG(base))
#define RTC_WR_FILTER01_CFG(base, value) (RTC_FILTER01_CFG_REG(base) = (value))
#define RTC_RMW_FILTER01_CFG(base, mask, value) (RTC_WR_FILTER01_CFG(base, (RTC_RD_FILTER01_CFG(base) & ~(mask)) | (value)))
#define RTC_SET_FILTER01_CFG(base, value) (BME_OR16(&RTC_FILTER01_CFG_REG(base), (uint16_t)(value)))
#define RTC_CLR_FILTER01_CFG(base, value) (BME_AND16(&RTC_FILTER01_CFG_REG(base), (uint16_t)(~(value))))
#define RTC_TOG_FILTER01_CFG(base, value) (BME_XOR16(&RTC_FILTER01_CFG_REG(base), (uint16_t)(value)))
/*@}*/

/*
 * Constants & macros for individual RTC_FILTER01_CFG bitfields
 */

/*!
 * @name Register RTC_FILTER01_CFG, field FIL_DUR1[3:0] (RW)
 *
 * This bit indicates the number of tamper filter clock cycles for which the
 * TAMPER[1] signal should remains stable before being detected as a tamper. These
 * bits are used by the tamper filtering operation. With the tamper duration set
 * to Zero any tamper detected on the tamper pins will directly set the tamper
 * status and interrupt bits. Caution is required when making the tamper filter
 * duration equal to 0 as any glitches on the tamper pins will cause a tamper
 * interrupt.
 *
 * Values:
 * - 0 - Filtering operation disabled.
 */
/*@{*/
/*! @brief Read current value of the RTC_FILTER01_CFG_FIL_DUR1 field. */
#define RTC_RD_FILTER01_CFG_FIL_DUR1(base) ((RTC_FILTER01_CFG_REG(base) & RTC_FILTER01_CFG_FIL_DUR1_MASK) >> RTC_FILTER01_CFG_FIL_DUR1_SHIFT)
#define RTC_BRD_FILTER01_CFG_FIL_DUR1(base) (BME_UBFX16(&RTC_FILTER01_CFG_REG(base), RTC_FILTER01_CFG_FIL_DUR1_SHIFT, RTC_FILTER01_CFG_FIL_DUR1_WIDTH))

/*! @brief Set the FIL_DUR1 field to a new value. */
#define RTC_WR_FILTER01_CFG_FIL_DUR1(base, value) (RTC_RMW_FILTER01_CFG(base, RTC_FILTER01_CFG_FIL_DUR1_MASK, RTC_FILTER01_CFG_FIL_DUR1(value)))
#define RTC_BWR_FILTER01_CFG_FIL_DUR1(base, value) (BME_BFI16(&RTC_FILTER01_CFG_REG(base), ((uint16_t)(value) << RTC_FILTER01_CFG_FIL_DUR1_SHIFT), RTC_FILTER01_CFG_FIL_DUR1_SHIFT, RTC_FILTER01_CFG_FIL_DUR1_WIDTH))
/*@}*/

/*!
 * @name Register RTC_FILTER01_CFG, field CLK_SEL1[6:4] (RW)
 *
 * This bit is a write once bit and selects the clock source for tamper filter
 * for tamper detect input bit 1.
 *
 * Values:
 * - 000 - 32 kHz clock
 * - 001 - 512 Hz clock
 * - 010 - 128 Hz clock
 * - 011 - 64 Hz clock
 * - 100 - 16 Hz clock
 * - 101 - 8 Hz clock
 * - 110 - 4 Hz clock
 * - 111 - 2 Hz clock
 */
/*@{*/
/*! @brief Read current value of the RTC_FILTER01_CFG_CLK_SEL1 field. */
#define RTC_RD_FILTER01_CFG_CLK_SEL1(base) ((RTC_FILTER01_CFG_REG(base) & RTC_FILTER01_CFG_CLK_SEL1_MASK) >> RTC_FILTER01_CFG_CLK_SEL1_SHIFT)
#define RTC_BRD_FILTER01_CFG_CLK_SEL1(base) (BME_UBFX16(&RTC_FILTER01_CFG_REG(base), RTC_FILTER01_CFG_CLK_SEL1_SHIFT, RTC_FILTER01_CFG_CLK_SEL1_WIDTH))

