pyocd/FlashAlgo/source/freescale/devices/MKM33ZA5/MKM33ZA5_extension.h
/*******************************************************************************
 * SIM_CTRL_REG - System Control Register
 ******************************************************************************/

/*!
 * @brief SIM_CTRL_REG - System Control Register (RW)
 *
 * Reset value: 0x00000000U
 *
 * Writes to this register can only be performed in Supervisor mode
 */
/*!
 * @name Constants and macros for entire SIM_CTRL_REG register
 */
/*@{*/
#define SIM_RD_CTRL_REG(base)    (SIM_CTRL_REG_REG(base))
#define SIM_WR_CTRL_REG(base, value) (SIM_CTRL_REG_REG(base) = (value))
#define SIM_RMW_CTRL_REG(base, mask, value) (SIM_WR_CTRL_REG(base, (SIM_RD_CTRL_REG(base) & ~(mask)) | (value)))
#define SIM_SET_CTRL_REG(base, value) (BME_OR32(&SIM_CTRL_REG_REG(base), (uint32_t)(value)))
#define SIM_CLR_CTRL_REG(base, value) (BME_AND32(&SIM_CTRL_REG_REG(base), (uint32_t)(~(value))))
#define SIM_TOG_CTRL_REG(base, value) (BME_XOR32(&SIM_CTRL_REG_REG(base), (uint32_t)(value)))
/*@}*/

/*
 * Constants & macros for individual SIM_CTRL_REG bitfields
 */

/*!
 * @name Register SIM_CTRL_REG, field NMIDIS[0] (RW)
 *
 * This field is used as an alternate to FTFL_FOPT[2] to disable the NMI
 * temporarily. It is also advised to program this bit while changing the state of the
 * NMI pin from NMI to GPIO functionality.
 *
 * Values:
 * - 0 - NMI enabled
 * - 1 - NMI disabled
 */
/*@{*/
/*! @brief Read current value of the SIM_CTRL_REG_NMIDIS field. */
#define SIM_RD_CTRL_REG_NMIDIS(base) ((SIM_CTRL_REG_REG(base) & SIM_CTRL_REG_NMIDIS_MASK) >> SIM_CTRL_REG_NMIDIS_SHIFT)
#define SIM_BRD_CTRL_REG_NMIDIS(base) (BME_UBFX32(&SIM_CTRL_REG_REG(base), SIM_CTRL_REG_NMIDIS_SHIFT, SIM_CTRL_REG_NMIDIS_WIDTH))

/*! @brief Set the NMIDIS field to a new value. */
#define SIM_WR_CTRL_REG_NMIDIS(base, value) (SIM_RMW_CTRL_REG(base, SIM_CTRL_REG_NMIDIS_MASK, SIM_CTRL_REG_NMIDIS(value)))
#define SIM_BWR_CTRL_REG_NMIDIS(base, value) (BME_BFI32(&SIM_CTRL_REG_REG(base), ((uint32_t)(value) << SIM_CTRL_REG_NMIDIS_SHIFT), SIM_CTRL_REG_NMIDIS_SHIFT, SIM_CTRL_REG_NMIDIS_WIDTH))
/*@}*/

/*!
 * @name Register SIM_CTRL_REG, field PLL_VLP_EN[1] (RW)
 *
 * When set, this bit enables the PLL in VLP modes.
 */
/*@{*/
/*! @brief Read current value of the SIM_CTRL_REG_PLL_VLP_EN field. */
#define SIM_RD_CTRL_REG_PLL_VLP_EN(base) ((SIM_CTRL_REG_REG(base) & SIM_CTRL_REG_PLL_VLP_EN_MASK) >> SIM_CTRL_REG_PLL_VLP_EN_SHIFT)
#define SIM_BRD_CTRL_REG_PLL_VLP_EN(base) (BME_UBFX32(&SIM_CTRL_REG_REG(base), SIM_CTRL_REG_PLL_VLP_EN_SHIFT, SIM_CTRL_REG_PLL_VLP_EN_WIDTH))

/*! @brief Set the PLL_VLP_EN field to a new value. */
#define SIM_WR_CTRL_REG_PLL_VLP_EN(base, value) (SIM_RMW_CTRL_REG(base, SIM_CTRL_REG_PLL_VLP_EN_MASK, SIM_CTRL_REG_PLL_VLP_EN(value)))
#define SIM_BWR_CTRL_REG_PLL_VLP_EN(base, value) (BME_BFI32(&SIM_CTRL_REG_REG(base), ((uint32_t)(value) << SIM_CTRL_REG_PLL_VLP_EN_SHIFT), SIM_CTRL_REG_PLL_VLP_EN_SHIFT, SIM_CTRL_REG_PLL_VLP_EN_WIDTH))
/*@}*/

/*!
 * @name Register SIM_CTRL_REG, field PTC2_HD_EN[2] (RW)
 *
 * Enables the High Drive on pad PTC[2] when set
 */
/*@{*/
/*! @brief Read current value of the SIM_CTRL_REG_PTC2_HD_EN field. */
#define SIM_RD_CTRL_REG_PTC2_HD_EN(base) ((SIM_CTRL_REG_REG(base) & SIM_CTRL_REG_PTC2_HD_EN_MASK) >> SIM_CTRL_REG_PTC2_HD_EN_SHIFT)
#define SIM_BRD_CTRL_REG_PTC2_HD_EN(base) (BME_UBFX32(&SIM_CTRL_REG_REG(base), SIM_CTRL_REG_PTC2_HD_EN_SHIFT, SIM_CTRL_REG_PTC2_HD_EN_WIDTH))

/*! @brief Set the PTC2_HD_EN field to a new value. */
#define SIM_WR_CTRL_REG_PTC2_HD_EN(base, value) (SIM_RMW_CTRL_REG(base, SIM_CTRL_REG_PTC2_HD_EN_MASK, SIM_CTRL_REG_PTC2_HD_EN(value)))
#define SIM_BWR_CTRL_REG_PTC2_HD_EN(base, value) (BME_BFI32(&SIM_CTRL_REG_REG(base), ((uint32_t)(value) << SIM_CTRL_REG_PTC2_HD_EN_SHIFT), SIM_CTRL_REG_PTC2_HD_EN_SHIFT, SIM_CTRL_REG_PTC2_HD_EN_WIDTH))
/*@}*/

/*!
 * @name Register SIM_CTRL_REG, field SAR_TRG_CLK_SEL[4:3] (RW)
 *
 * Selects the clock used to generate the ADC triggers.
 *
 * Values:
 * - 00 - Bus Clock (During Low Power Modes such as stop, the Bus clock is not
 *     available for conversion and should not be selected in case a conversion
 *     needs to be performed while in stop)
 * - 01 - ADC asynchronous Clock
 * - 10 - ERCLK32K
 * - 11 - OSCCLK
 */
/*@{*/
/*! @brief Read current value of the SIM_CTRL_REG_SAR_TRG_CLK_SEL field. */
#define SIM_RD_CTRL_REG_SAR_TRG_CLK_SEL(base) ((SIM_CTRL_REG_REG(base) & SIM_CTRL_REG_SAR_TRG_CLK_SEL_MASK) >> SIM_CTRL_REG_SAR_TRG_CLK_SEL_SHIFT)
#define SIM_BRD_CTRL_REG_SAR_TRG_CLK_SEL(base) (BME_UBFX32(&SIM_CTRL_REG_REG(base), SIM_CTRL_REG_SAR_TRG_CLK_SEL_SHIFT, SIM_CTRL_REG_SAR_TRG_CLK_SEL_WIDTH))

/*! @brief Set the SAR_TRG_CLK_SEL field to a new value. */
#define SIM_WR_CTRL_REG_SAR_TRG_CLK_SEL(base, value) (SIM_RMW_CTRL_REG(base, SIM_CTRL_REG_SAR_TRG_CLK_SEL_MASK, SIM_CTRL_REG_SAR_TRG_CLK_SEL(value)))
#define SIM_BWR_CTRL_REG_SAR_TRG_CLK_SEL(base, value) (BME_BFI32(&SIM_CTRL_REG_REG(base), ((uint32_t)(value) << SIM_CTRL_REG_SAR_TRG_CLK_SEL_SHIFT), SIM_CTRL_REG_SAR_TRG_CLK_SEL_SHIFT, SIM_CTRL_REG_SAR_TRG_CLK_SEL_WIDTH))
/*@}*/

/*!
 * @name Register SIM_CTRL_REG, field CLKOUTSEL[7:5] (RW)
 *
 * This field can be used to select one of the following clocks for CLKOUT pin.
 *
 * Values:
 * - 000 - Disabled
 * - 001 - Gated Core Clk
 * - 010 - Bus/Flash Clk
 * - 011 - LPO clock from PMC
 * - 100 - IRC clock from MCG
 * - 101 - Muxed 32Khz source (please refer SOPT1[19:18] for possible options)
 * - 110 - MHz Oscillator external reference clock
 * - 111 - PLL clock output from MCG
 */
/*@{*/
/*! @brief Read current value of the SIM_CTRL_REG_CLKOUTSEL field. */
#define SIM_RD_CTRL_REG_CLKOUTSEL(base) ((SIM_CTRL_REG_REG(base) & SIM_CTRL_REG_CLKOUTSEL_MASK) >> SIM_CTRL_REG_CLKOUTSEL_SHIFT)
#define SIM_BRD_CTRL_REG_CLKOUTSEL(base) (BME_UBFX32(&SIM_CTRL_REG_REG(base), SIM_CTRL_REG_CLKOUTSEL_SHIFT, SIM_CTRL_REG_CLKOUTSEL_WIDTH))

/*! @brief Set the CLKOUTSEL field to a new value. */
#define SIM_WR_CTRL_REG_CLKOUTSEL(base, value) (SIM_RMW_CTRL_REG(base, SIM_CTRL_REG_CLKOUTSEL_MASK, SIM_CTRL_REG_CLKOUTSEL(value)))
#define SIM_BWR_CTRL_REG_CLKOUTSEL(base, value) (BME_BFI32(&SIM_CTRL_REG_REG(base), ((uint32_t)(value) << SIM_CTRL_REG_CLKOUTSEL_SHIFT), SIM_CTRL_REG_CLKOUTSEL_SHIFT, SIM_CTRL_REG_CLKOUTSEL_WIDTH))
/*@}*/

