pyocd/FlashAlgo/source/freescale/devices/MKM33ZA5/MKM33ZA5_extension.h
/*******************************************************************************
 * SIM_MISC_CTL - Miscellaneous Control Register
 ******************************************************************************/

/*!
 * @brief SIM_MISC_CTL - Miscellaneous Control Register (RW)
 *
 * Reset value: 0x80000000U
 *
 * This register contains various fields to control miscellaneous features such
 * as receive/ transmit select for UART, PIT output selection, EWM input
 * selection, ClkOut selection etc. Writes to this register can only be performed in
 * Supervisor mode
 */
/*!
 * @name Constants and macros for entire SIM_MISC_CTL register
 */
/*@{*/
#define SIM_RD_MISC_CTL(base)    (SIM_MISC_CTL_REG(base))
#define SIM_WR_MISC_CTL(base, value) (SIM_MISC_CTL_REG(base) = (value))
#define SIM_RMW_MISC_CTL(base, mask, value) (SIM_WR_MISC_CTL(base, (SIM_RD_MISC_CTL(base) & ~(mask)) | (value)))
#define SIM_SET_MISC_CTL(base, value) (BME_OR32(&SIM_MISC_CTL_REG(base), (uint32_t)(value)))
#define SIM_CLR_MISC_CTL(base, value) (BME_AND32(&SIM_MISC_CTL_REG(base), (uint32_t)(~(value))))
#define SIM_TOG_MISC_CTL(base, value) (BME_XOR32(&SIM_MISC_CTL_REG(base), (uint32_t)(value)))
/*@}*/

/*
 * Constants & macros for individual SIM_MISC_CTL bitfields
 */

/*!
 * @name Register SIM_MISC_CTL, field XBARAFEMODOUTSEL[1:0] (RW)
 *
 * This field selects modulator data output of the respective AFE channel to
 * drive XBAR_IN[3].
 *
 * Values:
 * - 00 - Sigma Delta Modulator 0 data output
 * - 01 - Sigma Delta Modulator 1 data output
 * - 10 - Sigma Delta Modulator 2 data output
 * - 11 - Sigma Delta Modulator 3 data output
 */
/*@{*/
/*! @brief Read current value of the SIM_MISC_CTL_XBARAFEMODOUTSEL field. */
#define SIM_RD_MISC_CTL_XBARAFEMODOUTSEL(base) ((SIM_MISC_CTL_REG(base) & SIM_MISC_CTL_XBARAFEMODOUTSEL_MASK) >> SIM_MISC_CTL_XBARAFEMODOUTSEL_SHIFT)
#define SIM_BRD_MISC_CTL_XBARAFEMODOUTSEL(base) (BME_UBFX32(&SIM_MISC_CTL_REG(base), SIM_MISC_CTL_XBARAFEMODOUTSEL_SHIFT, SIM_MISC_CTL_XBARAFEMODOUTSEL_WIDTH))

/*! @brief Set the XBARAFEMODOUTSEL field to a new value. */
#define SIM_WR_MISC_CTL_XBARAFEMODOUTSEL(base, value) (SIM_RMW_MISC_CTL(base, SIM_MISC_CTL_XBARAFEMODOUTSEL_MASK, SIM_MISC_CTL_XBARAFEMODOUTSEL(value)))
#define SIM_BWR_MISC_CTL_XBARAFEMODOUTSEL(base, value) (BME_BFI32(&SIM_MISC_CTL_REG(base), ((uint32_t)(value) << SIM_MISC_CTL_XBARAFEMODOUTSEL_SHIFT), SIM_MISC_CTL_XBARAFEMODOUTSEL_SHIFT, SIM_MISC_CTL_XBARAFEMODOUTSEL_WIDTH))
/*@}*/

/*!
 * @name Register SIM_MISC_CTL, field DMADONESEL[3:2] (RW)
 *
 * This field can be used to select the DMA Done flag to drive XBAR_IN[32]
 *
 * Values:
 * - 00 - DMA0
 * - 01 - DMA1
 * - 10 - DMA2
 * - 11 - DMA3
 */
/*@{*/
/*! @brief Read current value of the SIM_MISC_CTL_DMADONESEL field. */
#define SIM_RD_MISC_CTL_DMADONESEL(base) ((SIM_MISC_CTL_REG(base) & SIM_MISC_CTL_DMADONESEL_MASK) >> SIM_MISC_CTL_DMADONESEL_SHIFT)
#define SIM_BRD_MISC_CTL_DMADONESEL(base) (BME_UBFX32(&SIM_MISC_CTL_REG(base), SIM_MISC_CTL_DMADONESEL_SHIFT, SIM_MISC_CTL_DMADONESEL_WIDTH))

/*! @brief Set the DMADONESEL field to a new value. */
#define SIM_WR_MISC_CTL_DMADONESEL(base, value) (SIM_RMW_MISC_CTL(base, SIM_MISC_CTL_DMADONESEL_MASK, SIM_MISC_CTL_DMADONESEL(value)))
#define SIM_BWR_MISC_CTL_DMADONESEL(base, value) (BME_BFI32(&SIM_MISC_CTL_REG(base), ((uint32_t)(value) << SIM_MISC_CTL_DMADONESEL_SHIFT), SIM_MISC_CTL_DMADONESEL_SHIFT, SIM_MISC_CTL_DMADONESEL_WIDTH))
/*@}*/

/*!
 * @name Register SIM_MISC_CTL, field AFECLKSEL[5:4] (RW)
 *
 * Selects between PLL, FLL and OSC clock as the source for the PLL clock branch
 * for AFE Clock Mux
 *
 * Values:
 * - 00 - MCG PLL Clock selected
 * - 01 - MCG FLL Clock selected
 * - 10 - OSC Clock selected
 * - 11 - Disabled
 */
/*@{*/
/*! @brief Read current value of the SIM_MISC_CTL_AFECLKSEL field. */
#define SIM_RD_MISC_CTL_AFECLKSEL(base) ((SIM_MISC_CTL_REG(base) & SIM_MISC_CTL_AFECLKSEL_MASK) >> SIM_MISC_CTL_AFECLKSEL_SHIFT)
#define SIM_BRD_MISC_CTL_AFECLKSEL(base) (BME_UBFX32(&SIM_MISC_CTL_REG(base), SIM_MISC_CTL_AFECLKSEL_SHIFT, SIM_MISC_CTL_AFECLKSEL_WIDTH))

/*! @brief Set the AFECLKSEL field to a new value. */
#define SIM_WR_MISC_CTL_AFECLKSEL(base, value) (SIM_RMW_MISC_CTL(base, SIM_MISC_CTL_AFECLKSEL_MASK, SIM_MISC_CTL_AFECLKSEL(value)))
#define SIM_BWR_MISC_CTL_AFECLKSEL(base, value) (BME_BFI32(&SIM_MISC_CTL_REG(base), ((uint32_t)(value) << SIM_MISC_CTL_AFECLKSEL_SHIFT), SIM_MISC_CTL_AFECLKSEL_SHIFT, SIM_MISC_CTL_AFECLKSEL_WIDTH))
/*@}*/

/*!
 * @name Register SIM_MISC_CTL, field AFECLKPADDIR[6] (RW)
 *
 * Controls the direction of the AFE CLK pin
 *
 * Values:
 * - 0 - AFE CLK PAD is input
 * - 1 - AFE CLK PAD is output
 */
/*@{*/
/*! @brief Read current value of the SIM_MISC_CTL_AFECLKPADDIR field. */
#define SIM_RD_MISC_CTL_AFECLKPADDIR(base) ((SIM_MISC_CTL_REG(base) & SIM_MISC_CTL_AFECLKPADDIR_MASK) >> SIM_MISC_CTL_AFECLKPADDIR_SHIFT)
#define SIM_BRD_MISC_CTL_AFECLKPADDIR(base) (BME_UBFX32(&SIM_MISC_CTL_REG(base), SIM_MISC_CTL_AFECLKPADDIR_SHIFT, SIM_MISC_CTL_AFECLKPADDIR_WIDTH))

/*! @brief Set the AFECLKPADDIR field to a new value. */
#define SIM_WR_MISC_CTL_AFECLKPADDIR(base, value) (SIM_RMW_MISC_CTL(base, SIM_MISC_CTL_AFECLKPADDIR_MASK, SIM_MISC_CTL_AFECLKPADDIR(value)))
#define SIM_BWR_MISC_CTL_AFECLKPADDIR(base, value) (BME_BFI32(&SIM_MISC_CTL_REG(base), ((uint32_t)(value) << SIM_MISC_CTL_AFECLKPADDIR_SHIFT), SIM_MISC_CTL_AFECLKPADDIR_SHIFT, SIM_MISC_CTL_AFECLKPADDIR_WIDTH))
/*@}*/

/*!
 * @name Register SIM_MISC_CTL, field UARTMODTYPE[7] (RW)
 *
 * Selects between TypeA and TypeB modulation for IRDA support
 *
 * Values:
 * - 0 - TypeA (ORed) Modulation selected for IRDA
 * - 1 - TypeB (ANDed) Modulation selected for IRDA
 */
/*@{*/
/*! @brief Read current value of the SIM_MISC_CTL_UARTMODTYPE field. */
#define SIM_RD_MISC_CTL_UARTMODTYPE(base) ((SIM_MISC_CTL_REG(base) & SIM_MISC_CTL_UARTMODTYPE_MASK) >> SIM_MISC_CTL_UARTMODTYPE_SHIFT)
#define SIM_BRD_MISC_CTL_UARTMODTYPE(base) (BME_UBFX32(&SIM_MISC_CTL_REG(base), SIM_MISC_CTL_UARTMODTYPE_SHIFT, SIM_MISC_CTL_UARTMODTYPE_WIDTH))

/*! @brief Set the UARTMODTYPE field to a new value. */
#define SIM_WR_MISC_CTL_UARTMODTYPE(base, value) (SIM_RMW_MISC_CTL(base, SIM_MISC_CTL_UARTMODTYPE_MASK, SIM_MISC_CTL_UARTMODTYPE(value)))
#define SIM_BWR_MISC_CTL_UARTMODTYPE(base, value) (BME_BFI32(&SIM_MISC_CTL_REG(base), ((uint32_t)(value) << SIM_MISC_CTL_UARTMODTYPE_SHIFT), SIM_MISC_CTL_UARTMODTYPE_SHIFT, SIM_MISC_CTL_UARTMODTYPE_WIDTH))
/*@}*/

/*!
 * @name Register SIM_MISC_CTL, field UART0IRSEL[8] (RW)
 *
 * Exclusive selection with other UARTs. Do not select while another UART is
 * selected for the same functionality
 *
 * Values:
 * - 0 - Pad RX input (PTD[0] or PTF[3], as selected in Pinmux control) selected
 *     for RX input of UART0 and UART0 TX signal is not used for modulation
 * - 1 - UART0 selected for IRDA modulation. UART0 TX modulated by XBAR_OUT[14]
 *     and UART0 RX input connected to XBAR_OUT[13]
 */
/*@{*/
/*! @brief Read current value of the SIM_MISC_CTL_UART0IRSEL field. */
#define SIM_RD_MISC_CTL_UART0IRSEL(base) ((SIM_MISC_CTL_REG(base) & SIM_MISC_CTL_UART0IRSEL_MASK) >> SIM_MISC_CTL_UART0IRSEL_SHIFT)
#define SIM_BRD_MISC_CTL_UART0IRSEL(base) (BME_UBFX32(&SIM_MISC_CTL_REG(base), SIM_MISC_CTL_UART0IRSEL_SHIFT, SIM_MISC_CTL_UART0IRSEL_WIDTH))

