pyocd/FlashAlgo/source/freescale/devices/MKM33ZA5/MKM33ZA5_extension.h
/*! @brief Set the TMR0SCSSEL field to a new value. */
#define SIM_WR_MISC_CTL_TMR0SCSSEL(base, value) (SIM_RMW_MISC_CTL(base, SIM_MISC_CTL_TMR0SCSSEL_MASK, SIM_MISC_CTL_TMR0SCSSEL(value)))
#define SIM_BWR_MISC_CTL_TMR0SCSSEL(base, value) (BME_BFI32(&SIM_MISC_CTL_REG(base), ((uint32_t)(value) << SIM_MISC_CTL_TMR0SCSSEL_SHIFT), SIM_MISC_CTL_TMR0SCSSEL_SHIFT, SIM_MISC_CTL_TMR0SCSSEL_WIDTH))
/*@}*/

/*!
 * @name Register SIM_MISC_CTL, field TMR1SCSSEL[17] (RW)
 *
 * This field is used to select secondary count input source for Quadtimer
 * Channel1. Configure TMR_1_CTRL_SCS = 01b to route selected secondary source to the
 * timer Channel1.
 *
 * Values:
 * - 0 - Pad PTG0 or PTC6, depending upon PCTL configuration.
 * - 1 - Peripheral Crossbar (XBAR) Output[6]
 */
/*@{*/
/*! @brief Read current value of the SIM_MISC_CTL_TMR1SCSSEL field. */
#define SIM_RD_MISC_CTL_TMR1SCSSEL(base) ((SIM_MISC_CTL_REG(base) & SIM_MISC_CTL_TMR1SCSSEL_MASK) >> SIM_MISC_CTL_TMR1SCSSEL_SHIFT)
#define SIM_BRD_MISC_CTL_TMR1SCSSEL(base) (BME_UBFX32(&SIM_MISC_CTL_REG(base), SIM_MISC_CTL_TMR1SCSSEL_SHIFT, SIM_MISC_CTL_TMR1SCSSEL_WIDTH))

/*! @brief Set the TMR1SCSSEL field to a new value. */
#define SIM_WR_MISC_CTL_TMR1SCSSEL(base, value) (SIM_RMW_MISC_CTL(base, SIM_MISC_CTL_TMR1SCSSEL_MASK, SIM_MISC_CTL_TMR1SCSSEL(value)))
#define SIM_BWR_MISC_CTL_TMR1SCSSEL(base, value) (BME_BFI32(&SIM_MISC_CTL_REG(base), ((uint32_t)(value) << SIM_MISC_CTL_TMR1SCSSEL_SHIFT), SIM_MISC_CTL_TMR1SCSSEL_SHIFT, SIM_MISC_CTL_TMR1SCSSEL_WIDTH))
/*@}*/

/*!
 * @name Register SIM_MISC_CTL, field TMR2SCSSEL[18] (RW)
 *
 * This field is used to select secondary count input source for Quadtimer
 * Channel2. Configure TMR_2_CTRL_SCS = 10b to route selected secondary source to the
 * timer Channel2.
 *
 * Values:
 * - 0 - Pad PTF7 or PTF0, depending upon PCTL configuration.
 * - 1 - Peripheral Crossbar (XBAR) Output[7]
 */
/*@{*/
/*! @brief Read current value of the SIM_MISC_CTL_TMR2SCSSEL field. */
#define SIM_RD_MISC_CTL_TMR2SCSSEL(base) ((SIM_MISC_CTL_REG(base) & SIM_MISC_CTL_TMR2SCSSEL_MASK) >> SIM_MISC_CTL_TMR2SCSSEL_SHIFT)
#define SIM_BRD_MISC_CTL_TMR2SCSSEL(base) (BME_UBFX32(&SIM_MISC_CTL_REG(base), SIM_MISC_CTL_TMR2SCSSEL_SHIFT, SIM_MISC_CTL_TMR2SCSSEL_WIDTH))

/*! @brief Set the TMR2SCSSEL field to a new value. */
#define SIM_WR_MISC_CTL_TMR2SCSSEL(base, value) (SIM_RMW_MISC_CTL(base, SIM_MISC_CTL_TMR2SCSSEL_MASK, SIM_MISC_CTL_TMR2SCSSEL(value)))
#define SIM_BWR_MISC_CTL_TMR2SCSSEL(base, value) (BME_BFI32(&SIM_MISC_CTL_REG(base), ((uint32_t)(value) << SIM_MISC_CTL_TMR2SCSSEL_SHIFT), SIM_MISC_CTL_TMR2SCSSEL_SHIFT, SIM_MISC_CTL_TMR2SCSSEL_WIDTH))
/*@}*/

/*!
 * @name Register SIM_MISC_CTL, field TMR3SCSSEL[19] (RW)
 *
 * This field is used to select secondary count input source for Quadtimer
 * Channel3. Configure TMR_3_CTRL_SCS = 11b to route selected secondary source to the
 * timer Channel3.
 *
 * Values:
 * - 0 - Pad PTE5 or PTD1, depending upon PCTL configuration.
 * - 1 - Peripheral Crossbar (XBAR) Output[8]
 */
/*@{*/
/*! @brief Read current value of the SIM_MISC_CTL_TMR3SCSSEL field. */
#define SIM_RD_MISC_CTL_TMR3SCSSEL(base) ((SIM_MISC_CTL_REG(base) & SIM_MISC_CTL_TMR3SCSSEL_MASK) >> SIM_MISC_CTL_TMR3SCSSEL_SHIFT)
#define SIM_BRD_MISC_CTL_TMR3SCSSEL(base) (BME_UBFX32(&SIM_MISC_CTL_REG(base), SIM_MISC_CTL_TMR3SCSSEL_SHIFT, SIM_MISC_CTL_TMR3SCSSEL_WIDTH))

/*! @brief Set the TMR3SCSSEL field to a new value. */
#define SIM_WR_MISC_CTL_TMR3SCSSEL(base, value) (SIM_RMW_MISC_CTL(base, SIM_MISC_CTL_TMR3SCSSEL_MASK, SIM_MISC_CTL_TMR3SCSSEL(value)))
#define SIM_BWR_MISC_CTL_TMR3SCSSEL(base, value) (BME_BFI32(&SIM_MISC_CTL_REG(base), ((uint32_t)(value) << SIM_MISC_CTL_TMR3SCSSEL_SHIFT), SIM_MISC_CTL_TMR3SCSSEL_SHIFT, SIM_MISC_CTL_TMR3SCSSEL_WIDTH))
/*@}*/

/*!
 * @name Register SIM_MISC_CTL, field TMR0PCSSEL[21:20] (RW)
 *
 * This is used to select primary count source (clock) for Quadtimer Channel0.
 * Configure TMR_0_CTRL_PCS = 1xxxb to route selected primary clock source to the
 * timer Channel0.
 *
 * Values:
 * - 00 - Bus Clock
 * - 01 - Peripheral Crossbar Output [9]
 * - 10 - Peripheral Crossbar Output [10]
 * - 11 - Disabled
 */
/*@{*/
/*! @brief Read current value of the SIM_MISC_CTL_TMR0PCSSEL field. */
#define SIM_RD_MISC_CTL_TMR0PCSSEL(base) ((SIM_MISC_CTL_REG(base) & SIM_MISC_CTL_TMR0PCSSEL_MASK) >> SIM_MISC_CTL_TMR0PCSSEL_SHIFT)
#define SIM_BRD_MISC_CTL_TMR0PCSSEL(base) (BME_UBFX32(&SIM_MISC_CTL_REG(base), SIM_MISC_CTL_TMR0PCSSEL_SHIFT, SIM_MISC_CTL_TMR0PCSSEL_WIDTH))

/*! @brief Set the TMR0PCSSEL field to a new value. */
#define SIM_WR_MISC_CTL_TMR0PCSSEL(base, value) (SIM_RMW_MISC_CTL(base, SIM_MISC_CTL_TMR0PCSSEL_MASK, SIM_MISC_CTL_TMR0PCSSEL(value)))
#define SIM_BWR_MISC_CTL_TMR0PCSSEL(base, value) (BME_BFI32(&SIM_MISC_CTL_REG(base), ((uint32_t)(value) << SIM_MISC_CTL_TMR0PCSSEL_SHIFT), SIM_MISC_CTL_TMR0PCSSEL_SHIFT, SIM_MISC_CTL_TMR0PCSSEL_WIDTH))
/*@}*/

/*!
 * @name Register SIM_MISC_CTL, field TMR1PCSSEL[23:22] (RW)
 *
 * This is used to select primary count source (clock) for Quadtimer Channel1.
 * Configure TMR_1_CTRL_PCS = 1xxxb to route selected primary clock source to the
 * timer Channel1.
 *
 * Values:
 * - 00 - Bus Clock
 * - 01 - Peripheral Crossbar Output [9]
 * - 10 - Peripheral Crossbar Output [10]
 * - 11 - Disabled
 */
/*@{*/
/*! @brief Read current value of the SIM_MISC_CTL_TMR1PCSSEL field. */
#define SIM_RD_MISC_CTL_TMR1PCSSEL(base) ((SIM_MISC_CTL_REG(base) & SIM_MISC_CTL_TMR1PCSSEL_MASK) >> SIM_MISC_CTL_TMR1PCSSEL_SHIFT)
#define SIM_BRD_MISC_CTL_TMR1PCSSEL(base) (BME_UBFX32(&SIM_MISC_CTL_REG(base), SIM_MISC_CTL_TMR1PCSSEL_SHIFT, SIM_MISC_CTL_TMR1PCSSEL_WIDTH))

/*! @brief Set the TMR1PCSSEL field to a new value. */
#define SIM_WR_MISC_CTL_TMR1PCSSEL(base, value) (SIM_RMW_MISC_CTL(base, SIM_MISC_CTL_TMR1PCSSEL_MASK, SIM_MISC_CTL_TMR1PCSSEL(value)))
#define SIM_BWR_MISC_CTL_TMR1PCSSEL(base, value) (BME_BFI32(&SIM_MISC_CTL_REG(base), ((uint32_t)(value) << SIM_MISC_CTL_TMR1PCSSEL_SHIFT), SIM_MISC_CTL_TMR1PCSSEL_SHIFT, SIM_MISC_CTL_TMR1PCSSEL_WIDTH))
/*@}*/

/*!
 * @name Register SIM_MISC_CTL, field TMR2PCSSEL[25:24] (RW)
 *
 * This is used to select primary count source (clock) for Quadtimer Channel2.
 * Configure TMR_2_CTRL_PCS = 1xxxb to route selected primary clock source to the
 * timer Channel2.
 *
 * Values:
 * - 00 - Bus Clock
 * - 01 - Peripheral Crossbar Output [9]
 * - 10 - Peripheral Crossbar Output [10]
 * - 11 - Disabled
 */
/*@{*/
/*! @brief Read current value of the SIM_MISC_CTL_TMR2PCSSEL field. */
#define SIM_RD_MISC_CTL_TMR2PCSSEL(base) ((SIM_MISC_CTL_REG(base) & SIM_MISC_CTL_TMR2PCSSEL_MASK) >> SIM_MISC_CTL_TMR2PCSSEL_SHIFT)
#define SIM_BRD_MISC_CTL_TMR2PCSSEL(base) (BME_UBFX32(&SIM_MISC_CTL_REG(base), SIM_MISC_CTL_TMR2PCSSEL_SHIFT, SIM_MISC_CTL_TMR2PCSSEL_WIDTH))

/*! @brief Set the TMR2PCSSEL field to a new value. */
#define SIM_WR_MISC_CTL_TMR2PCSSEL(base, value) (SIM_RMW_MISC_CTL(base, SIM_MISC_CTL_TMR2PCSSEL_MASK, SIM_MISC_CTL_TMR2PCSSEL(value)))
#define SIM_BWR_MISC_CTL_TMR2PCSSEL(base, value) (BME_BFI32(&SIM_MISC_CTL_REG(base), ((uint32_t)(value) << SIM_MISC_CTL_TMR2PCSSEL_SHIFT), SIM_MISC_CTL_TMR2PCSSEL_SHIFT, SIM_MISC_CTL_TMR2PCSSEL_WIDTH))
/*@}*/

/*!
 * @name Register SIM_MISC_CTL, field TMR3PCSSEL[27:26] (RW)
 *
 * This is used to select primary count source (clock) for Quadtimer Channel3.
 * Configure TMR_3_CTRL_PCS = 1xxxb to route selected primary clock source to the
 * timer Channel3.
 *
 * Values:
 * - 00 - Bus Clock
 * - 01 - Peripheral Crossbar Output [9]
 * - 10 - Peripheral Crossbar Output [10]
 * - 11 - Disabled
 */
/*@{*/
/*! @brief Read current value of the SIM_MISC_CTL_TMR3PCSSEL field. */
#define SIM_RD_MISC_CTL_TMR3PCSSEL(base) ((SIM_MISC_CTL_REG(base) & SIM_MISC_CTL_TMR3PCSSEL_MASK) >> SIM_MISC_CTL_TMR3PCSSEL_SHIFT)
#define SIM_BRD_MISC_CTL_TMR3PCSSEL(base) (BME_UBFX32(&SIM_MISC_CTL_REG(base), SIM_MISC_CTL_TMR3PCSSEL_SHIFT, SIM_MISC_CTL_TMR3PCSSEL_WIDTH))

