pyocd/FlashAlgo/source/freescale/devices/MKM33ZA5/MKM33ZA5_extension.h
/*! @brief Set the TMR3PCSSEL field to a new value. */
#define SIM_WR_MISC_CTL_TMR3PCSSEL(base, value) (SIM_RMW_MISC_CTL(base, SIM_MISC_CTL_TMR3PCSSEL_MASK, SIM_MISC_CTL_TMR3PCSSEL(value)))
#define SIM_BWR_MISC_CTL_TMR3PCSSEL(base, value) (BME_BFI32(&SIM_MISC_CTL_REG(base), ((uint32_t)(value) << SIM_MISC_CTL_TMR3PCSSEL_SHIFT), SIM_MISC_CTL_TMR3PCSSEL_SHIFT, SIM_MISC_CTL_TMR3PCSSEL_WIDTH))
/*@}*/

/*!
 * @name Register SIM_MISC_CTL, field RTCCLKSEL[28] (RW)
 *
 * Selects between 32K IRC and OSC_32K clk for RTC operation
 *
 * Values:
 * - 0 - RTC OSC_32K clock selected
 * - 1 - 32K IRC Clock selected
 */
/*@{*/
/*! @brief Read current value of the SIM_MISC_CTL_RTCCLKSEL field. */
#define SIM_RD_MISC_CTL_RTCCLKSEL(base) ((SIM_MISC_CTL_REG(base) & SIM_MISC_CTL_RTCCLKSEL_MASK) >> SIM_MISC_CTL_RTCCLKSEL_SHIFT)
#define SIM_BRD_MISC_CTL_RTCCLKSEL(base) (BME_UBFX32(&SIM_MISC_CTL_REG(base), SIM_MISC_CTL_RTCCLKSEL_SHIFT, SIM_MISC_CTL_RTCCLKSEL_WIDTH))

/*! @brief Set the RTCCLKSEL field to a new value. */
#define SIM_WR_MISC_CTL_RTCCLKSEL(base, value) (SIM_RMW_MISC_CTL(base, SIM_MISC_CTL_RTCCLKSEL_MASK, SIM_MISC_CTL_RTCCLKSEL(value)))
#define SIM_BWR_MISC_CTL_RTCCLKSEL(base, value) (BME_BFI32(&SIM_MISC_CTL_REG(base), ((uint32_t)(value) << SIM_MISC_CTL_RTCCLKSEL_SHIFT), SIM_MISC_CTL_RTCCLKSEL_SHIFT, SIM_MISC_CTL_RTCCLKSEL_WIDTH))
/*@}*/

/*!
 * @name Register SIM_MISC_CTL, field VREFBUFOUTEN[29] (RW)
 *
 * Operates switch in VrefBuffer to enable the internal 1.2v reference to be
 * driven to VREF pad.
 *
 * Values:
 * - 0 - Buffer does not drive PAD
 * - 1 - Buffer drives selected voltage (selected by vref_buffer_sel) on pad
 */
/*@{*/
/*! @brief Read current value of the SIM_MISC_CTL_VREFBUFOUTEN field. */
#define SIM_RD_MISC_CTL_VREFBUFOUTEN(base) ((SIM_MISC_CTL_REG(base) & SIM_MISC_CTL_VREFBUFOUTEN_MASK) >> SIM_MISC_CTL_VREFBUFOUTEN_SHIFT)
#define SIM_BRD_MISC_CTL_VREFBUFOUTEN(base) (BME_UBFX32(&SIM_MISC_CTL_REG(base), SIM_MISC_CTL_VREFBUFOUTEN_SHIFT, SIM_MISC_CTL_VREFBUFOUTEN_WIDTH))

/*! @brief Set the VREFBUFOUTEN field to a new value. */
#define SIM_WR_MISC_CTL_VREFBUFOUTEN(base, value) (SIM_RMW_MISC_CTL(base, SIM_MISC_CTL_VREFBUFOUTEN_MASK, SIM_MISC_CTL_VREFBUFOUTEN(value)))
#define SIM_BWR_MISC_CTL_VREFBUFOUTEN(base, value) (BME_BFI32(&SIM_MISC_CTL_REG(base), ((uint32_t)(value) << SIM_MISC_CTL_VREFBUFOUTEN_SHIFT), SIM_MISC_CTL_VREFBUFOUTEN_SHIFT, SIM_MISC_CTL_VREFBUFOUTEN_WIDTH))
/*@}*/

/*!
 * @name Register SIM_MISC_CTL, field VREFBUFINSEL[30] (RW)
 *
 * Selects Between Internal 1.2v reference and external reference for SAR and DAC
 *
 * Values:
 * - 0 - Internal Reference selected as Buffer Input
 * - 1 - External Reference selected as Buffer Input
 */
/*@{*/
/*! @brief Read current value of the SIM_MISC_CTL_VREFBUFINSEL field. */
#define SIM_RD_MISC_CTL_VREFBUFINSEL(base) ((SIM_MISC_CTL_REG(base) & SIM_MISC_CTL_VREFBUFINSEL_MASK) >> SIM_MISC_CTL_VREFBUFINSEL_SHIFT)
#define SIM_BRD_MISC_CTL_VREFBUFINSEL(base) (BME_UBFX32(&SIM_MISC_CTL_REG(base), SIM_MISC_CTL_VREFBUFINSEL_SHIFT, SIM_MISC_CTL_VREFBUFINSEL_WIDTH))

/*! @brief Set the VREFBUFINSEL field to a new value. */
#define SIM_WR_MISC_CTL_VREFBUFINSEL(base, value) (SIM_RMW_MISC_CTL(base, SIM_MISC_CTL_VREFBUFINSEL_MASK, SIM_MISC_CTL_VREFBUFINSEL(value)))
#define SIM_BWR_MISC_CTL_VREFBUFINSEL(base, value) (BME_BFI32(&SIM_MISC_CTL_REG(base), ((uint32_t)(value) << SIM_MISC_CTL_VREFBUFINSEL_SHIFT), SIM_MISC_CTL_VREFBUFINSEL_SHIFT, SIM_MISC_CTL_VREFBUFINSEL_WIDTH))
/*@}*/

/*!
 * @name Register SIM_MISC_CTL, field VREFBUFPD[31] (RW)
 *
 * Powers down VrefBuffer when set
 *
 * Values:
 * - 0 - Buffer Enabled
 * - 1 - Buffer Powered Down
 */
/*@{*/
/*! @brief Read current value of the SIM_MISC_CTL_VREFBUFPD field. */
#define SIM_RD_MISC_CTL_VREFBUFPD(base) ((SIM_MISC_CTL_REG(base) & SIM_MISC_CTL_VREFBUFPD_MASK) >> SIM_MISC_CTL_VREFBUFPD_SHIFT)
#define SIM_BRD_MISC_CTL_VREFBUFPD(base) (BME_UBFX32(&SIM_MISC_CTL_REG(base), SIM_MISC_CTL_VREFBUFPD_SHIFT, SIM_MISC_CTL_VREFBUFPD_WIDTH))

/*! @brief Set the VREFBUFPD field to a new value. */
#define SIM_WR_MISC_CTL_VREFBUFPD(base, value) (SIM_RMW_MISC_CTL(base, SIM_MISC_CTL_VREFBUFPD_MASK, SIM_MISC_CTL_VREFBUFPD(value)))
#define SIM_BWR_MISC_CTL_VREFBUFPD(base, value) (BME_BFI32(&SIM_MISC_CTL_REG(base), ((uint32_t)(value) << SIM_MISC_CTL_VREFBUFPD_SHIFT), SIM_MISC_CTL_VREFBUFPD_SHIFT, SIM_MISC_CTL_VREFBUFPD_WIDTH))
/*@}*/

/*
 * MKM33ZA5 SMC
 *
 * System Mode Controller
 *
 * Registers defined in this header file:
 * - SMC_PMPROT - Power Mode Protection register
 * - SMC_PMCTRL - Power Mode Control register
 * - SMC_STOPCTRL - Stop Control Register
 * - SMC_PMSTAT - Power Mode Status register
 */

#define SMC_INSTANCE_COUNT (1U) /*!< Number of instances of the SMC module. */
#define SMC_IDX (0U) /*!< Instance number for SMC. */

/*******************************************************************************
 * SMC_PMPROT - Power Mode Protection register
 ******************************************************************************/

/*!
 * @brief SMC_PMPROT - Power Mode Protection register (RW)
 *
 * Reset value: 0x20U
 *
 * This register provides protection for entry into any low-power run or stop
 * mode. The enabling of the low-power run or stop mode occurs by configuring the
 * Power Mode Control register (PMCTRL). The PMPROT register can be written only
 * once after any system reset. If the MCU is configured for a disallowed or
 * reserved power mode, the MCU remains in its current power mode. For example, if the
 * MCU is in normal RUN mode and AVLP is 0, an attempt to enter VLPR mode using
 * PMCTRL[RUNM] is blocked and PMCTRL[RUNM] remains 00b, indicating the MCU is
 * still in Normal Run mode. This register is reset on Chip Reset not VLLS and by
 * reset types that trigger Chip Reset not VLLS. It is unaffected by reset types
 * that do not trigger Chip Reset not VLLS. See the Reset section details for more
 * information.
 */
/*!
 * @name Constants and macros for entire SMC_PMPROT register
 */
/*@{*/
#define SMC_RD_PMPROT(base)      (SMC_PMPROT_REG(base))
#define SMC_WR_PMPROT(base, value) (SMC_PMPROT_REG(base) = (value))
#define SMC_RMW_PMPROT(base, mask, value) (SMC_WR_PMPROT(base, (SMC_RD_PMPROT(base) & ~(mask)) | (value)))
#define SMC_SET_PMPROT(base, value) (BME_OR8(&SMC_PMPROT_REG(base), (uint8_t)(value)))
#define SMC_CLR_PMPROT(base, value) (BME_AND8(&SMC_PMPROT_REG(base), (uint8_t)(~(value))))
#define SMC_TOG_PMPROT(base, value) (BME_XOR8(&SMC_PMPROT_REG(base), (uint8_t)(value)))
/*@}*/

