pyocd/FlashAlgo/source/freescale/devices/MKM33ZA5/MKM33ZA5_extension.h
/*! @brief Set the TNEAREF_MARK field to a new value. */
#define SPI_WR_C3_TNEAREF_MARK(base, value) (SPI_RMW_C3(base, SPI_C3_TNEAREF_MARK_MASK, SPI_C3_TNEAREF_MARK(value)))
#define SPI_BWR_C3_TNEAREF_MARK(base, value) (BME_BFI8(&SPI_C3_REG(base), ((uint8_t)(value) << SPI_C3_TNEAREF_MARK_SHIFT), SPI_C3_TNEAREF_MARK_SHIFT, SPI_C3_TNEAREF_MARK_WIDTH))
/*@}*/

/*
 * MKM33ZA5 TMR
 *
 * Quad Timer
 *
 * Registers defined in this header file:
 * - TMR_COMP1 - Timer Channel Compare Register 1
 * - TMR_COMP2 - Timer Channel Compare Register 2
 * - TMR_CAPT - Timer Channel Capture Register
 * - TMR_LOAD - Timer Channel Load Register
 * - TMR_HOLD - Timer Channel Hold Register
 * - TMR_CNTR - Timer Channel Counter Register
 * - TMR_CTRL - Timer Channel Control Register
 * - TMR_SCTRL - Timer Channel Status and Control Register
 * - TMR_CMPLD1 - Timer Channel Comparator Load Register 1
 * - TMR_CMPLD2 - Timer Channel Comparator Load Register 2
 * - TMR_CSCTRL - Timer Channel Comparator Status and Control Register
 * - TMR_FILT - Timer Channel Input Filter Register
 * - TMR_ENBL - Timer Channel Enable Register
 */

#define TMR_INSTANCE_COUNT (4U) /*!< Number of instances of the TMR module. */
#define TMR0_IDX (0U) /*!< Instance number for TMR0. */
#define TMR1_IDX (1U) /*!< Instance number for TMR1. */
#define TMR2_IDX (2U) /*!< Instance number for TMR2. */
#define TMR3_IDX (3U) /*!< Instance number for TMR3. */

/*******************************************************************************
 * TMR_COMP1 - Timer Channel Compare Register 1
 ******************************************************************************/

/*!
 * @brief TMR_COMP1 - Timer Channel Compare Register 1 (RW)
 *
 * Reset value: 0x0000U
 */
/*!
 * @name Constants and macros for entire TMR_COMP1 register
 */
/*@{*/
#define TMR_RD_COMP1(base)       (TMR_COMP1_REG(base))
#define TMR_WR_COMP1(base, value) (TMR_COMP1_REG(base) = (value))
#define TMR_RMW_COMP1(base, mask, value) (TMR_WR_COMP1(base, (TMR_RD_COMP1(base) & ~(mask)) | (value)))
#define TMR_SET_COMP1(base, value) (BME_OR16(&TMR_COMP1_REG(base), (uint16_t)(value)))
#define TMR_CLR_COMP1(base, value) (BME_AND16(&TMR_COMP1_REG(base), (uint16_t)(~(value))))
#define TMR_TOG_COMP1(base, value) (BME_XOR16(&TMR_COMP1_REG(base), (uint16_t)(value)))
/*@}*/

/*******************************************************************************
 * TMR_COMP2 - Timer Channel Compare Register 2
 ******************************************************************************/

/*!
 * @brief TMR_COMP2 - Timer Channel Compare Register 2 (RW)
 *
 * Reset value: 0x0000U
 */
/*!
 * @name Constants and macros for entire TMR_COMP2 register
 */
/*@{*/
#define TMR_RD_COMP2(base)       (TMR_COMP2_REG(base))
#define TMR_WR_COMP2(base, value) (TMR_COMP2_REG(base) = (value))
#define TMR_RMW_COMP2(base, mask, value) (TMR_WR_COMP2(base, (TMR_RD_COMP2(base) & ~(mask)) | (value)))
#define TMR_SET_COMP2(base, value) (BME_OR16(&TMR_COMP2_REG(base), (uint16_t)(value)))
#define TMR_CLR_COMP2(base, value) (BME_AND16(&TMR_COMP2_REG(base), (uint16_t)(~(value))))
#define TMR_TOG_COMP2(base, value) (BME_XOR16(&TMR_COMP2_REG(base), (uint16_t)(value)))
/*@}*/

/*******************************************************************************
 * TMR_CAPT - Timer Channel Capture Register
 ******************************************************************************/

/*!
 * @brief TMR_CAPT - Timer Channel Capture Register (RW)
 *
 * Reset value: 0x0000U
 */
/*!
 * @name Constants and macros for entire TMR_CAPT register
 */
/*@{*/
#define TMR_RD_CAPT(base)        (TMR_CAPT_REG(base))
#define TMR_WR_CAPT(base, value) (TMR_CAPT_REG(base) = (value))
#define TMR_RMW_CAPT(base, mask, value) (TMR_WR_CAPT(base, (TMR_RD_CAPT(base) & ~(mask)) | (value)))
#define TMR_SET_CAPT(base, value) (BME_OR16(&TMR_CAPT_REG(base), (uint16_t)(value)))
#define TMR_CLR_CAPT(base, value) (BME_AND16(&TMR_CAPT_REG(base), (uint16_t)(~(value))))
#define TMR_TOG_CAPT(base, value) (BME_XOR16(&TMR_CAPT_REG(base), (uint16_t)(value)))
/*@}*/

/*******************************************************************************
 * TMR_LOAD - Timer Channel Load Register
 ******************************************************************************/

/*!
 * @brief TMR_LOAD - Timer Channel Load Register (RW)
 *
 * Reset value: 0x0000U
 */
/*!
 * @name Constants and macros for entire TMR_LOAD register
 */
/*@{*/
#define TMR_RD_LOAD(base)        (TMR_LOAD_REG(base))
#define TMR_WR_LOAD(base, value) (TMR_LOAD_REG(base) = (value))
#define TMR_RMW_LOAD(base, mask, value) (TMR_WR_LOAD(base, (TMR_RD_LOAD(base) & ~(mask)) | (value)))
#define TMR_SET_LOAD(base, value) (BME_OR16(&TMR_LOAD_REG(base), (uint16_t)(value)))
#define TMR_CLR_LOAD(base, value) (BME_AND16(&TMR_LOAD_REG(base), (uint16_t)(~(value))))
#define TMR_TOG_LOAD(base, value) (BME_XOR16(&TMR_LOAD_REG(base), (uint16_t)(value)))
/*@}*/

/*******************************************************************************
 * TMR_HOLD - Timer Channel Hold Register
 ******************************************************************************/

/*!
 * @brief TMR_HOLD - Timer Channel Hold Register (RW)
 *
 * Reset value: 0x0000U
 */
/*!
 * @name Constants and macros for entire TMR_HOLD register
 */
/*@{*/
#define TMR_RD_HOLD(base)        (TMR_HOLD_REG(base))
#define TMR_WR_HOLD(base, value) (TMR_HOLD_REG(base) = (value))
#define TMR_RMW_HOLD(base, mask, value) (TMR_WR_HOLD(base, (TMR_RD_HOLD(base) & ~(mask)) | (value)))
#define TMR_SET_HOLD(base, value) (BME_OR16(&TMR_HOLD_REG(base), (uint16_t)(value)))
#define TMR_CLR_HOLD(base, value) (BME_AND16(&TMR_HOLD_REG(base), (uint16_t)(~(value))))
#define TMR_TOG_HOLD(base, value) (BME_XOR16(&TMR_HOLD_REG(base), (uint16_t)(value)))
/*@}*/

/*******************************************************************************
 * TMR_CNTR - Timer Channel Counter Register
 ******************************************************************************/

/*!
 * @brief TMR_CNTR - Timer Channel Counter Register (RW)
 *
 * Reset value: 0x0000U
 */
/*!
 * @name Constants and macros for entire TMR_CNTR register
 */
/*@{*/
#define TMR_RD_CNTR(base)        (TMR_CNTR_REG(base))
#define TMR_WR_CNTR(base, value) (TMR_CNTR_REG(base) = (value))
#define TMR_RMW_CNTR(base, mask, value) (TMR_WR_CNTR(base, (TMR_RD_CNTR(base) & ~(mask)) | (value)))
#define TMR_SET_CNTR(base, value) (BME_OR16(&TMR_CNTR_REG(base), (uint16_t)(value)))
#define TMR_CLR_CNTR(base, value) (BME_AND16(&TMR_CNTR_REG(base), (uint16_t)(~(value))))
#define TMR_TOG_CNTR(base, value) (BME_XOR16(&TMR_CNTR_REG(base), (uint16_t)(value)))
/*@}*/

