pyocd/FlashAlgo/source/freescale/devices/MKM33ZA5/MKM33ZA5_extension.h
/*******************************************************************************
 * TMR_ENBL - Timer Channel Enable Register
 ******************************************************************************/

/*!
 * @brief TMR_ENBL - Timer Channel Enable Register (RW)
 *
 * Reset value: 0x000FU
 */
/*!
 * @name Constants and macros for entire TMR_ENBL register
 */
/*@{*/
#define TMR_RD_ENBL(base)        (TMR_ENBL_REG(base))
#define TMR_WR_ENBL(base, value) (TMR_ENBL_REG(base) = (value))
#define TMR_RMW_ENBL(base, mask, value) (TMR_WR_ENBL(base, (TMR_RD_ENBL(base) & ~(mask)) | (value)))
#define TMR_SET_ENBL(base, value) (BME_OR16(&TMR_ENBL_REG(base), (uint16_t)(value)))
#define TMR_CLR_ENBL(base, value) (BME_AND16(&TMR_ENBL_REG(base), (uint16_t)(~(value))))
#define TMR_TOG_ENBL(base, value) (BME_XOR16(&TMR_ENBL_REG(base), (uint16_t)(value)))
/*@}*/

/*
 * Constants & macros for individual TMR_ENBL bitfields
 */

/*!
 * @name Register TMR_ENBL, field ENBL[3:0] (RW)
 *
 * These bits enable the prescaler (if it is being used) and counter in each
 * channel. Multiple ENBL bits can be set at the same time to synchronize the start
 * of separate counters. If an ENBL bit is set, then the corresponding channel
 * starts its counter as soon as the CTRL[CM] field has a value other than 0. When
 * an ENBL bit is clear, the corresponding counter maintains its current value.
 *
 * Values:
 * - 0 - Timer channel is disabled.
 * - 1 - Timer channel is enabled. (default)
 */
/*@{*/
/*! @brief Read current value of the TMR_ENBL_ENBL field. */
#define TMR_RD_ENBL_ENBL(base) ((TMR_ENBL_REG(base) & TMR_ENBL_ENBL_MASK) >> TMR_ENBL_ENBL_SHIFT)
#define TMR_BRD_ENBL_ENBL(base) (BME_UBFX16(&TMR_ENBL_REG(base), TMR_ENBL_ENBL_SHIFT, TMR_ENBL_ENBL_WIDTH))

/*! @brief Set the ENBL field to a new value. */
#define TMR_WR_ENBL_ENBL(base, value) (TMR_RMW_ENBL(base, TMR_ENBL_ENBL_MASK, TMR_ENBL_ENBL(value)))
#define TMR_BWR_ENBL_ENBL(base, value) (BME_BFI16(&TMR_ENBL_REG(base), ((uint16_t)(value) << TMR_ENBL_ENBL_SHIFT), TMR_ENBL_ENBL_SHIFT, TMR_ENBL_ENBL_WIDTH))
/*@}*/

/*
 * MKM33ZA5 UART
 *
 * Serial Communication Interface
 *
 * Registers defined in this header file:
 * - UART_BDH - UART Baud Rate Registers: High
 * - UART_BDL - UART Baud Rate Registers: Low
 * - UART_C1 - UART Control Register 1
 * - UART_C2 - UART Control Register 2
 * - UART_S1 - UART Status Register 1
 * - UART_S2 - UART Status Register 2
 * - UART_C3 - UART Control Register 3
 * - UART_D - UART Data Register
 * - UART_MA1 - UART Match Address Registers 1
 * - UART_MA2 - UART Match Address Registers 2
 * - UART_C4 - UART Control Register 4
 * - UART_C5 - UART Control Register 5
 * - UART_ED - UART Extended Data Register
 * - UART_MODEM - UART Modem Register
 * - UART_PFIFO - UART FIFO Parameters
 * - UART_CFIFO - UART FIFO Control Register
 * - UART_SFIFO - UART FIFO Status Register
 * - UART_TWFIFO - UART FIFO Transmit Watermark
 * - UART_TCFIFO - UART FIFO Transmit Count
 * - UART_RWFIFO - UART FIFO Receive Watermark
 * - UART_RCFIFO - UART FIFO Receive Count
 * - UART_C7816 - UART 7816 Control Register
 * - UART_IE7816 - UART 7816 Interrupt Enable Register
 * - UART_IS7816 - UART 7816 Interrupt Status Register
 * - UART_WP7816T0 - UART 7816 Wait Parameter Register
 * - UART_WP7816T1 - UART 7816 Wait Parameter Register
 * - UART_WN7816 - UART 7816 Wait N Register
 * - UART_WF7816 - UART 7816 Wait FD Register
 * - UART_ET7816 - UART 7816 Error Threshold Register
 * - UART_TL7816 - UART 7816 Transmit Length Register
 */

#define UART_INSTANCE_COUNT (4U) /*!< Number of instances of the UART module. */
#define UART0_IDX (0U) /*!< Instance number for UART0. */
#define UART1_IDX (1U) /*!< Instance number for UART1. */
#define UART2_IDX (2U) /*!< Instance number for UART2. */
#define UART3_IDX (3U) /*!< Instance number for UART3. */

/*******************************************************************************
 * UART_BDH - UART Baud Rate Registers: High
 ******************************************************************************/

/*!
 * @brief UART_BDH - UART Baud Rate Registers: High (RW)
 *
 * Reset value: 0x00U
 *
 * This register, along with the BDL register, controls the prescale divisor for
 * UART baud rate generation. To update the 13-bit baud rate setting
 * (SBR[12:0]), first write to BDH to buffer the high half of the new value and then write
 * to BDL. The working value in BDH does not change until BDL is written. BDL is
 * reset to a nonzero value, but after reset, the baud rate generator remains
 * disabled until the first time the receiver or transmitter is enabled, that is,
 * when C2[RE] or C2[TE] is set.
 */
/*!
 * @name Constants and macros for entire UART_BDH register
 */
/*@{*/
#define UART_RD_BDH(base)        (UART_BDH_REG(base))
#define UART_WR_BDH(base, value) (UART_BDH_REG(base) = (value))
#define UART_RMW_BDH(base, mask, value) (UART_WR_BDH(base, (UART_RD_BDH(base) & ~(mask)) | (value)))
#define UART_SET_BDH(base, value) (BME_OR8(&UART_BDH_REG(base), (uint8_t)(value)))
#define UART_CLR_BDH(base, value) (BME_AND8(&UART_BDH_REG(base), (uint8_t)(~(value))))
#define UART_TOG_BDH(base, value) (BME_XOR8(&UART_BDH_REG(base), (uint8_t)(value)))
/*@}*/

/*
 * Constants & macros for individual UART_BDH bitfields
 */

/*!
 * @name Register UART_BDH, field SBR[4:0] (RW)
 *
 * The baud rate for the UART is determined by the 13 SBR fields. See Baud rate
 * generation for details. The baud rate generator is disabled until C2[TE] or
 * C2[RE] is set for the first time after reset.The baud rate generator is disabled
 * when SBR = 0. Writing to BDH has no effect without writing to BDL, because
 * writing to BDH puts the data in a temporary location until BDL is written.
 */
/*@{*/
/*! @brief Read current value of the UART_BDH_SBR field. */
#define UART_RD_BDH_SBR(base) ((UART_BDH_REG(base) & UART_BDH_SBR_MASK) >> UART_BDH_SBR_SHIFT)
#define UART_BRD_BDH_SBR(base) (BME_UBFX8(&UART_BDH_REG(base), UART_BDH_SBR_SHIFT, UART_BDH_SBR_WIDTH))

/*! @brief Set the SBR field to a new value. */
#define UART_WR_BDH_SBR(base, value) (UART_RMW_BDH(base, UART_BDH_SBR_MASK, UART_BDH_SBR(value)))
#define UART_BWR_BDH_SBR(base, value) (BME_BFI8(&UART_BDH_REG(base), ((uint8_t)(value) << UART_BDH_SBR_SHIFT), UART_BDH_SBR_SHIFT, UART_BDH_SBR_WIDTH))
/*@}*/

/*!
 * @name Register UART_BDH, field RXEDGIE[6] (RW)
 *
 * Enables the receive input active edge, RXEDGIF, to generate interrupt
 * requests.
 *
 * Values:
 * - 0 - Hardware interrupts from RXEDGIF disabled using polling.
 * - 1 - RXEDGIF interrupt request enabled.
 */
/*@{*/
/*! @brief Read current value of the UART_BDH_RXEDGIE field. */
#define UART_RD_BDH_RXEDGIE(base) ((UART_BDH_REG(base) & UART_BDH_RXEDGIE_MASK) >> UART_BDH_RXEDGIE_SHIFT)
#define UART_BRD_BDH_RXEDGIE(base) (BME_UBFX8(&UART_BDH_REG(base), UART_BDH_RXEDGIE_SHIFT, UART_BDH_RXEDGIE_WIDTH))

/*! @brief Set the RXEDGIE field to a new value. */
#define UART_WR_BDH_RXEDGIE(base, value) (UART_RMW_BDH(base, UART_BDH_RXEDGIE_MASK, UART_BDH_RXEDGIE(value)))
#define UART_BWR_BDH_RXEDGIE(base, value) (BME_BFI8(&UART_BDH_REG(base), ((uint8_t)(value) << UART_BDH_RXEDGIE_SHIFT), UART_BDH_RXEDGIE_SHIFT, UART_BDH_RXEDGIE_WIDTH))
/*@}*/

