pyocd/FlashAlgo/source/freescale/devices/MKM33ZA5/MKM33ZA5_extension.h
/*******************************************************************************
 * VREF_VREFL_TRM - VREFL TRIM Register
 ******************************************************************************/

/*!
 * @brief VREF_VREFL_TRM - VREFL TRIM Register (RW)
 *
 * Reset value: 0x00U
 *
 * This register contains bits that contain enable and trim data for VREFL (0.4
 * V) reference. It also contains a bit to select between internal and external
 * 1.2 V reference.
 */
/*!
 * @name Constants and macros for entire VREF_VREFL_TRM register
 */
/*@{*/
#define VREF_RD_VREFL_TRM(base)  (VREF_VREFL_TRM_REG(base))
#define VREF_WR_VREFL_TRM(base, value) (VREF_VREFL_TRM_REG(base) = (value))
#define VREF_RMW_VREFL_TRM(base, mask, value) (VREF_WR_VREFL_TRM(base, (VREF_RD_VREFL_TRM(base) & ~(mask)) | (value)))
#define VREF_SET_VREFL_TRM(base, value) (BME_OR8(&VREF_VREFL_TRM_REG(base), (uint8_t)(value)))
#define VREF_CLR_VREFL_TRM(base, value) (BME_AND8(&VREF_VREFL_TRM_REG(base), (uint8_t)(~(value))))
#define VREF_TOG_VREFL_TRM(base, value) (BME_XOR8(&VREF_VREFL_TRM_REG(base), (uint8_t)(value)))
/*@}*/

/*
 * Constants & macros for individual VREF_VREFL_TRM bitfields
 */

/*!
 * @name Register VREF_VREFL_TRM, field VREFL_TRIM[2:0] (RW)
 *
 * These bits trim the VREFL reference voltage in steps of 10 mV. The mid
 * voltage of the trim range is 0.4 V at the trim value of 3'b011. Value of VREFL_TRIM
 * (default 011) is determined by ifr.
 */
/*@{*/
/*! @brief Read current value of the VREF_VREFL_TRM_VREFL_TRIM field. */
#define VREF_RD_VREFL_TRM_VREFL_TRIM(base) ((VREF_VREFL_TRM_REG(base) & VREF_VREFL_TRM_VREFL_TRIM_MASK) >> VREF_VREFL_TRM_VREFL_TRIM_SHIFT)
#define VREF_BRD_VREFL_TRM_VREFL_TRIM(base) (BME_UBFX8(&VREF_VREFL_TRM_REG(base), VREF_VREFL_TRM_VREFL_TRIM_SHIFT, VREF_VREFL_TRM_VREFL_TRIM_WIDTH))

/*! @brief Set the VREFL_TRIM field to a new value. */
#define VREF_WR_VREFL_TRM_VREFL_TRIM(base, value) (VREF_RMW_VREFL_TRM(base, VREF_VREFL_TRM_VREFL_TRIM_MASK, VREF_VREFL_TRM_VREFL_TRIM(value)))
#define VREF_BWR_VREFL_TRM_VREFL_TRIM(base, value) (BME_BFI8(&VREF_VREFL_TRM_REG(base), ((uint8_t)(value) << VREF_VREFL_TRM_VREFL_TRIM_SHIFT), VREF_VREFL_TRM_VREFL_TRIM_SHIFT, VREF_VREFL_TRM_VREFL_TRIM_WIDTH))
/*@}*/

/*!
 * @name Register VREF_VREFL_TRM, field VREFL_EN[3] (RW)
 *
 * This bit enables the VREFL (0.4 V) reference buffer.
 *
 * Values:
 * - 0 - Disable
 * - 1 - Enable
 */
/*@{*/
/*! @brief Read current value of the VREF_VREFL_TRM_VREFL_EN field. */
#define VREF_RD_VREFL_TRM_VREFL_EN(base) ((VREF_VREFL_TRM_REG(base) & VREF_VREFL_TRM_VREFL_EN_MASK) >> VREF_VREFL_TRM_VREFL_EN_SHIFT)
#define VREF_BRD_VREFL_TRM_VREFL_EN(base) (BME_UBFX8(&VREF_VREFL_TRM_REG(base), VREF_VREFL_TRM_VREFL_EN_SHIFT, VREF_VREFL_TRM_VREFL_EN_WIDTH))

/*! @brief Set the VREFL_EN field to a new value. */
#define VREF_WR_VREFL_TRM_VREFL_EN(base, value) (VREF_RMW_VREFL_TRM(base, VREF_VREFL_TRM_VREFL_EN_MASK, VREF_VREFL_TRM_VREFL_EN(value)))
#define VREF_BWR_VREFL_TRM_VREFL_EN(base, value) (BME_BFI8(&VREF_VREFL_TRM_REG(base), ((uint8_t)(value) << VREF_VREFL_TRM_VREFL_EN_SHIFT), VREF_VREFL_TRM_VREFL_EN_SHIFT, VREF_VREFL_TRM_VREFL_EN_WIDTH))
/*@}*/

/*!
 * @name Register VREF_VREFL_TRM, field VREFL_SEL[4] (RW)
 *
 * This bit selects between internal and external 1.2 V reference.
 *
 * Values:
 * - 0 - Internal reference
 * - 1 - External reference
 */
/*@{*/
/*! @brief Read current value of the VREF_VREFL_TRM_VREFL_SEL field. */
#define VREF_RD_VREFL_TRM_VREFL_SEL(base) ((VREF_VREFL_TRM_REG(base) & VREF_VREFL_TRM_VREFL_SEL_MASK) >> VREF_VREFL_TRM_VREFL_SEL_SHIFT)
#define VREF_BRD_VREFL_TRM_VREFL_SEL(base) (BME_UBFX8(&VREF_VREFL_TRM_REG(base), VREF_VREFL_TRM_VREFL_SEL_SHIFT, VREF_VREFL_TRM_VREFL_SEL_WIDTH))

/*! @brief Set the VREFL_SEL field to a new value. */
#define VREF_WR_VREFL_TRM_VREFL_SEL(base, value) (VREF_RMW_VREFL_TRM(base, VREF_VREFL_TRM_VREFL_SEL_MASK, VREF_VREFL_TRM_VREFL_SEL(value)))
#define VREF_BWR_VREFL_TRM_VREFL_SEL(base, value) (BME_BFI8(&VREF_VREFL_TRM_REG(base), ((uint8_t)(value) << VREF_VREFL_TRM_VREFL_SEL_SHIFT), VREF_VREFL_TRM_VREFL_SEL_SHIFT, VREF_VREFL_TRM_VREFL_SEL_WIDTH))
/*@}*/

/*
 * MKM33ZA5 WDOG
 *
 * Generation 2008 Watchdog Timer
 *
 * Registers defined in this header file:
 * - WDOG_STCTRLH - Watchdog Status and Control Register High
 * - WDOG_STCTRLL - Watchdog Status and Control Register Low
 * - WDOG_TOVALH - Watchdog Time-out Value Register High
 * - WDOG_TOVALL - Watchdog Time-out Value Register Low
 * - WDOG_WINH - Watchdog Window Register High
 * - WDOG_WINL - Watchdog Window Register Low
 * - WDOG_REFRESH - Watchdog Refresh register
 * - WDOG_UNLOCK - Watchdog Unlock register
 * - WDOG_TMROUTH - Watchdog Timer Output Register High
 * - WDOG_TMROUTL - Watchdog Timer Output Register Low
 * - WDOG_RSTCNT - Watchdog Reset Count register
 * - WDOG_PRESC - Watchdog Prescaler register
 */

#define WDOG_INSTANCE_COUNT (1U) /*!< Number of instances of the WDOG module. */
#define WDOG_IDX (0U) /*!< Instance number for WDOG. */

/*******************************************************************************
 * WDOG_STCTRLH - Watchdog Status and Control Register High
 ******************************************************************************/

/*!
 * @brief WDOG_STCTRLH - Watchdog Status and Control Register High (RW)
 *
 * Reset value: 0x01D1U
 */
/*!
 * @name Constants and macros for entire WDOG_STCTRLH register
 */
/*@{*/
#define WDOG_RD_STCTRLH(base)    (WDOG_STCTRLH_REG(base))
#define WDOG_WR_STCTRLH(base, value) (WDOG_STCTRLH_REG(base) = (value))
#define WDOG_RMW_STCTRLH(base, mask, value) (WDOG_WR_STCTRLH(base, (WDOG_RD_STCTRLH(base) & ~(mask)) | (value)))
#define WDOG_SET_STCTRLH(base, value) (BME_OR16(&WDOG_STCTRLH_REG(base), (uint16_t)(value)))
#define WDOG_CLR_STCTRLH(base, value) (BME_AND16(&WDOG_STCTRLH_REG(base), (uint16_t)(~(value))))
#define WDOG_TOG_STCTRLH(base, value) (BME_XOR16(&WDOG_STCTRLH_REG(base), (uint16_t)(value)))
/*@}*/

/*
 * Constants & macros for individual WDOG_STCTRLH bitfields
 */

/*!
 * @name Register WDOG_STCTRLH, field WDOGEN[0] (RW)
 *
 * Enables or disables the WDOG's operation. In the disabled state, the watchdog
 * timer is kept in the reset state, but the other exception conditions can
 * still trigger a reset/interrupt. A change in the value of this bit must be held
 * for more than one WDOG_CLK cycle for the WDOG to be enabled or disabled.
 *
 * Values:
 * - 0 - WDOG is disabled.
 * - 1 - WDOG is enabled.
 */
/*@{*/
/*! @brief Read current value of the WDOG_STCTRLH_WDOGEN field. */
#define WDOG_RD_STCTRLH_WDOGEN(base) ((WDOG_STCTRLH_REG(base) & WDOG_STCTRLH_WDOGEN_MASK) >> WDOG_STCTRLH_WDOGEN_SHIFT)
#define WDOG_BRD_STCTRLH_WDOGEN(base) (BME_UBFX16(&WDOG_STCTRLH_REG(base), WDOG_STCTRLH_WDOGEN_SHIFT, WDOG_STCTRLH_WDOGEN_WIDTH))

/*! @brief Set the WDOGEN field to a new value. */
#define WDOG_WR_STCTRLH_WDOGEN(base, value) (WDOG_RMW_STCTRLH(base, WDOG_STCTRLH_WDOGEN_MASK, WDOG_STCTRLH_WDOGEN(value)))
#define WDOG_BWR_STCTRLH_WDOGEN(base, value) (BME_BFI16(&WDOG_STCTRLH_REG(base), ((uint16_t)(value) << WDOG_STCTRLH_WDOGEN_SHIFT), WDOG_STCTRLH_WDOGEN_SHIFT, WDOG_STCTRLH_WDOGEN_WIDTH))
/*@}*/

/*!
 * @name Register WDOG_STCTRLH, field CLKSRC[1] (RW)
 *
 * Selects clock source for the WDOG timer and other internal timing operations.
 *
 * Values:
 * - 0 - WDOG clock sourced from LPO .
 * - 1 - WDOG clock sourced from alternate clock source.
 */
/*@{*/
/*! @brief Read current value of the WDOG_STCTRLH_CLKSRC field. */
#define WDOG_RD_STCTRLH_CLKSRC(base) ((WDOG_STCTRLH_REG(base) & WDOG_STCTRLH_CLKSRC_MASK) >> WDOG_STCTRLH_CLKSRC_SHIFT)
#define WDOG_BRD_STCTRLH_CLKSRC(base) (BME_UBFX16(&WDOG_STCTRLH_REG(base), WDOG_STCTRLH_CLKSRC_SHIFT, WDOG_STCTRLH_CLKSRC_WIDTH))

