pyocd/FlashAlgo/source/freescale/devices/MKM33ZA5/MKM33ZA5_extension.h
/*******************************************************************************
 * XBAR_SEL2 - Crossbar Select Register 2
 ******************************************************************************/

/*!
 * @brief XBAR_SEL2 - Crossbar Select Register 2 (RW)
 *
 * Reset value: 0x0000U
 */
/*!
 * @name Constants and macros for entire XBAR_SEL2 register
 */
/*@{*/
#define XBAR_RD_SEL2(base)       (XBAR_SEL2_REG(base))
#define XBAR_WR_SEL2(base, value) (XBAR_SEL2_REG(base) = (value))
#define XBAR_RMW_SEL2(base, mask, value) (XBAR_WR_SEL2(base, (XBAR_RD_SEL2(base) & ~(mask)) | (value)))
#define XBAR_SET_SEL2(base, value) (BME_OR16(&XBAR_SEL2_REG(base), (uint16_t)(value)))
#define XBAR_CLR_SEL2(base, value) (BME_AND16(&XBAR_SEL2_REG(base), (uint16_t)(~(value))))
#define XBAR_TOG_SEL2(base, value) (BME_XOR16(&XBAR_SEL2_REG(base), (uint16_t)(value)))
/*@}*/

/*
 * Constants & macros for individual XBAR_SEL2 bitfields
 */

/*!
 * @name Register XBAR_SEL2, field SEL4[5:0] (RW)
 *
 * Input (XBAR_INn) to be muxed to XBAR_OUT4 (refer to Functional Description
 * section for input/output assignment)
 */
/*@{*/
/*! @brief Read current value of the XBAR_SEL2_SEL4 field. */
#define XBAR_RD_SEL2_SEL4(base) ((XBAR_SEL2_REG(base) & XBAR_SEL2_SEL4_MASK) >> XBAR_SEL2_SEL4_SHIFT)
#define XBAR_BRD_SEL2_SEL4(base) (BME_UBFX16(&XBAR_SEL2_REG(base), XBAR_SEL2_SEL4_SHIFT, XBAR_SEL2_SEL4_WIDTH))

/*! @brief Set the SEL4 field to a new value. */
#define XBAR_WR_SEL2_SEL4(base, value) (XBAR_RMW_SEL2(base, XBAR_SEL2_SEL4_MASK, XBAR_SEL2_SEL4(value)))
#define XBAR_BWR_SEL2_SEL4(base, value) (BME_BFI16(&XBAR_SEL2_REG(base), ((uint16_t)(value) << XBAR_SEL2_SEL4_SHIFT), XBAR_SEL2_SEL4_SHIFT, XBAR_SEL2_SEL4_WIDTH))
/*@}*/

/*!
 * @name Register XBAR_SEL2, field SEL5[13:8] (RW)
 *
 * Input (XBAR_INn) to be muxed to XBAR_OUT5 (refer to Functional Description
 * section for input/output assignment)
 */
/*@{*/
/*! @brief Read current value of the XBAR_SEL2_SEL5 field. */
#define XBAR_RD_SEL2_SEL5(base) ((XBAR_SEL2_REG(base) & XBAR_SEL2_SEL5_MASK) >> XBAR_SEL2_SEL5_SHIFT)
#define XBAR_BRD_SEL2_SEL5(base) (BME_UBFX16(&XBAR_SEL2_REG(base), XBAR_SEL2_SEL5_SHIFT, XBAR_SEL2_SEL5_WIDTH))

/*! @brief Set the SEL5 field to a new value. */
#define XBAR_WR_SEL2_SEL5(base, value) (XBAR_RMW_SEL2(base, XBAR_SEL2_SEL5_MASK, XBAR_SEL2_SEL5(value)))
#define XBAR_BWR_SEL2_SEL5(base, value) (BME_BFI16(&XBAR_SEL2_REG(base), ((uint16_t)(value) << XBAR_SEL2_SEL5_SHIFT), XBAR_SEL2_SEL5_SHIFT, XBAR_SEL2_SEL5_WIDTH))
/*@}*/

/*******************************************************************************
 * XBAR_SEL3 - Crossbar Select Register 3
 ******************************************************************************/

/*!
 * @brief XBAR_SEL3 - Crossbar Select Register 3 (RW)
 *
 * Reset value: 0x0000U
 */
/*!
 * @name Constants and macros for entire XBAR_SEL3 register
 */
/*@{*/
#define XBAR_RD_SEL3(base)       (XBAR_SEL3_REG(base))
#define XBAR_WR_SEL3(base, value) (XBAR_SEL3_REG(base) = (value))
#define XBAR_RMW_SEL3(base, mask, value) (XBAR_WR_SEL3(base, (XBAR_RD_SEL3(base) & ~(mask)) | (value)))
#define XBAR_SET_SEL3(base, value) (BME_OR16(&XBAR_SEL3_REG(base), (uint16_t)(value)))
#define XBAR_CLR_SEL3(base, value) (BME_AND16(&XBAR_SEL3_REG(base), (uint16_t)(~(value))))
#define XBAR_TOG_SEL3(base, value) (BME_XOR16(&XBAR_SEL3_REG(base), (uint16_t)(value)))
/*@}*/

/*
 * Constants & macros for individual XBAR_SEL3 bitfields
 */

/*!
 * @name Register XBAR_SEL3, field SEL6[5:0] (RW)
 *
 * Input (XBAR_INn) to be muxed to XBAR_OUT6 (refer to Functional Description
 * section for input/output assignment)
 */
/*@{*/
/*! @brief Read current value of the XBAR_SEL3_SEL6 field. */
#define XBAR_RD_SEL3_SEL6(base) ((XBAR_SEL3_REG(base) & XBAR_SEL3_SEL6_MASK) >> XBAR_SEL3_SEL6_SHIFT)
#define XBAR_BRD_SEL3_SEL6(base) (BME_UBFX16(&XBAR_SEL3_REG(base), XBAR_SEL3_SEL6_SHIFT, XBAR_SEL3_SEL6_WIDTH))

/*! @brief Set the SEL6 field to a new value. */
#define XBAR_WR_SEL3_SEL6(base, value) (XBAR_RMW_SEL3(base, XBAR_SEL3_SEL6_MASK, XBAR_SEL3_SEL6(value)))
#define XBAR_BWR_SEL3_SEL6(base, value) (BME_BFI16(&XBAR_SEL3_REG(base), ((uint16_t)(value) << XBAR_SEL3_SEL6_SHIFT), XBAR_SEL3_SEL6_SHIFT, XBAR_SEL3_SEL6_WIDTH))
/*@}*/

/*!
 * @name Register XBAR_SEL3, field SEL7[13:8] (RW)
 *
 * Input (XBAR_INn) to be muxed to XBAR_OUT7 (refer to Functional Description
 * section for input/output assignment)
 */
/*@{*/
/*! @brief Read current value of the XBAR_SEL3_SEL7 field. */
#define XBAR_RD_SEL3_SEL7(base) ((XBAR_SEL3_REG(base) & XBAR_SEL3_SEL7_MASK) >> XBAR_SEL3_SEL7_SHIFT)
#define XBAR_BRD_SEL3_SEL7(base) (BME_UBFX16(&XBAR_SEL3_REG(base), XBAR_SEL3_SEL7_SHIFT, XBAR_SEL3_SEL7_WIDTH))

/*! @brief Set the SEL7 field to a new value. */
#define XBAR_WR_SEL3_SEL7(base, value) (XBAR_RMW_SEL3(base, XBAR_SEL3_SEL7_MASK, XBAR_SEL3_SEL7(value)))
#define XBAR_BWR_SEL3_SEL7(base, value) (BME_BFI16(&XBAR_SEL3_REG(base), ((uint16_t)(value) << XBAR_SEL3_SEL7_SHIFT), XBAR_SEL3_SEL7_SHIFT, XBAR_SEL3_SEL7_WIDTH))
/*@}*/

/*******************************************************************************
 * XBAR_SEL4 - Crossbar Select Register 4
 ******************************************************************************/

/*!
 * @brief XBAR_SEL4 - Crossbar Select Register 4 (RW)
 *
 * Reset value: 0x0000U
 */
/*!
 * @name Constants and macros for entire XBAR_SEL4 register
 */
/*@{*/
#define XBAR_RD_SEL4(base)       (XBAR_SEL4_REG(base))
#define XBAR_WR_SEL4(base, value) (XBAR_SEL4_REG(base) = (value))
#define XBAR_RMW_SEL4(base, mask, value) (XBAR_WR_SEL4(base, (XBAR_RD_SEL4(base) & ~(mask)) | (value)))
#define XBAR_SET_SEL4(base, value) (BME_OR16(&XBAR_SEL4_REG(base), (uint16_t)(value)))
#define XBAR_CLR_SEL4(base, value) (BME_AND16(&XBAR_SEL4_REG(base), (uint16_t)(~(value))))
#define XBAR_TOG_SEL4(base, value) (BME_XOR16(&XBAR_SEL4_REG(base), (uint16_t)(value)))
/*@}*/

/*
 * Constants & macros for individual XBAR_SEL4 bitfields
 */

/*!
 * @name Register XBAR_SEL4, field SEL8[5:0] (RW)
 *
 * Input (XBAR_INn) to be muxed to XBAR_OUT8 (refer to Functional Description
 * section for input/output assignment)
 */
/*@{*/
/*! @brief Read current value of the XBAR_SEL4_SEL8 field. */
#define XBAR_RD_SEL4_SEL8(base) ((XBAR_SEL4_REG(base) & XBAR_SEL4_SEL8_MASK) >> XBAR_SEL4_SEL8_SHIFT)
#define XBAR_BRD_SEL4_SEL8(base) (BME_UBFX16(&XBAR_SEL4_REG(base), XBAR_SEL4_SEL8_SHIFT, XBAR_SEL4_SEL8_WIDTH))

/*! @brief Set the SEL8 field to a new value. */
#define XBAR_WR_SEL4_SEL8(base, value) (XBAR_RMW_SEL4(base, XBAR_SEL4_SEL8_MASK, XBAR_SEL4_SEL8(value)))
#define XBAR_BWR_SEL4_SEL8(base, value) (BME_BFI16(&XBAR_SEL4_REG(base), ((uint16_t)(value) << XBAR_SEL4_SEL8_SHIFT), XBAR_SEL4_SEL8_SHIFT, XBAR_SEL4_SEL8_WIDTH))
/*@}*/

/*!
 * @name Register XBAR_SEL4, field SEL9[13:8] (RW)
 *
 * Input (XBAR_INn) to be muxed to XBAR_OUT9 (refer to Functional Description
 * section for input/output assignment)
 */
/*@{*/
/*! @brief Read current value of the XBAR_SEL4_SEL9 field. */
#define XBAR_RD_SEL4_SEL9(base) ((XBAR_SEL4_REG(base) & XBAR_SEL4_SEL9_MASK) >> XBAR_SEL4_SEL9_SHIFT)
#define XBAR_BRD_SEL4_SEL9(base) (BME_UBFX16(&XBAR_SEL4_REG(base), XBAR_SEL4_SEL9_SHIFT, XBAR_SEL4_SEL9_WIDTH))

/*! @brief Set the SEL9 field to a new value. */
#define XBAR_WR_SEL4_SEL9(base, value) (XBAR_RMW_SEL4(base, XBAR_SEL4_SEL9_MASK, XBAR_SEL4_SEL9(value)))
#define XBAR_BWR_SEL4_SEL9(base, value) (BME_BFI16(&XBAR_SEL4_REG(base), ((uint16_t)(value) << XBAR_SEL4_SEL9_SHIFT), XBAR_SEL4_SEL9_SHIFT, XBAR_SEL4_SEL9_WIDTH))
/*@}*/

