pyocd/FlashAlgo/source/freescale/devices/MKM33ZA5/MKM33ZA5_extension.h
/*! @brief Set the SEL15 field to a new value. */
#define XBAR_WR_SEL7_SEL15(base, value) (XBAR_RMW_SEL7(base, XBAR_SEL7_SEL15_MASK, XBAR_SEL7_SEL15(value)))
#define XBAR_BWR_SEL7_SEL15(base, value) (BME_BFI16(&XBAR_SEL7_REG(base), ((uint16_t)(value) << XBAR_SEL7_SEL15_SHIFT), XBAR_SEL7_SEL15_SHIFT, XBAR_SEL7_SEL15_WIDTH))
/*@}*/

/*******************************************************************************
 * XBAR_SEL8 - Crossbar Select Register 8
 ******************************************************************************/

/*!
 * @brief XBAR_SEL8 - Crossbar Select Register 8 (RW)
 *
 * Reset value: 0x0000U
 */
/*!
 * @name Constants and macros for entire XBAR_SEL8 register
 */
/*@{*/
#define XBAR_RD_SEL8(base)       (XBAR_SEL8_REG(base))
#define XBAR_WR_SEL8(base, value) (XBAR_SEL8_REG(base) = (value))
#define XBAR_RMW_SEL8(base, mask, value) (XBAR_WR_SEL8(base, (XBAR_RD_SEL8(base) & ~(mask)) | (value)))
#define XBAR_SET_SEL8(base, value) (BME_OR16(&XBAR_SEL8_REG(base), (uint16_t)(value)))
#define XBAR_CLR_SEL8(base, value) (BME_AND16(&XBAR_SEL8_REG(base), (uint16_t)(~(value))))
#define XBAR_TOG_SEL8(base, value) (BME_XOR16(&XBAR_SEL8_REG(base), (uint16_t)(value)))
/*@}*/

/*
 * Constants & macros for individual XBAR_SEL8 bitfields
 */

/*!
 * @name Register XBAR_SEL8, field SEL16[5:0] (RW)
 *
 * Input (XBAR_INn) to be muxed to XBAR_OUT16 (refer to Functional Description
 * section for input/output assignment)
 */
/*@{*/
/*! @brief Read current value of the XBAR_SEL8_SEL16 field. */
#define XBAR_RD_SEL8_SEL16(base) ((XBAR_SEL8_REG(base) & XBAR_SEL8_SEL16_MASK) >> XBAR_SEL8_SEL16_SHIFT)
#define XBAR_BRD_SEL8_SEL16(base) (BME_UBFX16(&XBAR_SEL8_REG(base), XBAR_SEL8_SEL16_SHIFT, XBAR_SEL8_SEL16_WIDTH))

/*! @brief Set the SEL16 field to a new value. */
#define XBAR_WR_SEL8_SEL16(base, value) (XBAR_RMW_SEL8(base, XBAR_SEL8_SEL16_MASK, XBAR_SEL8_SEL16(value)))
#define XBAR_BWR_SEL8_SEL16(base, value) (BME_BFI16(&XBAR_SEL8_REG(base), ((uint16_t)(value) << XBAR_SEL8_SEL16_SHIFT), XBAR_SEL8_SEL16_SHIFT, XBAR_SEL8_SEL16_WIDTH))
/*@}*/

/*!
 * @name Register XBAR_SEL8, field SEL17[13:8] (RW)
 *
 * Input (XBAR_INn) to be muxed to XBAR_OUT17 (refer to Functional Description
 * section for input/output assignment)
 */
/*@{*/
/*! @brief Read current value of the XBAR_SEL8_SEL17 field. */
#define XBAR_RD_SEL8_SEL17(base) ((XBAR_SEL8_REG(base) & XBAR_SEL8_SEL17_MASK) >> XBAR_SEL8_SEL17_SHIFT)
#define XBAR_BRD_SEL8_SEL17(base) (BME_UBFX16(&XBAR_SEL8_REG(base), XBAR_SEL8_SEL17_SHIFT, XBAR_SEL8_SEL17_WIDTH))

/*! @brief Set the SEL17 field to a new value. */
#define XBAR_WR_SEL8_SEL17(base, value) (XBAR_RMW_SEL8(base, XBAR_SEL8_SEL17_MASK, XBAR_SEL8_SEL17(value)))
#define XBAR_BWR_SEL8_SEL17(base, value) (BME_BFI16(&XBAR_SEL8_REG(base), ((uint16_t)(value) << XBAR_SEL8_SEL17_SHIFT), XBAR_SEL8_SEL17_SHIFT, XBAR_SEL8_SEL17_WIDTH))
/*@}*/

/*******************************************************************************
 * XBAR_SEL9 - Crossbar Select Register 9
 ******************************************************************************/

/*!
 * @brief XBAR_SEL9 - Crossbar Select Register 9 (RW)
 *
 * Reset value: 0x0000U
 */
/*!
 * @name Constants and macros for entire XBAR_SEL9 register
 */
/*@{*/
#define XBAR_RD_SEL9(base)       (XBAR_SEL9_REG(base))
#define XBAR_WR_SEL9(base, value) (XBAR_SEL9_REG(base) = (value))
#define XBAR_RMW_SEL9(base, mask, value) (XBAR_WR_SEL9(base, (XBAR_RD_SEL9(base) & ~(mask)) | (value)))
#define XBAR_SET_SEL9(base, value) (BME_OR16(&XBAR_SEL9_REG(base), (uint16_t)(value)))
#define XBAR_CLR_SEL9(base, value) (BME_AND16(&XBAR_SEL9_REG(base), (uint16_t)(~(value))))
#define XBAR_TOG_SEL9(base, value) (BME_XOR16(&XBAR_SEL9_REG(base), (uint16_t)(value)))
/*@}*/

/*
 * Constants & macros for individual XBAR_SEL9 bitfields
 */

/*!
 * @name Register XBAR_SEL9, field SEL18[5:0] (RW)
 *
 * Input (XBAR_INn) to be muxed to XBAR_OUT18 (refer to Functional Description
 * section for input/output assignment)
 */
/*@{*/
/*! @brief Read current value of the XBAR_SEL9_SEL18 field. */
#define XBAR_RD_SEL9_SEL18(base) ((XBAR_SEL9_REG(base) & XBAR_SEL9_SEL18_MASK) >> XBAR_SEL9_SEL18_SHIFT)
#define XBAR_BRD_SEL9_SEL18(base) (BME_UBFX16(&XBAR_SEL9_REG(base), XBAR_SEL9_SEL18_SHIFT, XBAR_SEL9_SEL18_WIDTH))

/*! @brief Set the SEL18 field to a new value. */
#define XBAR_WR_SEL9_SEL18(base, value) (XBAR_RMW_SEL9(base, XBAR_SEL9_SEL18_MASK, XBAR_SEL9_SEL18(value)))
#define XBAR_BWR_SEL9_SEL18(base, value) (BME_BFI16(&XBAR_SEL9_REG(base), ((uint16_t)(value) << XBAR_SEL9_SEL18_SHIFT), XBAR_SEL9_SEL18_SHIFT, XBAR_SEL9_SEL18_WIDTH))
/*@}*/

/*!
 * @name Register XBAR_SEL9, field SEL19[13:8] (RW)
 *
 * Input (XBAR_INn) to be muxed to XBAR_OUT19 (refer to Functional Description
 * section for input/output assignment)
 */
/*@{*/
/*! @brief Read current value of the XBAR_SEL9_SEL19 field. */
#define XBAR_RD_SEL9_SEL19(base) ((XBAR_SEL9_REG(base) & XBAR_SEL9_SEL19_MASK) >> XBAR_SEL9_SEL19_SHIFT)
#define XBAR_BRD_SEL9_SEL19(base) (BME_UBFX16(&XBAR_SEL9_REG(base), XBAR_SEL9_SEL19_SHIFT, XBAR_SEL9_SEL19_WIDTH))

/*! @brief Set the SEL19 field to a new value. */
#define XBAR_WR_SEL9_SEL19(base, value) (XBAR_RMW_SEL9(base, XBAR_SEL9_SEL19_MASK, XBAR_SEL9_SEL19(value)))
#define XBAR_BWR_SEL9_SEL19(base, value) (BME_BFI16(&XBAR_SEL9_REG(base), ((uint16_t)(value) << XBAR_SEL9_SEL19_SHIFT), XBAR_SEL9_SEL19_SHIFT, XBAR_SEL9_SEL19_WIDTH))
/*@}*/

/*******************************************************************************
 * XBAR_SEL10 - Crossbar Select Register 10
 ******************************************************************************/

/*!
 * @brief XBAR_SEL10 - Crossbar Select Register 10 (RW)
 *
 * Reset value: 0x0000U
 */
/*!
 * @name Constants and macros for entire XBAR_SEL10 register
 */
/*@{*/
#define XBAR_RD_SEL10(base)      (XBAR_SEL10_REG(base))
#define XBAR_WR_SEL10(base, value) (XBAR_SEL10_REG(base) = (value))
#define XBAR_RMW_SEL10(base, mask, value) (XBAR_WR_SEL10(base, (XBAR_RD_SEL10(base) & ~(mask)) | (value)))
#define XBAR_SET_SEL10(base, value) (BME_OR16(&XBAR_SEL10_REG(base), (uint16_t)(value)))
#define XBAR_CLR_SEL10(base, value) (BME_AND16(&XBAR_SEL10_REG(base), (uint16_t)(~(value))))
#define XBAR_TOG_SEL10(base, value) (BME_XOR16(&XBAR_SEL10_REG(base), (uint16_t)(value)))
/*@}*/

